### Количество слов в тексте

Во входном файле записан текст. Словом считается последовательность непробельных символов, идущих подряд. 
Слова разделены одним или большим числом пробелов, переводами строк или символами конца строки.
Определите, сколько различных слов содержится в этом тексте.
```py
import sys

def main():
    lines = ""

    for line in sys.stdin:
        lines += line

    words = lines.split()
    print(len(set(words)))

if __name__ == '__main__':
    main()
```
Время: 111ms. Память: 32Mb. 
