### Хорошая строка

На день рождения маленький Ипполит получил долгожданный подарок — набор дощечек с написанными на них буквами 
латинского алфавита. Теперь-то ему будет чем заняться долгими вечерами, тем более что мама обещала подарить 
ему в следующем году последовательность целых неотрицательных чисел, если он хорошо освоит этот набор. 
Ради такого богатства Ипполит готов на многое.

Прямо сейчас юный исследователь полностью поглощён изучением хорошести строк. Хорошестью строки называется 
количество позиций от 1 до _L_ - 1 (где _L_ — длина строки), таких, что следующая буква в строке является следующей 
по алфавиту. Например, хорошесть строки _abcdefghijklmnopqrstuvwxyz_ равна 25, а строки _abdc_ — только 1.

Ипполит размышляет над решением закономерно возникающей задачи: чему равна максимально возможная хорошесть строки, 
которую можно собрать, используя дощечки из данного набора? Вы-то и поможете ему с ней справиться.

__Формат ввода__  
Первая строка ввода содержит единственное целое число N — количество различных букв в наборе (1 ≤ _N_ ≤ 26). 
Обратите внимание: в наборе всегда используются _N_ первых букв латинского алфавита.

Следующие _N_ строк содержат целые положительные числа $c_i$ — количество букв соответствующего типа (1 ≤ $c_i$ ≤ $10^9$). 
Таким образом, первое число означает количество букв _a_, второе число задаёт количество букв _b_ и так далее.

__Формат вывода__  
Выведите единственное целое число — максимально возможную хорошесть строки, которую можно собрать из имеющихся дощечек.

```py
# Считываем количество различных букв
N = int(input())

# Считываем количества каждой буквы
counts = [int(input()) for _ in range(N)]

# Инициализируем переменную для хранения результата
goodness = 0

# Проходим по всем парам соседних букв
for i in range(N - 1):
    # Добавляем к хорошести минимальное количество из двух соседних букв
    goodness += min(counts[i], counts[i + 1])

# Выводим результат
print(goodness)
```
