### Минимум на отрезке

Рассмотрим последовательность целых чисел длины _n_.

По ней двигается «окно» длины _k_: сначала в «окне» находятся первые _k_ чисел, на следующем шаге в «окне» уже будут находиться 
_k_ чисел, начиная со второго, и так далее до конца последовательности.
Требуется для каждого положения «окна» определить минимум в нём.

__Формат ввода__  
В первой строке входных данных содержатся два натуральных числа _n_ и _k_ (_n_ ≤ 150000,_k_ ≤ 10000, _k_ ≤ _n_) — длины 
последовательности и «окна», соответственно.
На следующей строке находятся _n_ целых чисел — сама последовательность.

__Формат вывода__  
Выведите _n_ − _k_ + 1 строк. В каждой строке должно быть одно число — минимум для соответствующего положения «окна».

```py
import sys
from collections import deque

def main():
    
    n, k = map(int, input().split())
    nums = list(map(int, input().split()))

    dq = deque()
  
    for i in range(n):
        while dq and nums[dq[-1]] >= nums[i]:
            dq.pop()
        dq.append(i)

        if dq[0] <= i - k:
            dq.popleft()

        if i >= k - 1:
            print(nums[dq[0]])

if __name__ == '__main__':
    main()
```
