### Гистограмма и прямоугольник

Гистограмма является многоугольником, сформированным из последовательности прямоугольников, выровненных на общей базовой линии. 
Прямоугольники имеют равную ширину, но могут иметь различные высоты. Обычно гистограммы используются для представления 
дискретных распределений, например, частоты символов в текстах. Отметьте, что порядок прямоугольников очень важен.
Вычислите область самого большого прямоугольника в гистограмме, который также находится на общей базовой линии. 

__Формат ввода__  
В первой строке входного файла записано число _N_ (0 < _N_ ≤ $10^6$) — количество прямоугольников гистограммы. 
Далее в той же строке записано _N_ целых чисел $h_1$, ..., $h_n$, где 0 ≤ $h_1$ ≤ $10^9$. Эти числа обозначают высоты 
прямоугольников гистограммы слева направо. Ширина каждого прямоугольника равна 1.

__Формат вывода__  
Выведите площадь самого большого прямоугольника в гистограмме. Помните, что этот прямоугольник должен быть на общей базовой линии.

```py
def largest_rectangle_area(heights):
    stack = []
    max_area = 0
    n = len(heights)
    
    for i in range(n):
        while stack and heights[i] < heights[stack[-1]]:
            height = heights[stack.pop()]
            left = stack[-1] if stack else -1
            width = i - left - 1 
            max_area = max(max_area, height * width)
        stack.append(i)
        
    while stack:
        height = heights[stack.pop()]
        left = stack[-1] if stack else -1
        width = n - left - 1 
        max_area = max(max_area, height * width)
        
    return max_area
    
def main():
    input_string = input().strip()
    data = list(map(int, input_string.split()))
    
    N = data[0]
    heights = data[1:N + 1]
    
    result = largest_rectangle_area(heights)
   
    print(result)
    
if __name__ == '__main__':
    main()
```
