### Кондиционер

В офисе, где работает программист Петр, установили кондиционер нового типа. Этот кондиционер отличается особой простотой в управлении. 
У кондиционера есть всего лишь два управляемых параметра: желаемая температура и режим работы.
Кондиционер может работать в следующих четырех режимах:  
_freeze_ — охлаждение. В этом режиме кондиционер может только уменьшать температуру. Если температура в комнате и так не больше желаемой, то он выключается.  
_heat_ — нагрев. В этом режиме кондиционер может только увеличивать температуру. Если температура в комнате и так не меньше желаемой, то он выключается.  
_auto_ — автоматический режим. В этом режиме кондиционер может как увеличивать, так и уменьшать температуру в комнате до желаемой.  
_fan_ — вентиляция. В этом режиме кондиционер осуществляет только вентиляцию воздуха и не изменяет температуру в комнате.  

Кондиционер достаточно мощный, поэтому при настройке на правильный режим работы он за час доводит температуру в комнате до желаемой.
Требуется написать программу, которая по заданной температуре в комнате _troom_, установленным на кондиционере желаемой температуре _tcond_
и режиму работы определяет температуру, которая установится в комнате через час.

__Формат ввода__  
Первая строка входного файла содержит два целых числа troom, и tcond, разделенных ровно одним пробелом (
–50 ≤ _troom_ ≤ 50, –50 ≤ _tcond_ ≤ 50).

Вторая строка содержит одно слово, записанное строчными буквами латинского алфавита — режим работы кондиционера.

__Формат вывода__  
Выходной файл должен содержать одно целое число — температуру, которая установится в комнате через час.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

int main() {
    int a, b;
    string s;
	cin >> a >> b;
	cin >> s;
	if (s == "freeze")
	    cout << min(a, b) << endl;
	else if (s == "heat")
	    cout << max(a, b);
	else if (s == "auto")
	    cout << b;
	else if (s == "fan")
	    cout << a;
	else
	    cout << "error";
	return 0;
}
 ```
Время: 2ms. Память: 792Kb.
