### B. Треугольник
Даны три натуральных числа. Возможно ли построить треугольник с такими сторонами? 
Если это возможно, выведите строку YES, иначе выведите строку NO.
Треугольник — это три точки, не лежащие на одной прямой.

__Формат ввода__  
Вводятся три натуральных числа.

__Формат вывода__  
Выведите ответ на задачу.

```cpp
#include <iostream>

int main(){
    int a, b, c;
    std::cin >> a >> b >> c;
    if ((a + b > c) && (b + c > a) && (a + c > b)) std::cout << "YES";
    else std::cout << "NO";
    return 0;
}
```
