### C. Телефонные номера

Телефонные номера в адресной книге мобильного телефона имеют один из следующих форматов:   
+7<код><номер>,  
8<код><номер>,  
где <номер> — это семь цифр, а <код> — это три цифры или три цифры в круглых скобках. 
Если код не указан, то считается, что он равен 495. Кроме того, в записи телефонного номера может стоять 
знак “-” между любыми двумя цифрами (см. пример). На данный момент в адресной книге телефона Васи записано всего 
три телефонных номера, и он хочет записать туда еще один. Но он не может понять, не записан ли уже такой номер 
в телефонной книге. Помогите ему! Два телефонных номера совпадают, если у них равны коды и равны номера. 
Например, +7(916)0123456 и 89160123456 — это один и тот же номер.

__Формат ввода__  
В первой строке входных данных записан номер телефона, который Вася хочет добавить в 
адресную книгу своего телефона. В следующих трех строках записаны три номера телефонов, 
которые уже находятся в адресной книге телефона Васи. Гарантируется, что каждая из записей соответствует 
одному из трех приведенных в условии форматов.

__Формат вывода__  
Для каждого телефонного номера в адресной книге выведите __YES__ (заглавными буквами), если он совпадает 
с тем телефонным номером, который Вася хочет добавить в адресную книгу или __NO__ (заглавными буквами) в противном случае.

```cpp
#include <iostream>
#include <string>
#include <cctype>

using namespace std;

string normalize(const string& phone) {
    string cleaned;
    
    for (char c : phone) {
        if (isdigit(c)) {
            cleaned += c;
        }
    }
    
    if ((cleaned[0] == '7' || cleaned[0] == '8') && cleaned.length() == 11) {
        cleaned = cleaned.substr(1);
    }
    
    if (cleaned.length() == 7) {
        cleaned = "495" + cleaned;
    }
    
    return cleaned;
    
}

int main() {
	string newNumber, existingNumbers[3];
	
	cin >> newNumber;
	string normalizedNew = normalize(newNumber);
	
	for (int i = 0; i < 3; ++i) {
	    cin >> existingNumbers[i];
	}
	
	for (int i = 0; i < 3; ++i) {
	    string normalizedExisting = normalize(existingNumbers[i]);
	    
	    if (normalizedNew == normalizedExisting) {
	        cout << "YES" << endl;
	    } else {
	        cout << "NO" << endl;
	    }
	}
    return 0;
}
```

Время: 2ms. Память: 668Kb.
