### Уравнение с корнем
Решите в целых числах уравнение:  
$\sqrt{a*x + b}$ = c  
_a_, _b_, _c_ – данные целые числа: найдите все решения или сообщите, что решений в целых числах нет.

__Формат ввода__  
Вводятся три числа _a_, _b_ и _c_ по одному в строке.

__Формат вывода__  
Программа должна вывести все решения уравнения в порядке возрастания, либо __NO SOLUTION__ (заглавными буквами), 
если решений нет. Если решений бесконечно много, вывести __MANY SOLUTIONS__.

```cpp
#include <iostream>
using namespace std;

int main() {
	int a, b, c;
	cin >> a >> b >> c;
	if (c < 0) cout << "NO SOLUTION";
	else if (a == 0) {
	    if (c*c == b) cout << "MANY SOLUTIONS";
	    else cout << "NO SOLUTION";
	}
	else if (b == 0 && c == 0) cout << 0;
	else if (b == 0) cout << (c*c)/b;
	else if (c == 0) cout << (-b/a);
	else if (a != 0 && b != 0 && c != 0){
	    if ((c*c - b) % a == 0) cout << (c*c - b) / a;
	    else cout << "NO SOLUTION";
	}
	else cout << "error";
	
	return 0;
}
```
Время: 2ms. Память: 792Kb.
