### E. Скорая помощь

Бригада скорой помощи выехала по вызову в один из отделенных районов. К сожалению, когда диспетчер получил вызов, 
он успел записать только адрес дома и номер квартиры _K1_, а затем связь прервалась. 
Однако он вспомнил, что по этому же адресу дома некоторое время назад скорая помощь выезжала в квартиру _K2_, которая расположена 
в подъезда _P2_ на этаже _N2_. Известно, что в доме _M_ этажей и количество квартир на каждой лестничной площадке одинаково. 
Напишите программу, которая вычисляет номер подъезда _P1_ и номер этажа _N1_ квартиры _K1_.

__Формат ввода__  
Во входном файле записаны пять положительных целых чисел _K1_, _M_, _K2_, _P2_, _N2_​. Все числа не превосходят
$10^6$.

__Формат вывода__  
Выведите два числа _P1_ и _N1_. Если входные данные не позволяют однозначно определить _P1_ или _N1_, вместо соответствующего 
числа напечатайте 0. Если входные данные противоречивы, напечатайте два числа –1 –1 (минус один).

```cpp
#include <iostream>
#include <set>

using namespace std;

int main() {
    long long K1, M, K2, P2, N2;
    cin >> K1 >> M >> K2 >> P2 >> N2;

    // Проверка: этаж не может быть больше общего числа этажей
    if (N2 > M) {
        cout << "-1 -1" << endl;
        return 0;
    }

    set<long long> possible_A;

    // Определяем возможные значения A (квартир на этаже)
    // Квартира K2 находится в подъезде P2 на этаже N2
    // Значит, она попадает в диапазон:
    // (P2-1)*M*A + (N2-1)*A + 1 <= K2 <= (P2-1)*M*A + N2*A

    for (long long A = 1; A <= 1000000; ++A) {
        long long min_K2 = (P2 - 1) * M * A + (N2 - 1) * A + 1;
        long long max_K2 = (P2 - 1) * M * A + N2 * A;

        if (K2 >= min_K2 && K2 <= max_K2) {
            possible_A.insert(A);
        }
    }

    // Если нет подходящих A — данные противоречивы
    if (possible_A.empty()) {
        cout << "-1 -1" << endl;
        return 0;
    }

    set<long long> possible_P1, possible_N1;

    // Для каждого возможного A вычисляем P1 и N1 для K1
    for (long long A : possible_A) {
        // Общее число квартир в одном подъезде
        long long apartments_per_entrance = M * A;

        // Номер подъезда P1: сколько полных подъездов до K1
        long long P1 = (K1 - 1) / apartments_per_entrance + 1;

        // Остаток квартир после учёта полных подъездов
        long long remaining = (K1 - 1) % apartments_per_entrance + 1;

        // Номер этажа N1: сколько полных этажей в подъезде до remaining
        long long N1 = (remaining - 1) / A + 1;

        // Дополнительная проверка: если квартира выходит за пределы дома при данном A
        if (P1 < 1 || N1 < 1 || N1 > M) {
            continue;  // пропускаем некорректные варианты
        }

        possible_P1.insert(P1);
        possible_N1.insert(N1);
    }

    // Если после фильтрации нет вариантов — противоречивость
    if (possible_P1.empty() || possible_N1.empty()) {
        cout << "-1 -1" << endl;
        return 0;
    }

    long long result_P1 = (possible_P1.size() == 1) ? *possible_P1.begin() : 0;
    long long result_N1 = (possible_N1.size() == 1) ? *possible_N1.begin() : 0;

    cout << result_P1 << " " << result_N1 << endl;

    return 0;
}
```
Время: 439ms. Память: 45,89Mb.
