### Расстановка ноутбуков

В школе решили на один прямоугольный стол поставить два прямоугольных ноутбука. 
Ноутбуки нужно поставить так, чтобы их стороны были параллельны сторонам стола. 
Определите, какие размеры должен иметь стол, чтобы оба ноутбука на него поместились, и площадь стола была минимальна.

__Формат ввода__
Вводится четыре натуральных числа, первые два задают размеры одного ноутбука, а следующие два — размеры второго. 
Числа не превышают 1000.

__Формат вывода__
Выведите два числа — размеры стола. Если возможно несколько ответов, выведите любой из них (но только один).

```cpp
#include <iostream>
#include <algorithm>
#include <climits>
#include <utility>

using namespace std;

int main() {
    int w1, h1, w2, h2;
    cin >> w1 >> h1 >> w2 >> h2;

    int minArea = INT_MAX;
    int bestW = 0, bestH = 0;

    // Массив возможных ориентаций для каждого ноутбука: (ширина, высота)
    pair<int, int> orient1[] = {{w1, h1}, {h1, w1}};
    pair<int, int> orient2[] = {{w2, h2}, {h2, w2}};

    // Перебираем все комбинации ориентаций
    for (auto [w1_curr, h1_curr] : orient1) {
        for (auto [w2_curr, h2_curr] : orient2) {

            // Вариант 1: рядом по ширине
            int width1 = w1_curr + w2_curr;
            int height1 = max(h1_curr, h2_curr);
            int area1 = width1 * height1;

            // Вариант 2: рядом по высоте
            int width2 = max(w1_curr, w2_curr);
            int height2 = h1_curr + h2_curr;
            int area2 = width2 * height2;

            // Обновляем лучший вариант, если нашли меньшую площадь
            if (area1 < minArea) {
                minArea = area1;
                bestW = width1;
                bestH = height1;
            }
            if (area2 < minArea) {
                minArea = area2;
                bestW = width2;
                bestH = height2;
            }
        }
    }

    cout << bestW << " " << bestH << endl;
    return 0;
}
```
Время: 2ms. Память: 796Kb.
