### Детали

Имеется _N_ кг металлического сплава. Из него изготавливают заготовки массой _K_ кг каждая. 
После этого из каждой заготовки вытачиваются детали массой _M_ кг каждая (из каждой заготовки вытачивают 
максимально возможное количество деталей). Если от заготовок после этого что-то остается, 
то этот материал возвращают к началу производственного цикла и сплавляют с тем, что осталось при изготовлении заготовок. 
Если того сплава, который получился, достаточно для изготовления хотя бы одной заготовки, то из него снова изготавливают 
заготовки, из них – детали и т.д. Напишите программу, которая вычислит, какое количество деталей может быть получено 
по этой технологии из имеющихся исходно _N_ кг сплава.

__Формат ввода__
Вводятся _N_, _K_, _M_. Все числа натуральные и не превосходят 200.

__Формат вывода__
Выведите одно число — количество деталей, которое может получиться по такой технологии.

```cpp
#include <iostream>
using namespace std;

int main() {
    int n, k, m;
    cin >> n >> k >> m;

    //проверяем, чтобы заготовка была больше детали
    if (k < m) {
        cout << 0 << endl;
        return 0;
    }

    int total_parts = 0; // всего деталей

    while (n >= k) {
        // сколько можно сделать из n кг сплава
        int num_blanks = n / k;

        // осталось сплава
        int remainder_alloy = n % k;

        // деталей с одной заготовки
        int parts_per_blank = k / m;

        // деталей со всех заготовок 
        int parts_this_cycle = num_blanks * parts_per_blank;
        total_parts += parts_this_cycle;

        // осталось от каждой заготовки
        int remainder_per_blank = k % m;

        // осталось от всех заготовок
        int total_remainder_from_blanks = num_blanks * remainder_per_blank;

        // новый сплав из остатков
        n = remainder_alloy + total_remainder_from_blanks;
    }

    cout << total_parts << endl;
    return 0;
}
```
Время: . Память: .
