### Метро

На некоторых кросс-платформенных станциях метро (как, например, «Третьяковская») на разные стороны платформы 
приходят поезда разных направлений. Таня договорилась встретиться с подругой на такой станции, 
но поскольку подруга приехала из другого часового пояса, то из-за джетлага сильно проспала, и Тане пришлось долго её ждать. 
Поезда всегда ходят точно по расписанию, и Таня знает, что поезд стоит на платформе ровно одну минуту, 
а интервал между поездами (время, в течение которого поезда у платформы нет) составляет _a_ минут для поездов на первом пути и _b_ 
минут для поездов на втором пути. То есть на первый путь приезжает поезд и стоит одну минуту, затем в течение _a_ 
минут поезда у платформы нет, затем в течение одной минуты у платформы стоит следующий поезд и т. д.  
Пока Таня стояла на платформе, она насчитала _n_ поездов на первом пути и _m_ поездов на втором пути. 
Определите минимальное и максимальное время, которое Таня могла провести на платформе, или сообщите, что она точно сбилась со счёта.  
Все поезда, которые видела Таня, она наблюдала в течение всей минуты, то есть Таня не 
приходит и не уходит с платформы посередине той минуты, когда поезд стоит на платформе.

__Формат ввода__  
Первая строка входных данных содержит число _a_ — интервал между поездами на первом пути. Вторая строка содержит число _b_ — 
интервал между поездами на втором пути. Третья строка содержит число _n_ — количество поездов на первом пути, 
которые увидела Таня. Четвёртая строка содержит число _m_ — количество поездов на втором пути, которые увидела Таня. 
Все числа — целые, от 1 до 1000.

__Формат вывода__  
Программа должна вывести два числа: минимальное и максимальное время в минутах, которое Таня могла стоять на платформе, 
или одно число __−1__, если Таня точно ошиблась.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

int main() {
    int a, b, n, m;
    cin >> a >> b >> n >> m;

    // Минимальное и максимальное время для первого пути
    long long min1 = n + (n - 1) * a;
    long long max1 = n + (n + 1) * a;

    // Минимальное и максимальное время для второго пути
    long long min2 = m + (m - 1) * b;
    long long max2 = m + (m + 1) * b;

    // Общее минимальное время — максимальное из минимальных
    long long total_min = max(min1, min2);
    // Общее максимальное время — минимальное из максимальных
    long long total_max = min(max1, max2);

    // Если минимальное время больше максимального — ошибка
    if (total_min > total_max) {
        cout << -1 << endl;
    } else {
        cout << total_min << " " << total_max << endl;
    }
    return 0;
}
```
Время: 2ms. Память: 668Kb.
