### Узник замка Иф
За многие годы заточения узник замка Иф проделал в стене прямоугольное отверстие размером _D_ × _E_. Замок Иф сложен из кирпичей, размером _A_ × _B_ × _C_. Определите, сможет ли узник выбрасывать кирпичи в море через это отверстие, если стороны кирпича должны быть параллельны сторонам отверстия.

__Формат ввода__  
Программа получает на вход числа _A_,_B_,_C_,_D_,_E_.

__Формат вывода__  
Программа должна вывести слово YES или NO.

```cpp
#include <iostream>
#include <algorithm>

using namespace std;

int main() {
	int a, b, c, d, e;
	cin >> a >> b >> c >> d >> e;
	
	if ((max(d, e) <= max({a, b, c})) && (min(d, e) >= min({a, b, c}))) cout << "YES";
	else cout << "NO";
	
	return 0;
}
```
Время: 2ms. Память: 796Kb.
