### Система линейных уравнений-2
Даны числа _a_, _b_, _c_, _d_, _e_, _f_. Решите систему линейных уравнений  
ax + by = e  
cx + dy = f  

__Формат ввода__  
Вводятся 6 вещественных чисел — коэффициенты уравнений.

__Формат вывода__  
Вывод программы зависит от вида решения этой системы.
Если система не имеет решений, то программа должна вывести единственное число 0.
Если система имеет бесконечно много решений, каждое из которых имеет вид 
y = kx + b, то программа должна вывести число __1__, а затем значения __k__ и __b__.
Если система имеет единственное решение ($x_0$, $y_0$), то программа должна вывести число __2__, а затем значения 
__$x_0$__ и __$y_0$__.
Если система имеет бесконечно много решений вида x = $x_0$, y — любое, то программа должна вывести число __3__, а затем значение __$x_0$__.
Если система имеет бесконечно много решений вида y = $y_0$, x — любое, то программа должна вывести число __4__, а затем значение __$y_0$__.
Если любая пара чисел (x, y) является решением, то программа должна вывести число __5__.

Числа $x_0$ и $y_0$ будут проверяться с точностью до пяти знаков после точки.

```cpp
#include <iostream>
#include <iomanip>
#include <cmath>
using namespace std;

const double EPS = 1e-9; // Точность для сравнения вещественных чисел

// Функция для проверки равенства с учётом погрешности
bool equal(double a, double b) {
    return fabs(a - b) < EPS;
}

int main() {
    double a, b, c, d, e, f;
    cin >> a >> b >> c >> d >> e >> f;

    double det = a * d - b * c; // Определитель системы
    double det_x = e * d - b * f;
    double det_y = a * f - e * c;

    // Случай 5: любая пара (x, y) — решение (все коэффициенты и свободные члены нулевые)
    if (equal(a, 0) && equal(b, 0) && equal(c, 0) &&
        equal(d, 0) && equal(e, 0) && equal(f, 0)) {
        cout << 5 << endl;
        return 0;
    }

    // Случай 3: x = x0, y — любое (вертикальная прямая)
    if (equal(b, 0) && equal(d, 0)) {
        if (!equal(a, 0) && !equal(c, 0)) {
            double x1 = e / a;
            double x2 = f / c;
            if (equal(x1, x2)) {
                cout << 3 << " " << fixed << setprecision(5) << x1 << endl;
                return 0;
            } else {
                cout << 0 << endl; // Противоречие
                return 0;
            }
        } else if (!equal(a, 0)) {
            cout << 3 << " " << fixed << setprecision(5) << e / a << endl;
            return 0;
        } else if (!equal(c, 0)) {
            cout << 3 << " " << fixed << setprecision(5) << f / c << endl;
            return 0;
        } else {
            cout << 0 << endl;
            return 0;
        }
    }

    // Случай 4: y = y0, x — любое (горизонтальная прямая)
    if (equal(a, 0) && equal(c, 0)) {
        if (!equal(b, 0) && !equal(d, 0)) {
            double y1 = e / b;
            double y2 = f / d;
            if (equal(y1, y2)) {
                cout << 4 << " " << fixed << setprecision(5) << y1 << endl;
                return 0;
            } else {
                cout << 0 << endl;
                return 0;
            }
        } else if (!equal(b, 0)) {
            cout << 4 << " " << fixed << setprecision(5) << e / b << endl;
            return 0;
        } else if (!equal(d, 0)) {
            cout << 4 << " " << fixed << setprecision(5) << f / d << endl;
            return 0;
        } else {
            cout << 0 << endl;
            return 0;
        }
    }

    // Основное условие: определитель
    if (!equal(det, 0)) {
        // Случай 2: единственное решение
        double x = det_x / det;
        double y = det_y / det;
        cout << 2 << " " << fixed << setprecision(5) << x << " " << y << endl;
    } else {
        // det = 0 — проверяем совместность
        if (equal(det_x, 0) && equal(det_y, 0)) {
            // Случай 1: бесконечно много решений вида y = kx + b
            // Находим k и b из первого уравнения
            if (!equal(b, 0)) {
                double k = -a / b;
                double b_val = e / b;
                cout << 1 << " " << fixed << setprecision(5) << k << " " << b_val << endl;
            } else {
                // b = 0, тогда a ≠ 0 (иначе было бы x = x0)
                double k = -c / d;
                double b_val = f / d;
                cout << 1 << " " << fixed << setprecision(5) << k << " " << b_val << endl;
            }
        } else {
            // Случай 0: нет решений
            cout << 0 << endl;
        }
    }

    return 0;
}
```
Время: 2ms. Память: 664Kb.
