### Определить вид последовательности

По последовательности чисел во входных данных определите ее вид:  
__CONSTANT__ – последовательность состоит из одинаковых значений  
__ASCENDING__ – последовательность является строго возрастающей  
__WEAKLY ASCENDING__ – последовательность является нестрого возрастающей  
__DESCENDING__ – последовательность является строго убывающей  
__WEAKLY DESCENDING__ – последовательность является нестрого убывающей  
__RANDOM__ – последовательность не принадлежит ни к одному из вышеупомянутых типов  

__Формат ввода__  
По одному на строке поступают числа последовательности $a_i$, ∣$a_i$∣ ≤ $10^9$.
Признаком окончания последовательности является число −2 × $10^9$. Оно в последовательность не входит.

__Формат вывода__  
В единственной строке выведите тип последовательности.

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    const long long END_MARKER = -2000000000LL; // -2×10^9
    vector<long long> sequence;
    long long num;

    // Считываем числа до маркера окончания
    while (cin >> num && num != END_MARKER) {
        sequence.push_back(num);
    }

    // Если последовательность пустая или из одного элемента
    if (sequence.size() <= 1) {
        cout << "CONSTANT" << endl;
        return 0;
    }

    bool is_constant = true;
    bool is_ascending = true;      // строго возрастающая
    bool is_weakly_ascending = true; // нестрого возрастающая
    bool is_descending = true;     // строго убывающая
    bool is_weakly_descending = true; // нестрого убывающая

    // Проверяем каждый переход между соседними элементами
    for (size_t i = 1; i < sequence.size(); ++i) {
        long long prev = sequence[i - 1];
        long long curr = sequence[i];

        // Проверяем условия для каждого типа
        if (curr != prev) is_constant = false;
        if (curr <= prev) is_ascending = false;
        if (curr < prev) is_weakly_ascending = false;
        if (curr >= prev) is_descending = false;
        if (curr > prev) is_weakly_descending = false;
    }

    // Определяем тип последовательности в порядке приоритета
    if (is_constant) {
        cout << "CONSTANT" << endl;
    } else if (is_ascending) {
        cout << "ASCENDING" << endl;
    } else if (is_weakly_ascending) {
        cout << "WEAKLY ASCENDING" << endl;
    } else if (is_descending) {
        cout << "DESCENDING" << endl;
    } else if (is_weakly_descending) {
        cout << "WEAKLY DESCENDING" << endl;
    } else {
        cout << "RANDOM" << endl;
    }

    return 0;
}
```
Время: 2ms. Память: 668Kb. 
