### Ближайшее число

Напишите программу, которая находит в массиве элемент, самый близкий по величине к  данному числу.

__Формат ввода__  
В первой строке задается одно натуральное число _N_, не превосходящее 1000 – размер массива. 
Во второй строке содержатся _N_ чисел – элементы массива (целые числа, не превосходящие по модулю 1000). 
В третьей строке вводится одно целое число _x_, не превосходящее по модулю 1000.

__Формат вывода__  
Вывести значение элемента массива, ближайшее к _x_. Если таких чисел несколько, выведите любое из них.

```cpp
#include <iostream>
#include <vector>
#include <cmath>

using namespace std;

int main() {
    int N;
    cin >> N; // Считываем размер массива

    vector<int> arr(N);
    // Считываем элементы массива
    for (int i = 0; i < N; ++i) {
        cin >> arr[i];
    }

    int x;
    cin >> x; // Считываем число, к которому ищем ближайший элемент

    // Инициализируем результат первым элементом массива
    int closest = arr[0];
    // Вычисляем начальную минимальную разницу
    int min_diff = abs(arr[0] - x);

    // Проходим по остальным элементам массива
    for (int i = 1; i < N; ++i) {
        int current_diff = abs(arr[i] - x); // Разница между текущим элементом и x

        // Если нашли элемент с меньшей разницей, обновляем результат
        if (current_diff < min_diff) {
            min_diff = current_diff;
            closest = arr[i];
        }
    }

    // Выводим результат
    cout << closest << endl;

    return 0;
}
```
Время: 2ms. Память: 792Kb. 
