### Ближайшее число

Напишите программу, которая находит в массиве элемент, самый близкий по величине к  данному числу.

__Формат ввода__  
В первой строке задается одно натуральное число _N_, не превосходящее 1000 – размер массива. 
Во второй строке содержатся _N_ чисел – элементы массива (целые числа, не превосходящие по модулю 1000). 
В третьей строке вводится одно целое число _x_, не превосходящее по модулю 1000.

__Формат вывода__  
Вывести значение элемента массива, ближайшее к _x_. Если таких чисел несколько, выведите любое из них.

```py
n = int(input())
a = list(map(int, input().split()))
x = int(input())
closest = a[0]
min_diff = abs(a[0] - x) 

for i in range(n):
    if abs(a[i] - x) < min_diff:
        min_diff = abs(a[i] - x)
        closest = a[i]
        
print(closest)
```
