### Больше своих соседей

Дан список чисел. Определите, сколько в этом списке элементов, 
которые больше двух своих соседей и выведите количество таких элементов.

__Формат ввода__  
Вводится список чисел. Все числа списка находятся на одной строке.

__Формат вывода__  
Выведите ответ на задачу.

```cpp
#include <iostream>
#include <vector>
#include <sstream>
#include <string>

using namespace std;

int main() {
    string line;
    getline(cin, line); // Считываем всю строку с числами

    istringstream iss(line);
    vector<int> numbers;
    int num;

    // Извлекаем числа из строки и сохраняем в вектор
    while (iss >> num) {
        numbers.push_back(num);
    }

    int count = 0;
    int n = numbers.size();

    // Проверяем элементы, у которых есть оба соседа (с индексами от 1 до n-2)
    for (int i = 1; i < n - 1; ++i) {
        if (numbers[i] > numbers[i - 1] && numbers[i] > numbers[i + 1]) {
            ++count;
        }
    }

    // Выводим количество элементов, которые больше обоих своих соседей
    cout << count << endl;

    return 0;
}
```
Время: 2ms. Память: 792Kb.
