### Больше своих соседей

Дан список чисел. Определите, сколько в этом списке элементов, 
которые больше двух своих соседей и выведите количество таких элементов.

__Формат ввода__  
Вводится список чисел. Все числа списка находятся на одной строке.

__Формат вывода__  
Выведите ответ на задачу.

```py
a = list(map(int, input().split()))
n = len(a)
count = 0
for i in range(1, n - 1):
    if a[i] > a[i - 1] and a[i] > a[i + 1]:
        count += 1
        
print(count)
```
