### Чемпионат по метанию коровьих лепёшек

Ежегодный турнир «Веселый коровяк» — по метанию коровьих лепешек на дальность — 
прошел 8–9 июля в селе Крылово Осинского района Пермского края.

Участники соревнований кидают «снаряд» — спрессованный навоз, выбирая его 
из заранее заготовленной кучи. Желающих поупражняться в силе броска традиционно очень много — 
как мужчин, так и женщин. Каждую лепешку, которую метнули участники «Веселого коровяка», 
внимательно осматривали женщины в костюмах коров и тщательно замеряли расстояние.

Соревнования по метанию коровьих лепешек проводятся в Пермском крае с 2009 года.

К сожалению, после чемпионата потерялись записи с фамилиями участников, остались только записи 
о длине броска в том порядке, в котором их совершали участники. Трактиорист Василий помнит три факта:  
1) Число метров, на которое он метнул лепешку, оканчивалось на 5.  
2) Один из победителей чемпионата метал лепешку до Василия.  
3) Участник, метавший лепешку сразу после Василия, метнул ее на меньшее количество метров.  
Будем считать, что участник соревнования занял _k-е_ место, если ровно _(k − 1)_ участников чемпионата метнули
лепешку строго дальше, чем он.

Какое максимально высокое место мог занять Василий?

__Формат ввода__  
Первая строка входного файла содержит целое число n — количество участников чемпионата по метанию лепешек (3 ≤ _n_ ≤ $10^5$).  
Вторая строка входного файла содержит n положительных целых чисел, каждое из которых не превышает 1000, — 
дальность броска участников чемпионата, приведенные в том порядке, в котором происходило метание.

__Формат вывода__  
Выведите самое высокое место, которое мог занять тракторист Василий. Если не существует 
ни одного участника чемпионата, который удовлетворяет, описанным выше условиям, выведите число __0__.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <unordered_map>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int n;
    cin >> n;

    vector<int> throws(n);
    for (int i = 0; i < n; ++i) {
        cin >> throws[i];
    }

    // Находим максимальный результат
    int max_throw = *max_element(throws.begin(), throws.end());

    // Собираем индексы всех победителей (с максимальным броском)
    vector<int> winner_indices;
    for (int i = 0; i < n; ++i) {
        if (throws[i] == max_throw) {
            winner_indices.push_back(i);
        }
    }

    // Создаём массив пар (значение, индекс) и сортируем по убыванию
    vector<pair<int, int>> sorted_throws;
    for (int i = 0; i < n; ++i) {
        sorted_throws.emplace_back(throws[i], i);
    }
    sort(sorted_throws.begin(), sorted_throws.end(),
          [](const pair<int, int>& a, const pair<int, int>& b) {
              return a.first > b.first;
          });

    // Предвычисляем место для каждого уникального результата
    unordered_map<int, int> place_cache;
    int current_rank = 1;
    for (int i = 0; i < n; ++i) {
        int value = sorted_throws[i].first;
        if (place_cache.find(value) == place_cache.end()) {
            place_cache[value] = current_rank;
        }
        // Следующий ранг — текущий индекс + 1 (т. к. индексы с 0)
        current_rank = i + 2;
    }

    int best_place = n + 1; // Инициализируем заведомо большим числом
    bool found = false;

    // Перебираем кандидатов на роль Василия: i от 0 до n-2
    for (int i = 1; i < n - 1; ++i) {
        int current = throws[i];
        int next = throws[i + 1];

        // Проверяем условия для Василия
        if (current % 10 == 5 && next < current) {
            // Проверяем, был ли до Василия хотя бы один победитель
            bool has_winner_before = !winner_indices.empty() &&
                                   winner_indices[0] < i;

            if (has_winner_before) {
                // Берём место из кэша
                int place = place_cache[current];
                if (place < best_place) {
                    best_place = place;
                }
                found = true;
            }
        }
    }

    if (found) {
        cout << best_place << endl;
    } else {
        cout << 0 << endl;
    }

    return 0;
}
```
Время: 17ms. Память: 1.5Mb. 
