### Симметричная последовательность

Последовательность чисел назовем симметричной, если она одинаково читается как слева направо, 
так и справа налево. Например, следующие последовательности являются симметричными:  
1 2 3 4 5 4 3 2 1  
1 2 1 2 2 1 2 1  
Вашей программе будет дана последовательность чисел. Требуется определить, 
какое минимальное количество и каких чисел надо приписать в конец этой последовательности, чтобы она стала симметричной.

__Формат ввода__  
Сначала вводится число _N_ — количество элементов исходной последовательности (1 ≤ _N_ ≤ 100). Далее идут _N_ чисел — 
элементы этой последовательности, натуральные числа от 1 до 9.

__Формат вывода__  
Выведите сначала число _M_ — минимальное количество элементов, которое надо дописать к последовательности, а потом 
_M_ чисел (каждое — от 1 до 9) — числа, которые надо дописать к последовательности. 

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    int N;
    cin >> N;

    vector<int> seq(N);
    for (int i = 0; i < N; ++i) {
        cin >> seq[i];
    }

    int start_index = 0; // Индекс начала самого длинного симметричного суффикса

    // Ищем самый длинный симметричный суффикс
    for (int i = 0; i < N; ++i) {
        bool is_palindrome = true;
        int length = N - i; // Длина текущей подпоследовательности

        // Проверяем, является ли подпоследовательность seq[i..N-1] палиндромом
        for (int j = 0; j < length / 2; ++j) {
            if (seq[i + j] != seq[N - 1 - j]) {
                is_palindrome = false;
                break;
            }
        }

        if (is_palindrome) {
            start_index = i;
            break; // Нашли самый длинный — выходим
        }
    }

    // Количество чисел для добавления
    int M = start_index;
    cout << M << endl;

    // Выводим числа для добавления (элементы seq[0..start_index-1] в обратном порядке)
    if (M > 0) {
        for (int i = start_index - 1; i >= 0; --i) {
            cout << seq[i];
            if (i > 0) {
                cout << " ";
            }
        }
        cout << endl;
    }

    return 0;
}
```
Время: 2ms. Память: 832Kb. 
