### Сапёр

Вам необходимо построить поле для игры «Сапёр» по его конфигурации – 
размерам и координатам расставленных на нем мин.
Вкратце напомним правила построения поля для игры «Сапёр»:  
Поле состоит из клеток с минами и пустых клеток  
Клетки с миной обозначаются символом *  
Пустые клетки содержат число $k_i,_j$, 0 ≤ $k_i,_j$ ≤ 8 – количество мин на соседних клетках. 
Соседними клетками являются восемь клеток, имеющих смежный угол или сторону.

__Формат ввода__  
В первой строке содержатся три числа: _N_, 1 ≤ _N_ ≤ 100 - количество строк на поле, _M_, 
1 ≤ _M_ ≤ 100 - количество столбцов на поле, _K_, 0 ≤ _K_ ≤ _N_⋅_M_ - количество мин на поле.
В следующих _K_ строках содержатся по два числа с координатами мин: _p_, 1 ≤ _p_≤ _N_ - номер строки мины, _q_, 1 ≤ _q_ ≤ _M_ - 
номер столбца мины.

__Формат вывода__  
Выведите построенное поле, разделяя строки поля переводом строки, а столбцы - пробелом.

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    int N, M, K;
    cin >> N >> M >> K;

    // Создаём поле с рамкой (добавляем по 2 строки/столбца)
    vector<vector<char>> field(N + 2, vector<char>(M + 2, '0'));

    // Считываем координаты мин и отмечаем их на поле
    for (int i = 0; i < K; ++i) {
        int p, q;
        cin >> p >> q;

        // Помечаем мину
        field[p][q] = '*';

        // Увеличиваем счётчики для всех соседних клеток
        for (int di = -1; di <= 1; ++di) {
            for (int dj = -1; dj <= 1; ++dj) {
                // Пропускаем саму мину
                if (di == 0 && dj == 0) continue;

                int ni = p + di;
                int nj = q + dj;

                // Проверяем, что соседняя клетка в пределах основного поля
                if (ni >= 1 && ni <= N && nj >= 1 && nj <= M) {
                    // Если соседняя клетка не мина, увеличиваем счётчик
                    if (field[ni][nj] != '*') {
                        field[ni][nj]++;
            }
        }
      }
    }
  }

    // Выводим поле (пропускаем рамку)
    for (int i = 1; i <= N; ++i) {
        for (int j = 1; j <= M; ++j) {
            cout << field[i][j];
            if (j < M) cout << " "; // Пробел между столбцами
        }
        cout << endl; // Перевод строки после каждой строки поля
    }

    return 0;
}
```
Время: 2ms. Память: 792Kb. 
