### Треугольник Максима

С детства Максим был неплохим музыкантом и мастером на все руки. 
Недавно он самостоятельно сделал несложный перкуссионный музыкальный инструмент — треугольник. 
Ему нужно узнать, какова частота звука, издаваемого его инструментом.

У Максима есть профессиональный музыкальный тюнер, 
с помощью которого можно проигрывать ноту с заданной частотой. 
Максим действует следующим образом: он включает на тюнере ноты с разными частотами и для каждой ноты на слух определяет, 
ближе или дальше она к издаваемому треугольником звуку, чем предыдущая нота. 
Поскольку слух у Максима абсолютный, он определяет это всегда абсолютно верно.

Вам Максим показал запись, в которой приведена последовательность частот, 
выставляемых им на тюнере, и про каждую ноту, начиная со второй, записано — 
ближе или дальше она к звуку треугольника, чем предыдущая нота. Заранее известно, 
что частота звучания треугольника Максима составляет не менее 30 герц и не более 4000 герц.

Требуется написать программу, которая определяет, в каком интервале может находиться частота звучания треугольника.

__Формат ввода__
Первая строка входного файла содержит целое число _n_ — количество нот, которые воспроизводил Максим с помощью тюнера (2 ≤ _n_ ≤ 1000). 
Последующие _n_ строк содержат записи Максима, причём каждая строка содержит две компоненты: вещественное число $f_i$ — частоту, 
выставленную на тюнере, в герцах ( 30 ≤ $f_i$ ≤ 4000), и слово «closer» или слово «further» для каждой частоты, кроме первой.

Слово «closer» означает, что частота данной ноты ближе к частоте звучания треугольника, чем частота предыдущей ноты, 
что формально описывается соотношением: |$f_i$ - $f_t_r_i_a_n_g_l_e$| < |$f_i-1$ - $f_t_r_i_a_n_g_l_e$|.

Слово «further» означает, что частота данной ноты дальше, чем предыдущая.

Если оказалось, что очередная нота так же близка к звуку треугольника, 
как и предыдущая нота, то Максим мог записать любое из двух указанных выше слов.
Гарантируется, что результаты, полученные Максимом, непротиворечивы.

__Формат вывода__  
В выходной файл необходимо вывести через пробел два вещественных числа — наименьшее и наибольшее возможное 
значение частоты звучания треугольника, изготовленного Максимом. Числа должны быть выведены с точностью не хуже $10^−6$.

```cpp
#include <iostream>
#include <iomanip>
#include <string>

using namespace std;

int main() {
    int n;
    cin >> n;

    double low = 30.0;
    double high = 4000.0;

    double prev_freq;
    cin >> prev_freq; // Первая частота без условия

    for (int i = 1; i < n; ++i) {
        double curr_freq;
        string condition;
        cin >> curr_freq >> condition;

        double mid = (prev_freq + curr_freq) / 2.0;

        if (condition == "closer") {
            if (curr_freq > prev_freq) {
                low = max(low, mid);
            } else if (curr_freq < prev_freq) {
                high = min(high, mid);
            }
            // Если частоты равны, интервал не меняется
        } else if (condition == "further") {
            if (curr_freq > prev_freq) {
                high = min(high, mid);
            } else if (curr_freq < prev_freq) {
                low = max(low, mid);
            }
        }

        prev_freq = curr_freq;
    }

    // Выводим с точностью не хуже 1e-6
    cout << fixed << setprecision(6) << low << " " << high << endl;

    return 0;
}
```
Время: 3ms. Память: 792Kb.
