### Количество различных чисел

Дан список чисел, который может содержать до 100000 чисел. Определите, сколько в нем встречается различных чисел.

__Формат ввода__  
Вводится список целых чисел. Все числа списка находятся на одной строке.

__Формат вывода__  
Выведите ответ на задачу.

```cpp
#include <iostream>
#include <set>
#include <sstream>
#include <string>

int main() {
    std::string line;
    // Считываем всю строку ввода
    std::getline(std::cin, line);

    std::istringstream iss(line);
    std::set<int> unique_numbers;
    int number;

    // Читаем числа из строки одно за другим
    while (iss >> number) {
        unique_numbers.insert(number);
    }

    // Выводим количество уникальных чисел
    std::cout << unique_numbers.size() << std::endl;

    return 0;
}
```
Время: 47ms. Память: 3.89Mb. 

Быстрее с bitset:
```cpp
#include <iostream>
#include <sstream>
#include <string>
#include <bitset>

int main() {
    std::string line;
    std::getline(std::cin, line);
    std::istringstream iss(line);

    // Предполагаем диапазон 0–1 000 000
    std::bitset<1000001> seen;
    int number, count = 0;

    while (iss >> number) {
        if (!seen[number]) {
            seen[number] = true;
            count++;
        }
    }

    std::cout << count << std::endl;
    return 0;
}
```
Время: 22ms. Память: 1.44Mb. 
