### Количество различных чисел

Дан список чисел, который может содержать до 100000 чисел. Определите, сколько в нем встречается различных чисел.

__Формат ввода__  
Вводится список целых чисел. Все числа списка находятся на одной строке.

__Формат вывода__  
Выведите ответ на задачу.

```cpp
#include <iostream>
#include <set>
#include <sstream>
#include <string>

int main() {
    std::string line;
    // Считываем всю строку ввода
    std::getline(std::cin, line);

    std::istringstream iss(line);
    std::set<int> unique_numbers;
    int number;

    // Читаем числа из строки одно за другим
    while (iss >> number) {
        unique_numbers.insert(number);
    }

    // Выводим количество уникальных чисел
    std::cout << unique_numbers.size() << std::endl;

    return 0;
}
```
Время: 47ms. Память: 3.89Mb. 
