### Пересечение множеств

Даны два списка чисел, которые могут содержать до 10000 чисел каждый. 
Выведите все числа, которые входят как в первый, так и во второй список в порядке возрастания.

__Формат ввода__  
Вводятся два списка целых чисел. Все числа каждого списка находятся на отдельной строке.

__Формат вывода__  
Выведите ответ на задачу.

```cpp
#include <iostream>
#include <set>
#include <vector>
#include <sstream>
#include <string>
#include <algorithm>

int main() {
    std::string line1, line2;
    
    // Считываем два списка
    std::getline(std::cin, line1);
    std::getline(std::cin, line2);
    
    std::istringstream iss1(line1), iss2(line2);
    std::set<int> set1, set2;
    int number;
    
    // Заполняем множества (автоматически удаляем дубликаты)
    while (iss1 >> number) {
        set1.insert(number);
    }
    while (iss2 >> number) {
        set2.insert(number);
    }
    
    // Вектор для хранения результата
    std::vector<int> intersection;
    
    // Находим пересечение множеств
    std::set_intersection(set1.begin(), set1.end(),
                        set2.begin(), set2.end(),
                        std::back_inserter(intersection));
    
    // Выводим результат в порядке возрастания (уже отсортирован)
    for (size_t i = 0; i < intersection.size(); ++i) {
        if (i > 0) std::cout << " ";
        std::cout << intersection[i];
    }
    std::cout << std::endl;
    
    return 0;
}
```
Время: 72ms. Память: 7.75Mb.
