### Кубики

Аня и Боря любят играть в разноцветные кубики, причем у каждого из них свой набор и в каждом наборе 
все кубики различны по цвету. Однажды дети заинтересовались, сколько существуют цветов таких, что 
кубики каждого цвета присутствуют в обоих наборах. Для этого они занумеровали все цвета случайными 
числами. На этом их энтузиазм иссяк, поэтому вам предлагается помочь им в оставшейся части. Номер любого цвета — 
это целое число в пределах от 0 до $10^9$.

__Формат ввода__  
В первой строке входного файла записаны числа _N_ и _M_ — количество кубиков у Ани и Бори соответственно. 
В следующих _N_ строках заданы номера цветов кубиков Ани. В последних _M_ строках номера цветов кубиков Бори.

__Формат вывода__
Выведите сначала количество, а затем отсортированные по возрастанию номера цветов таких, 
что кубики каждого цвета есть в обоих наборах, затем количество и отсортированные по возрастанию номера 
остальных цветов у Ани, потом количество и отсортированные по возрастанию номера остальных цветов у Бори.
```cpp
#include <iostream>
#include <set>
#include <vector>
#include <algorithm>

int main() {
    int N, M;
    std::cin >> N >> M;

    std::set<int> anna_colors, boris_colors;

    // Считываем цвета кубиков Ани
    for (int i = 0; i < N; ++i) {
        int color;
        std::cin >> color;
        anna_colors.insert(color);
    }

    // Считываем цвета кубиков Бори
    for (int i = 0; i < M; ++i) {
        int color;
        std::cin >> color;
        boris_colors.insert(color);
    }

    std::vector<int> common, only_anna, only_boris;

    // Находим общие цвета (пересечение множеств)
    std::set_intersection(anna_colors.begin(), anna_colors.end(),
                        boris_colors.begin(), boris_colors.end(),
                        std::back_inserter(common));

    // Находим цвета, которые есть только у Ани
    std::set_difference(anna_colors.begin(), anna_colors.end(),
                       boris_colors.begin(), boris_colors.end(),
               std::back_inserter(only_anna));

    // Находим цвета, которые есть только у Бори
    std::set_difference(boris_colors.begin(), boris_colors.end(),
                       anna_colors.begin(), anna_colors.end(),
               std::back_inserter(only_boris));

    // Выводим результаты
    // 1. Общие цвета
    std::cout << common.size() << std::endl;
    for (size_t i = 0; i < common.size(); ++i) {
        if (i > 0) std::cout << " ";
        std::cout << common[i];
    }
    std::cout << std::endl;

    // 2. Цвета только у Ани
    std::cout << only_anna.size() << std::endl;
    for (size_t i = 0; i < only_anna.size(); ++i) {
        if (i > 0) std::cout << " ";
        std::cout << only_anna[i];
    }
    std::cout << std::endl;

    // 3. Цвета только у Бори
    std::cout << only_boris.size() << std::endl;
    for (size_t i = 0; i < only_boris.size(); ++i) {
        if (i > 0) std::cout << " ";
        std::cout << only_boris[i];
    }
    std::cout << std::endl;

    return 0;
}
```
Время: 182ms. Память: 9.89Mb.
