### Количество слов в тексте

Во входном файле (вы можете читать данные из sys.stdin, подключив библиотеку _sys_) 
записан текст. Словом считается последовательность непробельных символов идущих подряд, 
слова разделены одним или большим числом пробелов или символами конца строки. Определите, сколько различных слов 
содержится в этом тексте.

```cpp
#include <iostream>
#include <set>
#include <string>
#include <sstream>

int main() {
    std::set<std::string> unique_words;
    std::string line;

    // Читаем строки до конца ввода (Ctrl+D или конец файла)
    while (std::getline(std::cin, line)) {
        std::istringstream iss(line);
        std::string word;

        // Разбиваем строку на слова
        while (iss >> word) {
            unique_words.insert(word);
        }
    }

    // Выводим количество уникальных слов
    std::cout << unique_words.size() << std::endl;

    return 0;
}
```
Время: 74ms. Память: 6.47Mb.
