### Инопланетный геном

Геном жителей системы Тау Кита содержит 26 видов оснований, для обозначения которых будем использовать 
буквы латинского алфавита от _A_ до _Z_, а сам геном записывается строкой из латинских букв. 
Важную роль в геноме играют пары соседних оснований, например, в геноме «ABBACAB» можно выделить следующие пары оснований: 
AB, BB, BA, AC, CA, AB.

Степенью близости одного генома другому геному называется количество 
пар соседних оснований первого генома, которые встречаются во втором геноме.

__Формат ввода__  
Вам даны два генома, определите степень близости первого генома второму геному. 
Программа получает на вход две строки, состоящие из заглавных латинских букв. Каждая строка непустая, и её длина не превосходит $10^5$.

__Формат вывода__ 
Программа должна вывести одно целое число – степень близости генома, 
записанного в первой строке, геному, записанному во второй строке.


```cpp
#include <iostream>
#include <string>
#include <unordered_set>

int main() {
    std::string genome1, genome2;
    std::cin >> genome1 >> genome2;

    // Множество пар из второго генома
    std::unordered_set<std::string> pairs_in_genome2;

    // Извлекаем все пары из второго генома и добавляем в множество
    for (size_t i = 0; i + 1 < genome2.length(); ++i) {
        std::string pair = genome2.substr(i, 2);
        pairs_in_genome2.insert(pair);
    }

    int proximity = 0;

    // Проверяем каждую пару из первого генома
    for (size_t i = 0; i + 1 < genome1.length(); ++i) {
        std::string current_pair = genome1.substr(i, 2);
        // Если пара встречается во втором геноме, увеличиваем счётчик
        if (pairs_in_genome2.find(current_pair) != pairs_in_genome2.end()) {
            proximity++;
        }
    }

    std::cout << proximity << std::endl;

    return 0;
}
```
Время: 12ms. Память: 792Kb. 
