### Черепахи

Широко известна следующая задача для младших школьников. Три черепахи ползут по дороге. Одна черепаха говорит: 
«Впереди меня две черепахи». Другая черепаха говорит: «Позади меня две черепахи». Третья черепаха говорит: 
«Впереди меня две черепахи и позади меня две черепахи». Как такое может быть? Ответ: третья черепаха врет! 
По дороге одна за другой движутся _N_ черепах. Каждая черепаха говорит фразу вида: «Впереди меня $a_i$ черепах, а позади меня $b_i$ 
черепах». Ваша задача определить, сколько самое большее количество черепах могут говорить правду.

__Формат ввода__
В первой строке вводится целое число _N_ (1 ≤ _N_ ≤ 10000) строк, содержащих целые числа $a_i$ и $b_i$, 
по модулю не превосходящие 10000, описывающие высказывание _i_-ой черепахи.

__Формат вывода__
Выведите целое число _M_ – максимальное количество черепах, которые могут говорить правду.

```cpp
#include <iostream>
#include <set>

using namespace std;

int main() {
    int N;
    cin >> N;

    set<int> validPositions; // Множество для хранения уникальных позиций правдивых черепах

    for (int i = 0; i < N; ++i) {
        int a, b;
        cin >> a >> b;

        // Проверяем базовые условия
        if (a < 0 || b < 0) {
            continue; // Отрицательные значения недопустимы
        }

        if (a + b != N - 1) {
            continue; // Сумма должна быть N-1
        }

        int position = a + 1; // Позиция черепахи (1-индексация)

        // Проверяем, что позиция в допустимом диапазоне
        if (position < 1 || position > N) {
            continue;
        }

        // Добавляем позицию в множество, если она ещё не занята
        validPositions.insert(position);
    }

    // Количество уникальных позиций — это максимальное число говорящих правду черепах
    cout << validPositions.size() << endl;

    return 0;
}
```
Время: 8ms. Память: 980Kb.
