### Злые свинки

Вы никогда не задумывались, почему в _Angry Birds_ у птиц нет крыльев? Тем же вопросом задались разработчики новой игры. 
В их версии смысл игры прямо противоположен _Angry Birds_: зеленая свинка стреляет по злым птицам из лазерного ружья 
(завязка явно не хуже исходной игры).

Птицы в игре представляются точками на плоскости. 
Выстрел сбивает только ближайшую птицу находящуюся на линии огня. При этом сбитая птица падая сбивает всех птиц, 
находящихся ровно под ней. Две птицы не могут находиться в одной точке. По заданному расположению 
птиц необходимо определить, какое минимальное количество выстрелов необходимо, чтобы все птицы были сбиты.

__Формат ввода__  
Первая строка входного файла содержит единственное целое число _N_ (1 ≤ _N_ ≤ 1000) — количество птиц.
Следующие _N_ строк содержат по два натуральных числа каждая $x_i$, $y_i$ — координаты _i_-ой птицы (0 < _x_, _y_ ≤ $10^9$). 
Свинка находится в точке с координатами (0, 0).

__Формат вывода__  
Единственная строка выходного файла должна содержать одно целое число — минимальное количество выстрелов, 
необходимое для того, чтобы сбить всех птиц.

```cpp
#include <iostream>
#include <set>

using namespace std;

int main() {
    int N;
    cin >> N;

    set<long long> uniqueX; // Множество для хранения уникальных координат X

    for (int i = 0; i < N; ++i) {
        long long x, y;
        cin >> x >> y;
        uniqueX.insert(x); // Добавляем координату X в множество
    }

    // Количество уникальных X — это минимальное число выстрелов
    cout << uniqueX.size() << endl;

    return 0;
}
```
Время: 3ms. Память: 796Kb. 
