### Полиглоты

Каждый из _N_ школьников некоторой школы знает $M_i$ языков. Определите, какие языки знают все школьники и языки, 
которые знает хотя бы один из школьников.

__Формат ввода__  
Первая строка входных данных содержит количество школьников _N_. Далее идет _N_ чисел $M_i$, после каждого из чисел идет $M_i$ строк, 
содержащих названия языков, которые знает _i_-й школьник. Длина названий языков не превышает 1000 символов, 
количество различных языков не более 1000. 1 ≤ _N_ ≤1000, 1 ≤ $M_i$ ≤ 500.

__Формат вывода__  
В первой строке выведите количество языков, которые знают все школьники. Начиная со второй строки - 
список таких языков. Затем - количество языков, которые знает хотя бы один школьник, на следующих строках - список таких языков.

```cpp
#include <iostream>
#include <set>
#include <string>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    int n;
    cin >> n;

    // Множество языков, которые знает хотя бы один школьник (объединение)
    set<string> any_languages;
    // Множество языков, которые знают все школьники (пересечение)
    set<string> all_languages;

    for (int i = 0; i < n; ++i) {
        int m;
        cin >> m;

        // Множество языков текущего школьника
        set<string> student_languages;
        for (int j = 0; j < m; ++j) {
            string language;
            cin >> language;
            student_languages.insert(language);
        }

        // Обновляем объединение — добавляем все языки текущего школьника
        for (const string& lang : student_languages) {
            any_languages.insert(lang);
        }

        // Обновляем пересечение
        if (i == 0) {
            // Для первого школьника — просто копируем его языки
            all_languages = student_languages;
        } else {
            // Для остальных школьников — находим пересечение с текущим множеством all_languages
            set<string> temp_intersection;
            for (const string& lang : student_languages) {
                if (all_languages.find(lang) != all_languages.end()) {
                    temp_intersection.insert(lang);
                }
            }
            all_languages = temp_intersection;
        }
    }

    // Преобразуем множества в векторы для сортировки
    vector<string> sorted_all(all_languages.begin(), all_languages.end());
    vector<string> sorted_any(any_languages.begin(), any_languages.end());

    sort(sorted_all.begin(), sorted_all.end());
    sort(sorted_any.begin(), sorted_any.end());

    // Вывод результата
    cout << sorted_all.size() << endl;
    for (const string& lang : sorted_all) {
        cout << lang << endl;
    }

    cout << sorted_any.size() << endl;
    for (const string& lang : sorted_any) {
        cout << lang << endl;
    }

    return 0;
}
```
Время: 137ms. Память: 792Kb. 
