### Пробежки по Манхэттену

Дороги Нью-Манхэттена устроены следующим образом. С юга на север через каждые сто метров проходит авеню, 
с запада на восток через каждые сто метров проходит улица. Авеню и улицы нумеруются целыми числами. 
Меньшие номера соответствуют западным авеню и южным улицам. Таким образом, можно построить прямоугольную систему 
координат так, чтобы точка (_x_, _y_) лежала на пересечении _x_-ой авеню и _y_-ой улицы. Легко заметить, что для того, 
чтобы в Нью-Манхэттене дойти от точки ($x_1$, $y_1$) до точки ($x_2$, $y_2$) нужно пройти ($x_2$ - $x_1$) + ($y_2$ - $y_1$) кварталов. 
Эта величина называется манхэттенским расстоянием между точками ($x_1$, $y_1$) и ($x_2$, $y_2$).

Миша живет в Нью-Манхэттене и каждое утро делает пробежку по городу. 
Он выбегает из своего дома, который находится в точке (0, 0) и бежит по случайному маршруту. 
Каждую минуту Миша либо остается на том же перекрестке, что и минуту назад, или перемещается на один квартал в любом направлении. 
Чтобы не заблудиться Миша берет с собой навигатор, который каждые _t_ минут говорит Мише, в какой точке он находится. 
К сожалению, навигатор показывает не точное положение Миши, он может показать любую из точек, манхэттенское расстояние 
от которых до Миши не превышает _d_.

Через _t_ × _n_ минут от начала пробежки, получив _n_-е сообщение от навигатора, Миша решил, что пора бежать домой. 
Для этого он хочет понять, в каких точках он может находиться. Помогите Мише сделать это.

__Формат ввода__  
Первая строка входного файла содержит числа _t_, _d_ и _n_ (1 ≤ _t_ ≤ 100, 1 ≤ _d_ ≤ 100, 1 ≤ _n_ ≤ 100).

Далее _n_ строк описывают данные, полученные от навигатора. Строка номер _i_ содержит числа $x_1$ и $y_1$ — данные, 
полученные от навигатора через $t_i$ минут от начала пробежки.

__Формат вывода__  
В первой строке выходного файла выведите число _m_ — число точек, в которых может находиться Миша. 
Далее выведите _m_ пар чисел — координаты точек. Точки можно вывести в произвольном порядке.

Гарантируется, что навигатор исправен и что существует по крайней мере одна точка, в которой может находиться Миша.

```cpp
#include <iostream>
#include <unordered_set>
#include <vector>
#include <cmath>
#include <tuple>

using namespace std;

// Хэш-функция для пары int
struct PairHash {
    size_t operator()(const pair<int, int>& p) const {
        return hash<int>()(p.first) ^ (hash<int>()(p.second) << 1);
    }
};

// Функция для вычисления манхэттенского расстояния
int manhattan_distance(int x1, int y1, int x2, int y2) {
    return abs(x2 - x1) + abs(y2 - y1);
}

int main() {
    int t, d, n;
    cin >> t >> d >> n;

    // Множество возможных позиций Миши
    unordered_set<pair<int, int>, PairHash> possible_positions;
    possible_positions.insert({0, 0});

    for (int i = 0; i < n; ++i) {
        int nav_x, nav_y;
        cin >> nav_x >> nav_y;

        // Временное множество для новых позиций после расширения
        unordered_set<pair<int, int>, PairHash> new_positions;

        // Расширяем возможные позиции: за t минут можно переместиться на t кварталов
        for (const auto& pos : possible_positions) {
            int curr_x = pos.first;
            int curr_y = pos.second;

            // Перебираем все точки в радиусе t от текущей позиции
            for (int dx = -t; dx <= t; ++dx) {
                int max_dy = t - abs(dx);
                for (int dy = -max_dy; dy <= max_dy; ++dy) {
                    int new_x = curr_x + dx;
            int new_y = curr_y + dy;
            new_positions.insert({new_x, new_y});
                }
            }
        }

        // Фильтруем позиции по данным навигатора
        unordered_set<pair<int, int>, PairHash> filtered_positions;
        for (const auto& pos : new_positions) {
            if (manhattan_distance(pos.first, pos.second, nav_x, nav_y) <= d) {
                filtered_positions.insert(pos);
            }
        }

        // Обновляем множество возможных позиций
        possible_positions = filtered_positions;
    }

    // Вывод результата
    cout << possible_positions.size() << endl;
    for (const auto& pos : possible_positions) {
        cout << pos.first << " " << pos.second << endl;
    }

    return 0;
}
```
Время: пока Time Limit . Память: 796Kb. 
