### OpenCalculator

В новой программе OpenCalculator появилась новая возможность – можно настроить, какие кнопки отображаются, 
а какие – нет. Если кнопка не отображается на экране, то ввести соответствующую цифру с клавиатуры или 
копированием из другой программы нельзя. Петя настроил калькулятор так, что он отображает только кнопки с цифрами _x_, _y_, _z_. 
Напишите программу, определяющую, сможет ли Петя ввести число _N_, а если нет, то какое 
минимальное количество кнопок надо дополнительно отобразить на экране для его ввода.

__Формат ввода__  
Сначала вводятся три различных числа из диапазона от 0 до 9: _x_, _y_ и _z_ (числа разделяются пробелами). 
Далее вводится целое неотрицательное число _N_, которое Петя хочет ввести в калькулятор. Число _N_ не превышает 10000.

__Формат вывода__  
Выведите, какое минимальное количество кнопок должно быть добавлено для того, чтобы можно было ввести число _N_ 
(если число может быть введено с помощью уже имеющихся кнопок, выведите 0).
```cpp
#include <iostream>
#include <set>

int main() {
    int x, y, z;
    std::cin >> x >> y >> z;

    int N;
    std::cin >> N;

    // Множество доступных кнопок
    std::set<int> available = {x, y, z};
    // Множество цифр, которые нужно добавить
    std::set<int> missing_digits;

    // Если N равно 0, проверяем отдельно
    if (N == 0) {
        if (available.find(0) == available.end()) {
            missing_digits.insert(0);
        }
    } else {
        // Извлекаем цифры числа N по одной
        int temp = N;
        while (temp > 0) {
            int digit = temp % 10;  // Получаем последнюю цифру
            // Если цифры нет среди доступных, добавляем в множество отсутствующих
            if (available.find(digit) == available.end()) {
                missing_digits.insert(digit);
            }
            temp /= 10;  // Убираем последнюю цифру
        }
    }

    // Выводим количество недостающих кнопок
    std::cout << missing_digits.size() << std::endl;

    return 0;
}
```
Время: 2ms. Память: 668Kb. 
