### Словарь синонимов

Вам дан словарь, состоящий из пар слов. Каждое слово является синонимом к парному ему слову. 
Все слова в словаре различны. Для одного данного слова определите его синоним.

__Формат ввода__  
Программа получает на вход количество пар синонимов _N_. Далее следует _N_ строк, 
каждая строка содержит ровно два слова-синонима. После этого следует одно слово.

__Формат вывода__  
Программа должна вывести синоним к данному слову.

```cpp
#include <iostream>
#include <map>
#include <string>

int main() {
    int N;
    std::cin >> N; // Читаем количество пар синонимов

    std::map<std::string, std::string> synonyms;

    // Заполняем словарь парами синонимов
    for (int i = 0; i < N; ++i) {
        std::string word1, word2;
        std::cin >> word1 >> word2;

        // Добавляем обе пары: word1 -> word2 и word2 -> word1
        synonyms[word1] = word2;
        synonyms[word2] = word1;
    }

    std::string targetWord;
    std::cin >> targetWord; // Читаем слово, для которого нужно найти синоним

    // Находим и выводим синоним
    std::cout << synonyms[targetWord] << std::endl;

    return 0;
}
```
Время: 229ms. Память: 21.53Mb. 
