### Словарь синонимов

Вам дан словарь, состоящий из пар слов. Каждое слово является синонимом к парному ему слову. 
Все слова в словаре различны. Для одного данного слова определите его синоним.

__Формат ввода__  
Программа получает на вход количество пар синонимов _N_. Далее следует _N_ строк, 
каждая строка содержит ровно два слова-синонима. После этого следует одно слово.

__Формат вывода__  
Программа должна вывести синоним к данному слову.

```py
N = int(input())
my_dict = {} #создаём словарь

for _ in range(N):
    word1, word2 = input().split() #считываем построчно
    my_dict[word1] = word2
    my_dict[word2] = word1         #записываем в обратном порядке тоже, чтобы искать только по ключу (будет поиск за O(1)

word = input()

print(my_dict[word]) #тадам!
```
