### Клавиатура

Всем известно, что со временем клавиатура изнашивается, и клавиши на ней начинают залипать. 
Конечно, некоторое время такую клавиатуру еще можно использовать, но для нажатий клавиш приходиться использовать большую силу.
При изготовлении клавиатуры изначально для каждой клавиши задается количество нажатий,которое она должна выдерживать. 
Если знать эти величины для используемой клавиатуры,то для определенной последовательности нажатых клавиш можно определить, 
какие клавиши в процессе их использования сломаются, а какие — нет.

Требуется написать программу, определяющую, какие клавиши сломаются в процессе заданного варианта эксплуатации клавиатуры.

__Формат ввода__  
Первая строка входных данных содержит целое число _n_ (1 ≤ _n_ ≤ 1000) — количество клавиш на клавиатуре. 
Вторая строка содержит _n_ целых чисел — $с_1$, $с_2$, ..., $с_n$, где $с_i$ (1 ≤ $с_i$ ≤ 100000) — количество нажатий,выдерживаемых 
_i_-ой клавишей. Третья строка содержит целое число _k_ (1 ≤ _k_ ≤ 100000) — общее количество нажатий клавиш, 
и последняя строка содержит _k_ целых чисел $p_j$ (1 ≤ $p_j$ ≤ _n_) — последовательность нажатых клавиш.

__Формат вывода__  
Программа должна вывести n строк, содержащих информацию об исправности клавиш. Если _i_-я клавиша сломалась, то _i_-ая строка 
должна содержать слово __YES__,если же клавиша работоспособна — слово __NO__.
```cpp
#include <iostream>
#include <vector>

int main() {
    int n;
    std::cin >> n;

    // Массив для хранения максимального количества нажатий для каждой клавиши
    std::vector<int> capacity(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> capacity[i];
    }

    int k;
    std::cin >> k;

    // Массив для подсчёта количества нажатий каждой клавиши
    std::vector<int> press_count(n, 0);

    // Подсчёт нажатий
    for (int i = 0; i < k; ++i) {
        int key;
        std::cin >> key;
        // Преобразуем номер клавиши в индекс массива (от 1 до n → от 0 до n-1)
        press_count[key - 1]++;
    }

    // Проверка состояния каждой клавиши и вывод результата
    for (int i = 0; i < n; ++i) {
        if (press_count[i] > capacity[i]) {
            std::cout << "YES\n";
        } else {
            std::cout << "NO\n";
        }
    }

    return 0;
}
```
Время: 22ms. Память: 792Kb.
