### Пирамида

Для строительства двумерной пирамиды используются прямоугольные блоки, каждый из которых характеризуется шириной и высотой.
Можно поставить один блок на другой, только если ширина верхнего блока строго меньше ширины нижнего (блоки нельзя поворачивать). 
Самым нижним в пирамиде может быть блок любой ширины. По заданному набору блоков определите, пирамиду какой наибольшей высоты можно построить из них.

__Формат ввода__  
В первой строке входных данных задается число _N_ — количество блоков (1 ≤ _N_ ≤ 100000).
В следующих _N_ строках задаются пары натуральных чисел $w_i$ и $h_i$ (1 ≤ $w_i$, $h_i$ ≤ $10^9$) — ширина и высота блока соответственно.

__Формат вывода__
Выведите одно целое число — максимальную высоту пирамиды.
```cpp
#include <iostream>
#include <map>
#include <algorithm>

int main() {
    int N;
    std::cin >> N;

    // Используем map для хранения максимальной высоты для каждой ширины
    // map автоматически отсортирует ключи (ширины) по возрастанию
    std::map<long long, long long> max_height_for_width;

    for (int i = 0; i < N; ++i) {
        long long w, h;
        std::cin >> w >> h;

        // Если для этой ширины ещё нет записи или текущая высота больше — обновляем
        if (max_height_for_width.find(w) == max_height_for_width.end() ||
            h > max_height_for_width[w]) {
            max_height_for_width[w] = h;
        }
    }

    // Теперь складываем высоты всех выбранных блоков
    // Поскольку map сортирует по возрастанию ширины, а нам нужно по убыванию,
    // проходим по элементам в обратном порядке
    long long total_height = 0;
    for (auto it = max_height_for_width.rbegin(); it != max_height_for_width.rend(); ++it) {
        total_height += it->second;
    }

    std::cout << total_height << std::endl;

    return 0;
}
```
Время: 143ms. Память: 6.19Mb.
