### Продажи

Дана база данных о продажах некоторого интернет-магазина. Каждая строка входного файла представляет 
собой запись вида _Покупатель товар количество_, где _Покупатель_ — имя покупателя (строка без пробелов), 
_товар_ — название товара (строка без пробелов), _количество_ — количество приобретенных единиц товара.

Создайте список всех покупателей, а для каждого покупателя подсчитайте количество приобретенных им единиц каждого вида товаров.

__Формат ввода__  
Вводятся сведения о покупках в указанном формате.

__Формат вывода__  
Выведите список всех покупателей в лексикографическом порядке, после имени каждого покупателя выведите двоеточие, 
затем выведите список названий всех приобретенных данным покупателем товаров в лексикографическом порядке, 
после названия каждого товара выведите количество единиц товара, приобретенных данным покупателем. 
Информация о каждом товаре выводится в отдельной строке.

```cpp
#include <iostream>
#include <map>
#include <string>

int main() {
    std::map<std::string, std::map<std::string, long long>> purchases;
    std::string buyer, product;
    long long quantity;

    // Чтение данных до конца ввода
    while (std::cin >> buyer >> product >> quantity) {
        purchases[buyer][product] += quantity;
    }

    // Вывод результатов в требуемом формате
    for (const auto& buyer_data : purchases) {
        std::cout << buyer_data.first << ":\n";
        for (const auto& product_data : buyer_data.second) {
            std::cout << product_data.first << " " << product_data.second << "\n";
        }
    }

    return 0;
}
```
Время: 193ms. Память: 15.47Mb. 
