### Банковские счета

Некоторый банк хочет внедрить систему управления счетами клиентов, поддерживающую следующие операции:  
Пополнение счета клиента.  
Снятие денег со счета.  
Запрос остатка средств на счете.  
Перевод денег между счетами клиентов.  
Начисление процентов всем клиентам.  

Вам необходимо реализовать такую систему. Клиенты банка идентифицируются именами 
(уникальная строка, не содержащая пробелов). Первоначально у банка нет ни одного клиента. 
Как только для клиента проводится операция пололнения, снятия или перевода денег, ему заводится 
счет с нулевым балансом. Все дальнейшие операции проводятся только с этим счетом. Сумма на счету 
может быть как положительной, так и отрицательной, при этом всегда является целым числом.

__Формат ввода__  
Входной файл содержит последовательность операций. Возможны следующие операции: _DEPOSIT name sum_ - зачислить сумму _sum_ на счет 
клиента _name_. Если у клиента нет счета, то счет создается. _WITHDRAW name sum_ - снять сумму _sum_ со счета клиента _name_. 
Если у клиента нет счета, то счет создается. _BALANCE name_ - узнать остаток средств на счету клиента _name_. _TRANSFER name1 name2 sum_ 
- перевести сумму _sum_ со счета клиента _name1_ на счет клиента _name2_. Если у какого-либо клиента нет счета,
- то ему создается счет. _INCOME p_ - начислить всем клиентам, у которых открыты счета, _p%_ от суммы счета.
- Проценты начисляются только клиентам с положительным остатком на счету, если у клиента остаток отрицательный,
- то его счет не меняется. После начисления процентов сумма на счету остается целой,
- то есть начисляется только целое число денежных единиц. Дробная часть начисленных процентов отбрасывается.

__Формат вывода__  
Для каждого запроса _BALANCE_ программа должна вывести остаток на счету данного клиента. 
Если же у клиента с запрашиваемым именем не открыт счет в банке, выведите _ERROR_.

```cpp
#include <iostream>
#include <map>
#include <string>

int main() {
    std::map<std::string, long long> accounts;
    std::string operation;

    while (std::cin >> operation) {
        if (operation == "DEPOSIT") {
            std::string name;
            long long sum;
            std::cin >> name >> sum;
            accounts[name] += sum;
        }
        else if (operation == "WITHDRAW") {
            std::string name;
            long long sum;
            std::cin >> name >> sum;
            accounts[name] -= sum;
        }
        else if (operation == "BALANCE") {
            std::string name;
            std::cin >> name;
            if (accounts.find(name) != accounts.end()) {
                std::cout << accounts[name] << "\n";
            } else {
                std::cout << "ERROR\n";
            }
        }
        else if (operation == "TRANSFER") {
            std::string name1, name2;
            long long sum;
            std::cin >> name1 >> name2 >> sum;
            accounts[name1] -= sum;
            accounts[name2] += sum;
        }
        else if (operation == "INCOME") {
            int p;
            std::cin >> p;
            for (auto& account : accounts) {
                if (account.second > 0) {
                    long long income = account.second * p / 100;
                    account.second += income;
                }
            }
        }
    }

    return 0;
}
```
Время: 80ms. Память: 844Kb. 
