### Расшифровка письменности Майя

Расшифровка письменности Майя оказалась более сложной задачей, 
чем предполагалось ранними исследованиями. На протяжении более чем двух сотен 
лет удалось узнать не так уж много. Основные результаты были получены за последние 30 лет.

Письменность Майя основывается на маленьких рисунках, известных как значки, которые обозначают звуки. 
Слова языка Майя обычно записываются с помощью этих значков, которые располагаются рядом друг с другом в некотором порядке.

Одна из проблем расшифровки письменности Майя заключается в определении этого порядка. Рисуя значки некоторого слова, 
писатели Майя иногда выбирали позиции для значков, исходя скорее из эстетических взглядов, а не определенных правил. 
Это привело к тому, что, хотя звуки для многих значков известны, археологи не всегда уверены, как должно произноситься записанное слово.

Археологи ищут некоторое слово _W_. Они знают значки для него, но не знают все возможные способы их расположения. 
Поскольку они знают, что Вы приедете на IOI ’06, они просят Вас о помощи. Они дадут Вам _g_ значков, составляющих слово _W_, и 
последовательность _S_ всех значков в надписи, которую они изучают, в порядке их появления. Помогите им, подсчитав количество 
возможных появлений слова _W_.

__Задание__   
Напишите программу, которая по значкам слова _W_ и по последовательности _S_ значков надписи подсчитывает количество всех 
возможных вхождений слова _W_ в _S_, то есть количество всех различных позиций идущих подряд _g_ значков в последовательности _S_, 
которые являются какой-либо перестановкой значков слова _W_.

__Формат ввода__  
1 ≤ _g_ ≤ 3 000, _g_ – количество значков в слове _W_

_g_ ≤ |S| ≤ 3 000 000 где |S| – количество значков в последовательности _S_

На вход программы поступают данные в следующем формате:

СТРОКА 1: Содержит два числа, разделенных пробелом – _g_ и |S|.  
СТРОКА 2: Содержит _g_ последовательных символов, с помощью которых записывается слово _W_. Допустимы символы:
‘a’-‘z’ и ‘A’-‘Z’; большие и маленькие буквы считаются различными.  
СТРОКА 3: Содержит |S| последовательных символов, которые представляют значки в надписи. 
Допустимы символы: ‘a’-‘z’ и ‘A’-‘Z’; большие и маленькие буквы считаются различными.

__Формат вывода__ 
Единственная строка выходных данных программы должна содержать количество возможных вхождений слова _W_ в _S_.

```cpp
#include <iostream>
#include <vector>
#include <string>

using namespace std;

int main() {
    int g, s_len;
    cin >> g >> s_len;

    string W, S;
    cin >> W >> S;

    // Частотный массив для символов (учитываем и заглавные, и строчные буквы)
    vector<int> freqW(128, 0);  // ASCII до 127
    vector<int> windowFreq(128, 0);

    // Заполняем частотный массив для слова W
    for (char c : W) {
        freqW[c]++;
    }

    int count = 0;

    // Инициализируем окно: первые g символов S
    for (int i = 0; i < g; i++) {
        windowFreq[S[i]]++;
    }

    // Проверяем первое окно
    if (windowFreq == freqW) {
        count++;
    }

    // Сдвигаем окно по всей последовательности S
    for (int i = g; i < s_len; i++) {
        // Удаляем самый левый символ из окна
        windowFreq[S[i - g]]--;
        // Добавляем новый правый символ
        windowFreq[S[i]]++;

        // Сравниваем частоты
        if (windowFreq == freqW) {
            count++;
        }
    }

    cout << count << endl;
    return 0;
}
```
Время: 101ms. Память: 3.11Mb. 
