### Контрольная по ударениям

Учительница задала Пете домашнее задание — в заданном тексте расставить ударения в словах, 
после чего поручила Васе проверить это домашнее задание. Вася очень плохо знаком с данной темой, поэтому он нашел словарь, 
в котором указано, как ставятся ударения в словах. К сожалению, в этом словаре присутствуют не все слова. Вася решил, 
что в словах, которых нет в словаре, он будет считать, что Петя поставил ударения правильно, если в этом слове Петей 
поставлено ровно одно ударение. Оказалось, что в некоторых словах ударение может быть поставлено больше, чем одним способом. 
Вася решил, что в этом случае если то, как Петя поставил ударение, соответствует одному из приведенных в словаре вариантов, 
он будет засчитывать это как правильную расстановку ударения, а если не соответствует, то как ошибку. Вам дан словарь, 
которым пользовался Вася и домашнее задание, сданное Петей. Ваша задача — определить количество ошибок, которое в этом 
задании насчитает Вася.

__Формат ввода__  
Вводится сначала число _N_ — количество слов в словаре (0 ≤ _N_ ≤ 20000). Далее идет _N_ строк со словами из словаря. 
Каждое слово состоит не более чем из 30 символов. Все слова состоят из маленьких и заглавных латинских букв. 
В каждом слове заглавная ровно одна буква — та, на которую попадает ударение. Слова в словаре расположены в алфавитном порядке. 
Если есть несколько возможностей расстановки ударения в одном и том же слове, то эти варианты в словаре идут в произвольном порядке. 
Далее идет упражнение, выполненное Петей. Упражнение представляет собой строку текста, суммарным объемом не более 300000 символов. 
Строка состоит из слов, которые разделяются между собой ровно одним пробелом. Длина каждого слова не превышает 30 символов. 
Все слова состоят из маленьких и заглавных латинских букв (заглавными обозначены те буквы, над которыми Петя поставил ударение). 
Петя мог по ошибке в каком-то слове поставить более одного ударения или не поставить ударения вовсе.

__Формат вывода__  
Выведите количество ошибок в Петином тексте, которые найдет Вася.

```cpp
#include <iostream>
#include <unordered_map>
#include <unordered_set>
#include <sstream>
#include <string>
#include <cctype>

using namespace std;

// Функция для приведения слова к нижнему регистру
string toLower(const string& word) {
    string result = word;
    for (char& c : result) {
        c = tolower(c);
    }
    return result;
}

// Функция для подсчёта количества заглавных букв в слове
int countUppercase(const string& word) {
    int count = 0;
    for (char c : word) {
        if (isupper(c)) {
            count++;
        }
    }
    return count;
}

int main() {
    int N;
    cin >> N;

    // Словарь: ключ — базовая форма слова, значение — множество вариантов с ударениями
    unordered_map<string, unordered_set<string>> dictionary;

    // Считываем слова из словаря
    for (int i = 0; i < N; i++) {
        string word;
        cin >> word;
        string baseForm = toLower(word);
        dictionary[baseForm].insert(word);
    }

    // Пропускаем оставшуюся часть строки после N
    cin.ignore();

    // Считываем строку с текстом Пети
    string text;
    getline(cin, text);

    // Разбиваем текст на слова
    istringstream iss(text);
    string word;
    int errorCount = 0;

    while (iss >> word) {
        string baseForm = toLower(word);

        // Проверяем, есть ли слово в словаре
        if (dictionary.find(baseForm) != dictionary.end()) {
            // Слово есть в словаре — проверяем, совпадает ли вариант ударения с каким‑либо допустимым
            if (dictionary[baseForm].find(word) == dictionary[baseForm].end()) {
                errorCount++;
            }
        } else {
            // Слова нет в словаре — считаем правильным, только если ровно одно ударение
            if (countUppercase(word) != 1) {
                errorCount++;
            }
        }
    }

    cout << errorCount << endl;
    return 0;
}
```
Время: 35ms. Память: 6.47Mb.
