### Дополнительная проверка на списывание

Преподаватель курса ОиМП заказал у одного известного психолога полное психологическое обследование всех студентов, 
поступивших на ФНК с целью выяснить их склонность к списыванию еще до начала занятий и отчислить их за списывание 
еще до того как они приступят к занятиям и смогут позорить ФНК своими преступлениями. Психолог, привлеченный для 
проведения обследования, известен своим инновационным методом, позволяющим понять склонность к списыванию студента 
по наиболее часто используемому им в программах идентификатору. Помогите известному психологу определить, какие из 
студентов потенциально являются преступниками. Напишите программу, которая по приведенной программе выяснит наиболее 
часто используемый в ней идентификатор.

Поскольку разные студенты на тестировании пишут программы на разных языках программирования, ваша программа должна 
уметь работать с произвольным языком. Поскольку в разных языках используются различные ключевые слова, то список 
ключевых слов в анализируемом языке предоставляется на вход программе. Все последовательности из латинских букв, 
цифр и знаков подчеркивания, которые не являются ключевыми словами и содержат хотя бы один символ, не являющийся цифрой, 
могут быть идентификаторами. При этом в некоторых языках идентификаторы могут начинаться с цифры, а в некоторых - нет. 
Если идентификатор не может начинаться с цифры, то последовательность, начинающаяся с цифры, идентификатором не является. 
Кроме этого, задано, является ли язык чувствительным к регистру символов, используемых в идентификаторах и ключевых словах.

__Формат ввода__  
В первой строке вводятся число _n_ - количество ключевых слов в языке (0 <= _n_ <= 50) и два слова _C_ и _D_, каждое из которых 
равно либо _yes_, либо _no_. Слово _C_ равно _yes_, если идентификаторы и ключевые слова в языке чувствительны к регистру символов, 
и _no_, если нет. Слово D равно _yes_, если идентификаторы в языке могут начинаться с цифры, и _no_, если нет.

Следующие _n_ строк содержат по одному слову, состоящему из букв латинского алфавита и символов подчеркивания - 
ключевые слова. Все ключевые слова непусты, различны, при этом, если язык не чувствителен к регистру, то различны и без учета регистра. 
Длина каждого ключевого слова не превышает 50 символов.

Далее до конца входных данных идет текст программы. Он содержит только символы с ASCII-кодами от 32 до 126 и переводы строки.

Размер входных данных не превышает 10 килобайт. В программе есть хотя бы один идентификатор.

__Формат вывода__  
Выведите идентификатор, встречающийся в программе максимальное число раз. Если таких идентификаторов несколько, 
следует вывести тот, который встречается в первый раз раньше. Если язык во входных данных не чувствителен к регистру, 
то можно выводить идентификатор в любом регистре.

```cpp
#include <iostream>
#include <unordered_set>
#include <unordered_map>
#include <string>
#include <cctype>
#include <algorithm>

using namespace std;

// Приведение строки к нижнему регистру
string toLower(const string& s) {
    string result = s;
    transform(result.begin(), result.end(), result.begin(), ::tolower);
    return result;
}

// Проверка, состоит ли строка только из цифр
bool isAllDigits(const string& token) {
    if (token.empty()) return false;
    for (char c : token) {
        if (!isdigit(c)) {
            return false;
        }
    }
    return true;
}

// Обработка одного токена: проверка, является ли он идентификатором, и обновление статистики
void processToken(const string& token,
                   const unordered_set<string>& keywords,
                   unordered_map<string, int>& freq,
                   unordered_map<string, int>& first_pos,
                   int& pos_counter,
                   bool case_sensitive,
                   bool digit_start) {
    if (token.empty()) return;

    string orig_token = token;
    string processed_token = case_sensitive ? orig_token : toLower(orig_token);

    // Проверка: не ключевое слово
    if (keywords.find(processed_token) != keywords.end()) {
        return;
    }

    // Проверка: содержит хотя бы один нецифровой символ
    if (isAllDigits(token)) {
        return;
    }

    // Проверка: если не может начинаться с цифры
    if (!digit_start && isdigit(token[0])) {
        return;
    }

    // Если все проверки пройдены, обновляем статистику
    if (freq.find(processed_token) == freq.end()) {
        first_pos[processed_token] = pos_counter++;
    }
    freq[processed_token]++;
}

int main() {
    int n;
    string case_sensitive_str, digit_start_str;
    cin >> n >> case_sensitive_str >> digit_start_str;

    bool case_sensitive = (case_sensitive_str == "yes");
    bool digit_start = (digit_start_str == "yes");

    unordered_set<string> keywords;
    for (int i = 0; i < n; i++) {
        string keyword;
        cin >> keyword;
        if (!case_sensitive) {
            keyword = toLower(keyword);
        }
        keywords.insert(keyword);
    }

    // Пропускаем оставшуюся часть строки после ключевых слов
    cin.ignore();

    string line;
    unordered_map<string, int> freq;        // Частота каждого идентификатора
    unordered_map<string, int> first_pos; // Позиция первого вхождения
    int pos_counter = 0;

    while (getline(cin, line)) {
        string token;
        for (char c : line) {
            if (isalnum(c) || c == '_') {
                token += c;
            } else {
                processToken(token, keywords, freq, first_pos, pos_counter, case_sensitive, digit_start);
                token.clear();
            }
        }
        // Обрабатываем последний токен в строке
        processToken(token, keywords, freq, first_pos, pos_counter, case_sensitive, digit_start);
    }

    // Находим идентификатор с максимальной частотой, при равенстве — с минимальной позицией первого вхождения
    string best_id;
    int max_freq = -1;
    int min_pos = -1;

    for (const auto& entry : freq) {
        const string& id = entry.first;
        int f = entry.second;
        int pos = first_pos[id];

        if (f > max_freq || (f == max_freq && pos < min_pos)) {
            max_freq = f;
            min_pos = pos;
            best_id = id;
        }
    }

    cout << best_id << endl;
    return 0;
}
```
Время: 3ms. Память: 1.15Mb.
