### Стильная одежда

Глеб обожает шоппинг. Как-то раз он загорелся идеей подобрать себе майку и штаны так, чтобы выглядеть в них максимально стильно. 
В понимании Глеба стильность одежды тем больше, чем меньше разница в цвете элементов его одежды.

В наличии имеется _N_ (1 ≤ _N_ ≤ 100 000) маек и _M_ (1 ≤ _M_ ≤ 100 000) штанов, про каждый элемент известен его цвет 
(целое число от 1 до 10 000 000). Помогите Глебу выбрать одну майку и одни штаны так, чтобы разница в их цвете была как можно меньше.

__Формат ввода__  
Сначала вводится информация о майках: в первой строке целое число _N_ (1 ≤ _N_ ≤ 100 000) и во второй N целых чисел от 1 до 
10 000 000 — цвета имеющихся в наличии маек. Гарантируется, что номера цветов идут в возрастающем порядке (в частности, цвета 
никаких двух маек не совпадают).

Далее в том же формате идёт описание штанов: их количество _M_ (1 ≤ _M_ ≤ 100 000) и в следующей строке _M_ целых чисел от 
1 до 10 000 000 в возрастающем порядке — цвета штанов.

__Формат вывода__  
Выведите пару неотрицательных чисел — цвет майки и цвет штанов, которые следует выбрать Глебу. 
Если вариантов выбора несколько, выведите любой из них.

```cpp
#include <iostream>
#include <vector>
#include <cmath>
#include <climits>

using namespace std;

int main() {
    int N;
    cin >> N;
    vector<int> tshirts(N);
    for (int i = 0; i < N; ++i) {
        cin >> tshirts[i];
    }

    int M;
    cin >> M;
    vector<int> pants(M);
    for (int i = 0; i < M; ++i) {
        cin >> pants[i];
    }

    int best_tshirt_color = tshirts[0];
    int best_pants_color = pants[0];
    int min_diff = abs(tshirts[0] - pants[0]);

    int i = 0, j = 0;

    while (i < N && j < M) {
        int current_diff = abs(tshirts[i] - pants[j]);

        if (current_diff < min_diff) {
            min_diff = current_diff;
            best_tshirt_color = tshirts[i];
            best_pants_color = pants[j];
        }

        // Двигаем указатель того массива, элемент которого меньше
        if (tshirts[i] < pants[j]) {
            ++i;
        } else {
            ++j;
        }
    }

    cout << best_tshirt_color << " " << best_pants_color << endl;

    return 0;
}
```
Время: 73ms. Память: 924Kb.
