### Сумма номеров

Вася очень любит везде искать своё счастливое число _K_. Каждый день он ходит в школу по улице, вдоль которой припарковано _N_ машин. 
Он заинтересовался вопросом, сколько существует наборов машин, стоящих подряд на местах с _L_ до _R_, что сумма их номеров равна 
_K_. Помогите Васе узнать ответ на его вопрос.

Например, если число _N_ = 5, _K_ = 17, а номера машин равны 17, 7, 10, 7, 10, то существует 4 набора машин:  
17 (L = 1, R = 1),  
7, 10 (L = 2, R = 3),  
10, 7 (L = 3, R = 4),  
7, 10 (L = 4, R = 5)  

__Формат ввода__  
В первой строке входных данных задаются числа _N_ и _K_ (1 ≤ _N_ ≤ 100000, 1 ≤ _K_ ≤ $10^9$).
Во второй строке содержится _N_ чисел, задающих номера машин. Номера машин могут принимать значения от 1 до 999 включительно.

__Формат вывода__  
Необходимо вывести одно число — количество наборов.

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    long long N, K;
    cin >> N >> K;
    vector<long long> cars(N);
    
    for (int i = 0; i < N; ++i) {
        cin >> cars[i];
    }

    long long count = 0;
    long long current_sum = 0;
    int left = 0;

    // Используем метод скользящего окна (two pointers / sliding window)
    for (int right = 0; right < N; ++right) {
        // Добавляем текущий элемент к сумме
        current_sum += cars[right];

        // Пока сумма больше K, сдвигаем левую границу окна
        while (current_sum > K && left <= right) {
            current_sum -= cars[left];
            ++left;
        }

        // Если текущая сумма равна K, нашли подходящий набор
        if (current_sum == K) {
            ++count;
        }
    }

    cout << count << endl;
    return 0;
}
```
Время: 30ms. Память: 924Kb.
