### Туризм

Александр недавно увлекся горным туризмом. Ему уже надоело покорять отдельные горные пики, и он собирается покорить самую 
настоящую горную цепь!

Напомним, что Александр живет в плоском мире. Горная цепь состоит из отрезков, соединяющих точки на плоскости, 
каждая из которых находится строго правее предыдущей (_x_-координата следующей точки больше, чем у предыдущей). 
Трассой на горной цепи называется её часть между двумя фиксированными концами отрезков.

Участок, на котором при движении по трассе координата _y_ (высота) всегда возрастает, называется подъемом, 
величиной подъема называется разность высот между начальной и конечной точками участка.

Туристическая компания предлагает на выбор несколько трасс на одной горной цепи. Александр из-за финансовых 
трудностей может выбрать для поездки только одну из этих трасс. Вы решили помочь ему с выбором. Александру 
важно для каждой трассы определить суммарную высоту подъемов на ней. Обратите внимание, что трасса может идти как слева-направо, 
так и справа-налево.

__Формат ввода__  
В первой строке входного файла содержится единственное число _N_ — количество точек ломаной, задающей горную цепь (1 ≤ _N_ ≤ 30 000). 
Далее в _N_ строках содержатся описания точек, каждое из которых состоит из двух целых чисел, $x_i$ и $y_i$ (1 ≤ $x_i$, $y_i$ ≤ 30 000).

В следующей строке находится число _M_ — количество трасс (1 ≤ _M_ ≤ 30 000).

Далее в _M_ строках содержатся описания трасс. Каждое описание представляет собой два целых числа, $s_i$ и $f_i$, они 
обозначают номера вершин начала и конца трассы, соответственно 1 ≤ $s_i$ ≤ _N_, 1 ≤ $f_i$ ≤ _N_. Начало и конец трассы 
могут совпадать.
Гарантируется, что во входном файле задана именно горная цепь.

__Формат вывода__  
Для каждой трассы выведите одно число — суммарную высоту подъемов на данной трассе.

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    int N;
    cin >> N;
    vector<int> x(N), y(N);

    // Считываем координаты точек горной цепи
    for (int i = 0; i < N; ++i) {
        cin >> x[i] >> y[i];
    }

    int M;
    cin >> M;

    // Предподсчёт префиксных сумм для подъёмов слева‑направо и справа‑налево
    vector<long long> prefix_forward(N, 0);  // Сумма подъёмов от начала до i-й точки (слева направо)
    vector<long long> prefix_backward(N, 0); // Сумма подъёмов от конца до i-й точки (справа налево)

    // Заполняем префиксные суммы для движения слева направо
    for (int i = 1; i < N; ++i) {
        prefix_forward[i] = prefix_forward[i - 1];
        if (y[i] > y[i - 1]) {
            prefix_forward[i] += y[i] - y[i - 1];
        }
    }

    // Заполняем префиксные суммы для движения справа налево
    for (int i = N - 2; i >= 0; --i) {
        prefix_backward[i] = prefix_backward[i + 1];
        if (y[i] > y[i + 1]) {
            prefix_backward[i] += y[i] - y[i + 1];
        }
    }

    // Обрабатываем запросы для каждой трассы
    for (int i = 0; i < M; ++i) {
        int s, f;
        cin >> s >> f;
        s--; f--; // Приводим к 0‑индексации

        long long result = 0;

        if (s == f) {
            // Начало и конец совпадают — суммарная высота подъёмов равна 0
            result = 0;
        } else if (s < f) {
            // Движение слева направо: берём разницу префиксных сумм
            result = prefix_forward[f] - prefix_forward[s];
        } else {
            // Движение справа налево: берём разницу префиксных сумм в обратном направлении
            result = prefix_backward[f] - prefix_backward[s];
        }

        cout << result << endl;
    }

    return 0;
}
```
Время: 83ms. Память: 920Kb. 
