### Город Че

В центре города Че есть пешеходная улица - одно из самых популярных мест для прогулок жителей города. 
По этой улице очень приятно гулять, ведь вдоль улицы расположено n забавных памятников.

Девочке Маше из города Че нравятся два мальчика из ее школы, и она никак не может сделать выбор между ними. 
Чтобы принять окончательное решение, она решила назначить обоим мальчикам свидание в одно и то же время. 
Маша хочет выбрать два памятника на пешеходной улице, около которых мальчики будут ее ждать. При этом она хочет выбрать 
такие памятники, чтобы мальчики не увидели друг друга. Маша знает, что из-за тумана мальчики увидят друг друга только 
в том случае, если они будут на расстоянии не более _r_ метров.

Маше заинтересовалась, а сколько способов есть выбрать два различных памятника для организации свиданий.

__Формат ввода__  
В первой строке входного файла находятся два целых числа _n_ и _r_ (2 ≤ _n_ ≤ 300000, 1 ≤ _r_ ≤ $10^9$) - количество памятников 
и максимальное расстояние, на котором мальчики могут увидеть друг друга.

Во второй строке задано _n_ положительных чисел $d_1$, ..., $d_n$, где $d_i$ - расстояние от _i_-го памятника до начала улицы. 
Все памятники находятся на разном расстоянии от начала улицы. Памятники приведены в порядке возрастания расстояния от начала улицы 
(1 ≤ $d_1$, $d_2$, ..., $d_n$ ≤ $10^9$).

__Формат вывода__  
Выведите одно число - число способов выбрать два памятника для организации свиданий.

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n;
    long long r;
    cin >> n >> r;
    vector<long long> d(n);

    // Считываем расстояния от начала улицы до каждого памятника
    for (int i = 0; i < n; ++i) {
        cin >> d[i];
    }

    long long result = 0;
    int j = 0; // Указатель на первый памятник, который слишком близко к текущему

    // Используем метод двух указателей (скользящее окно)
    for (int i = 0; i < n; ++i) {
        // Двигаем указатель j, пока расстояние между d[j] и d[i] <= r
        // Нам нужны пары, где расстояние > r, поэтому ищем границу
        while (j < n && d[j] - d[i] <= r) {
            ++j;
        }
        // Все памятники с индексами от j до n-1 находятся на расстоянии > r от памятника i
        // Их количество: n - j
        result += n - j;
    }

    cout << result << endl;
    return 0;
}
```
Время: 135ms. Память: 2.45Mb.
