### Красота превыше всего

В парке города Питсбурга есть чудесная аллея, состоящая из _N_ посаженных в один ряд деревьев, каждое одного из _K_ сортов. 
В связи с тем, что Питсбург принимает открытый чемпионат Байтландии по программированию, было решено построить огромную 
арену для проведения соревнований. Так, согласно этому плану вся аллея подлежала вырубке. Однако министерство деревьев 
и кустов воспротивилось этому решению, и потребовало оставить некоторые из деревьев в покое. Согласно новому плану 
строительства все деревья, которые не будут вырублены, должны образовывать один непрерывный отрезок, являющийся 
подотрезком исходного. Каждого из K видов деревьев требуется сохранить хотя бы по одному экземпляру. На вас возложена 
задача найти отрезок наименьшей длины, удовлетворяющий указанным ограничениям.

__Формат ввода__  
В первой строке входного файла находятся два числа _N_ и _K_ (1 ≤ _N_, _K_ ≤ 250000). Во второй строке входного файла следуют _N_ чисел 
(разделенных пробелами), _i_-ое число второй строки задает сорт _i_-ого слева дерева в аллее. Гарантируется, что присутствует 
хотя бы одно дерево каждого сорта

__Формат вывода__  
В выходной файл выведите два числа, координаты левого и правого концов отрезка минимальной длины, 
удовлетворяющего условию. Если оптимальных ответов несколько, выведите любой.

```cpp
#include <iostream>
#include <vector>
#include <unordered_map>

using namespace std;

int main() {
    int N, K;
    cin >> N >> K;
    vector<int> trees(N);
    
    for (int i = 0; i < N; ++i) {
        cin >> trees[i];
    }

    // Указатели для скользящего окна
    int left = 0, right = 0;
    // Хранит количество деревьев каждого сорта в текущем окне
    unordered_map<int, int> count;
    // Количество уникальных сортов в текущем окне
    int unique_kinds = 0;
    
    // Ответ: минимальная длина и координаты отрезка
    int min_length = N + 1;
    int best_left = 1, best_right = N;

    while (right < N) {
        // Добавляем дерево справа в окно
        if (count[trees[right]] == 0) {
            unique_kinds++;
        }
        count[trees[right]]++;
        right++;

        // Пока в окне есть все K сортов, пытаемся сдвинуть левый указатель
        while (unique_kinds == K) {
            // Обновляем ответ, если нашли более короткий отрезок
            if (right - left < min_length) {
                min_length = right - left;
                best_left = left + 1;  // +1, так как в выводе нумерация с 1
                best_right = right;     // right уже увеличен на 1 в предыдущем шаге
            }

            // Убираем дерево слева из окна
            count[trees[left]]--;
            if (count[trees[left]] == 0) {
                unique_kinds--;
            }
            left++;
        }
    }

    cout << best_left << " " << best_right << endl;
    return 0;
}
```
Время: 115ms. Память: 11.30Mb. 
