### Кондиционеры

При реализации проекта «Умная школа» было решено в каждый учебный класс выбранной для этого школы 
установить по кондиционеру нового поколения для автоматического охлаждения и вентиляции воздуха. 
По проекту в каждом классе должен быть установлен только один кондиционер и мощность кондиционера 
должна быть достаточной для размеров класса. Чем больше класс, тем мощнее должен быть кондиционер.

Все классы школы пронумерованы последовательно от 1 до _n_. Известно, что для каждого класса с номером i, 
требуется ровно один кондиционер, мощность которого больше или равна $a_i$ ватт.

Администрации школы предоставили список из m различных моделей кондиционеров, которые можно закупить. 
Для каждой модели кондиционера известна его мощность и стоимость. Требуется написать программу, которая определит, 
за какую минимальную суммарную стоимость кондиционеров можно оснастить все классы школы.

__Формат ввода__  
Первая строка входного файла содержит одно целое число _n_ (1 ≤ _n_ ≤ 50 000) количество классов в школе.

Вторая строка содержит n целых чисел $a_i$ (1 ≤ $a_i$ ≤ 1000) — минимальная мощность кондиционера в ваттах, 
который можно установить в классе с номером _i_.

Третья строка содержит одно целое число _m_ (1 ≤ _m_ ≤ 50 000) — количество предложенных моделей кондиционеров.

Далее, в каждой из m строк содержится пара целых чисел $b_j$ и $c_j$ (1 ≤ $b_j$ ≤ 1000, 1 ≤ $c_j$ ≤ 1000) мощность в ваттах _j_-й 
модели кондиционера и его цена в рублях соответственно.

__Формат вывода__  
Выходной файл должен содержать одно число минимальную суммарную стоимость кондиционеров в рублях. 
Гарантируется, что хотя бы один корректный выбор кондиционеров существует, и во всех классах можно установить подходящий кондиционер.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <climits>

using namespace std;

int main() {
    int n;
    cin >> n;

    vector<int> a(n);
    for (int i = 0; i < n; ++i) {
        cin >> a[i];
    }

    int m;
    cin >> m;

    // Для каждой мощности храним минимальную стоимость кондиционера с такой или большей мощностью
    vector<int> min_cost(1001, INT_MAX); // мощности от 1 до 1000

    for (int i = 0; i < m; ++i) {
        int b, c;
        cin >> b >> c;

        // Обновляем минимальную стоимость для всех мощностей <= b
        for (int power = 1; power <= b; ++power) {
            min_cost[power] = min(min_cost[power], c);
        }
    }

    long long total_cost = 0;
    for (int required_power : a) {
        total_cost += min_cost[required_power];
    }

    cout << total_cost << endl;

    return 0;
}
```
Время: 77ms. Память: 792Kb. 
