### Подстроки

В этой задаче Вам требуется найти максимальную по длине подстроку данной строки, 
такую что каждый символ встречается в ней не более _k_ раз.

__Формат ввода__   
В первой строке даны два целых числа _n_ и _k_ (1 ≤ _n_ ≤ 100000, 1 ≤ _k_ ≤ _n_) , где _n_ – количество символов в строке. 
Во второй строке _n_ символов – данная строка, состоящая только из строчных латинских букв.

__Формат вывода__  
В выходной файл выведите два числа – длину искомой подстроки и номер её первого символа. Если решений несколько, выведите любое.

```cpp
#include <iostream>
#include <vector>
#include <string>

using namespace std;

int main() {
    int n, k;
    cin >> n >> k;
    string s;
    cin >> s;

    // Массив для подсчёта частоты символов (строчные латинские буквы)
    vector<int> count(26, 0);
    
    int left = 0;           // Левая граница окна
    int max_len = 0;      // Максимальная длина найденной подстроки
    int best_pos = 0;     // Позиция начала максимальной подстроки (1-индексация)

    for (int right = 0; right < n; ++right) {
        // Добавляем текущий символ в окно
        char c = s[right];
        count[c - 'a']++;

        // Сдвигаем левую границу, пока не уберём символ с частотой > k
        while (count[c - 'a'] > k) {
            count[s[left] - 'a']--;
            left++;
        }

        // Обновляем результат, если текущая подстрока длиннее
        int current_len = right - left + 1;
        if (current_len > max_len) {
            max_len = current_len;
            best_pos = left + 1;  // Переводим в 1-индексацию
        }
    }

    cout << max_len << " " << best_pos << endl;
    return 0;
}

```
Время: 4ms. Память: 848Kb. 
