### Двоичный поиск

Реализуйте двоичный поиск в массиве

__Формат ввода__  
В первой строке входных данных содержатся натуральные числа _N_ и _K_ (0 < _N_, _K_ ≤ 100000). Во второй строке задаются 
_N_ элементов первого массива, а в третьей строке – _K_ элементов второго массива. Элементы обоих массивов - 
целые числа, каждое из которых по модулю не превосходит $10^9$.
 
__Формат вывода__  
Требуется для каждого из _K_ чисел вывести в отдельную строку __YES__, если это число встречается в первом массиве, и 
__NO__ в противном случае.

```cpp
#include <iostream>
#include <unordered_set>
#include <vector>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int N, K;
    cin >> N >> K;

    // Множество для хранения элементов первого массива (обеспечивает быстрый поиск)
    unordered_set<long long> firstArraySet;

    // Считываем N элементов первого массива и добавляем их в множество
    for (int i = 0; i < N; ++i) {
        long long num;
        cin >> num;
        firstArraySet.insert(num);
    }

    // Обрабатываем K элементов второго массива
    for (int i = 0; i < K; ++i) {
        long long query;
        cin >> query;

        // Проверяем, есть ли элемент в множестве
        if (firstArraySet.find(query) != firstArraySet.end()) {
            cout << "YES\n";
        } else {
            cout << "NO\n";
        }
    }

    return 0;
}
```
Время: 52ms. Память: 4.53Mb.
