### Приближённый двоичный поиск

Для каждого из чисел второй последовательности найдите ближайшее к нему в первой.

__Формат ввода__
В первой строке входных данных содержатся числа _N_ и _K_ (0 < _N_, _K_ < 100001). Во второй строке задаются 
__ чисел первого массива, отсортированного по неубыванию, а в третьей строке – 
_K_ чисел второго массива. Каждое число в обоих массивах по модулю не превосходит 2⋅$10^9$.

__Формат вывода__ 
Для каждого из _K_ чисел выведите в отдельную строку число из первого массива, наиболее близкое к данному. 
Если таких несколько, выведите меньшее из них.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <cmath>

using namespace std;

// Функция для поиска ближайшего числа в отсортированном массиве
long long findClosest(const vector<long long>& arr, long long target) {
    int n = arr.size();
    
    // Если target меньше или равен первому элементу
    if (target <= arr[0]) {
        return arr[0];
    }
    
    // Если target больше или равен последнему элементу
    if (target >= arr[n - 1]) {
        return arr[n - 1];
    }
    
    // Бинарный поиск для нахождения позиции, где target мог бы быть вставлен
    int left = 0, right = n - 1;
    while (left < right) {
        int mid = left + (right - left) / 2;
        if (arr[mid] < target) {
            left = mid + 1;
        } else {
            right = mid;
        }
    }
    
    // Теперь left указывает на первый элемент >= target
    // Сравниваем arr[left] и arr[left-1]
    long long candidate1 = arr[left];      // первый >= target
    long long candidate2 = arr[left - 1]; // последний < target
    
    long long diff1 = abs(candidate1 - target);
    long long diff2 = abs(candidate2 - target);
    
    // Если разницы равны, возвращаем меньшее число (по условию задачи)
    if (diff1 < diff2) {
        return candidate1;
    } else if (diff2 < diff1) {
        return candidate2;
    } else {
        // При равной разнице возвращаем меньшее число
        return min(candidate1, candidate2);
    }
}

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);
    
    int N, K;
    cin >> N >> K;
    
    vector<long long> firstArray(N);
    for (int i = 0; i < N; ++i) {
        cin >> firstArray[i];
    }
    
    vector<long long> secondArray(K);
    for (int i = 0; i < K; ++i) {
        cin >> secondArray[i];
    }
    
    // Для каждого числа из второго массива находим ближайшее в первом
    for (int i = 0; i < K; ++i) {
        long long result = findClosest(firstArray, secondArray[i]);
        cout << result << '\n';
    }
    
    return 0;
}
```
Время: 50ms. Память: 1.68Mb. 
