### Дипломы

Когда Петя учился в школе, он часто участвовал в олимпиадах по информатике, математике и физике. 
Так как он был достаточно способным мальчиком и усердно учился, то на многих из этих олимпиад он получал дипломы. 
К окончанию школы у него накопилось _n_ дипломов, причём, как оказалось, все они имели одинаковые размеры: 
_w_ — в ширину и _h_ — в высоту. Сейчас Петя учится в одном из лучших российских университетов и живёт 
в общежитии со своими одногруппниками. Он решил украсить свою комнату, повесив на одну из стен свои дипломы 
за школьные олимпиады. Так как к бетонной стене прикрепить дипломы достаточно трудно, то он решил купить 
специальную доску из пробкового дерева, чтобы прикрепить её к стене, а к ней — дипломы. Для того чтобы эта 
конструкция выглядела более красиво, Петя хочет, чтобы доска была квадратной и занимала как можно меньше 
места на стене. Каждый диплом должен быть размещён строго в прямоугольнике размером w на h. Дипломы запрещается 
поворачивать на 90 градусов. Прямоугольники, соответствующие различным дипломам, не должны иметь общих внутренних 
точек. Требуется написать программу, которая вычислит минимальный размер стороны доски, которая потребуется Пете 
для размещения всех своих дипломов.

__Формат ввода__  
Входной файл содержит три целых числа: _w_, _h_, _n_ (1 ≤ _w_, _h_, _n_ ≤ $10^9$).

__Формат вывода__  
В выходной файл необходимо вывести ответ на поставленную задачу.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

bool canFit(long long side, long long w, long long h, long long n) {
    // Проверяем, сколько дипломов помещается по ширине и высоте
    long long count_w = side / w;
    long long count_h = side / h;

    // Защита от переполнения: если count_w слишком большой, значит, точно помещается
    if (count_w == 0) return false;
    if (count_h >= (n + count_w - 1) / count_w) {
        return true;
    }
    return count_w * count_h >= n;
}

int main() {
    long long w, h, n;
    cin >> w >> h >> n;

    // Устанавливаем безопасные границы для бинарного поиска
    long long left = 0;
    long long right = max(w, h);

    // Увеличиваем правую границу до тех пор, пока не сможем разместить все дипломы
    while (!canFit(right, w, h, n)) {
        right *= 2;
    }

    long long answer = right;

    // Бинарный поиск минимального размера
    while (left <= right) {
        long long mid = left + (right - left) / 2;

        if (canFit(mid, w, h, n)) {
            answer = mid;
            right = mid - 1; // Ищем меньший размер
        } else {
            left = mid + 1;  // Увеличиваем размер
        }
    }

    cout << answer << endl;
    return 0;
}
```
Время: 2ms. Память: 796Kb.
