### Космическое поселение

Для освоения Марса требуется построить исследовательскую базу. База должна состоять из n одинаковых модулей, 
каждый из которых представляет собой прямоугольник.
Каждый модуль представляет собой жилой отсек, который имеет форму прямоугольника размером _a_ на _b _метров. Для повышения 
надежности модулей инженеры могут добавить вокруг каждого модуля слой дополнительной защиты. Толщина этого 
слоя должна составлять целое число метров, и все модули должны иметь одинаковую толщину дополнительной защиты. 
Модуль с защитой, толщина которой равна d метрам, будет иметь форму прямоугольника размером (a + 2d)(b + 2d) метров.

Все модули должны быть расположены на заранее подготовленном прямоугольном поле размером _wh_ метров. При этом они 
должны быть организованы в виде регулярной сетки: их стороны должны быть параллельны сторонам поля, и модули должны 
быть ориентированы одинаково.

Требуется написать программу, которая по заданным количеству и размеру модулей, 
а также размеру поля для их размещения, определяет максимальную толщину слоя дополнительной защиты, 
который можно добавить к каждому модулю.

__Формат ввода__ 
Входной файл содержит пять разделенных пробелами целых чисел: _n, a, b, w_ и _h_ (1 ≤ _n,a,b,w,h_ ≤ $10^18$). Гарантируется, 
что без дополнительной защиты все модули можно разместить в поселении описанным образом.

__Формат вывода__  
Выходной файл должен содержать одно целое число: максимальную возможную толщину дополнительной защиты. 
Если дополнительную защиту установить не удастся, требуется вывести число 0.

__Примечание__  
Для входных данных 11 3 2 21 25 можно установить дополнительную защиту толщиной 2 метра и разместить модули на поле.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

// Функция проверяет, можно ли разместить n модулей с защитой толщины d
bool canPlace(long long d, long long n, long long a, long long b, long long w, long long h) {
    long long module_width1 = a + 2 * d;
    long long module_height1 = b + 2 * d;

    // Вариант 1: ориентация a×b
    if (module_width1 > w || module_height1 > h) {
        // Если модуль не помещается даже один раз, пробуем другую ориентацию
    } else {
        long long count_w1 = w / module_width1;
        long long count_h1 = h / module_height1;
        if (count_w1 * count_h1 >= n) {
            return true;
        }
    }

    long long module_width2 = b + 2 * d;
    long long module_height2 = a + 2 * d;

    // Вариант 2: ориентация b×a
    if (module_width2 > w || module_height2 > h) {
        return false; // Ни одна ориентация не подходит
    }
    long long count_w2 = w / module_width2;
    long long count_h2 = h / module_height2;

    return count_w2 * count_h2 >= n;
}

int main() {
    long long n, a, b, w, h;
    cin >> n >> a >> b >> w >> h;

    // Границы для бинарного поиска
    long long left = 0;
    long long right = min((w - a) / 2, (h - b) / 2);
    long long answer = 0;

    // Увеличиваем правую границу, если нужно (на случай, если изначальная слишком мала)
    while (right < 1e18 && !canPlace(right, n, a, b, w, h)) {
        right *= 2;
    }

    // Бинарный поиск максимальной толщины защиты
    while (left <= right) {
        long long mid = left + (right - left) / 2;

        if (canPlace(mid, n, a, b, w, h)) {
            answer = mid;
            left = mid + 1; // Пробуем увеличить толщину
        } else {
            right = mid - 1; // Уменьшаем толщину
        }
    }

    cout << answer << endl;
    return 0;
}
```
Время: 2ms. Память: 668Kb. 
