### Улучшение успеваемости

В лицее на уроках информатики ответы учеников оцениваются целым числом баллов от 2 до 5. 
Итоговая оценка по информатике выставляется как среднее арифметическое оценок на всех уроках, 
округленное до ближайшего целого числа. Если среднее значение находится ровно посередине между двумя целыми числами, 
то оценка округляется вверх.

Все ученики лицея стремятся получить итоговую оценку по информатике не ниже 4 баллов. 
К сожалению, один из учеников получил на уроках a двоек, b троек и c четверок. Теперь 
он планирует получить несколько пятерок, причем хочет, чтобы итоговая оценка была не меньше 4 баллов. 
Ему надо понять, какое минимальное количество пятерок ему необходимо получить, чтобы добиться своей цели.

Требуется написать программу, которая по заданным целым неотрицательные числам _a_, _b_ и _c_ определяет минимальное 
количество пятерок, которое необходимо получить ученику, чтобы его итоговая оценка по информатике была не меньше 4 баллов.

__Формат ввода__  
Входные данные содержат три строки. Первая строка содержит целое неотрицательное число _a_, вторая строка содержит целое 
неотрицательное число _b_, третья строка содержит целое неотрицательное число _c_ (0 ≤ _a, b, c_ ≤ $10^15$, _a + b + c_ ≥ 1).

__Формат вывода__  
Выходные данные должны содержать одно число: минимальное число пятерок, 
которое необходимо получить ученику, чтобы итоговая оценка была не меньше 4 баллов.

```cpp
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    long long a, b, c;
    cin >> a >> b >> c;

    // Вычисляем необходимое количество пятёрок
    double required = a + (b - c) / 3.0;
    long long x = max(0LL, (long long)ceil(required));

    cout << x << endl;

    return 0;
}
```
Время: 2ms. Память: 796Kb.
