### Очень лёгкая задача

Сегодня утром жюри решило добавить в вариант олимпиады еще одну, Очень Легкую Задачу. 
Ответственный секретарь Оргкомитета напечатал ее условие в одном экземпляре, и теперь 
ему нужно до начала олимпиады успеть сделать еще _N_ копий. В его распоряжении имеются два ксерокса, 
один из которых копирует лист за _х_ секунд, а другой – за _y_. (Разрешается использовать как один ксерокс, 
так и оба одновременно. Можно копировать не только с оригинала, но и с копии.) Помогите ему выяснить, 
какое минимальное время для этого потребуется.

__Формат ввода__  
На вход программы поступают три натуральных числа _N, x_ и _y_, разделенные пробелом (1 ≤ _N_ ≤ 2×$10^8$, 1 ≤ _x, y_ ≤ 10).

__Формат вывода__  
Выведите одно число – минимальное время в секундах, необходимое для получения _N_ копий.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

typedef long long ll;

bool canMakeCopies(ll N, ll x, ll y, ll T) {
    ll fast = min(x, y);
    
    // Если времени меньше, чем нужно для первой копии
    if (T < fast) {
        return false;
    }
    
    // Первая копия сделана за fast секунд
    ll remaining_time = T - fast;
    
    // Количество копий, сделанных за оставшееся время
    ll copies_from_x = remaining_time / x;
    ll copies_from_y = remaining_time / y;
    
    ll total_copies = 1 + copies_from_x + copies_from_y;
    
    return total_copies >= N;
}

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);
    
    ll N, x, y;
    cin >> N >> x >> y;
    
    ll fast = min(x, y);
    ll left = 0;
    ll right = fast * N; // Верхняя граница: используем только быстрый ксерокс
    ll answer = right;
    
    while (left <= right) {
        ll mid = left + (right - left) / 2;
        
        if (canMakeCopies(N, x, y, mid)) {
            answer = mid;
            right = mid - 1;
        } else {
            left = mid + 1;
        }
    }
    
    cout << answer << endl;
    
    return 0;
}
```
Время: 2ms. Память: 792Kb.
