### Площадь

Городская площадь имеет размер _n_ × _m_ и покрыта квадратной плиткой размером 1×1. При плановой замене плитки 
выяснилось, что новой плитки недостаточно для покрытия всей площади, поэтому было решено покрыть плиткой 
только дорожку по краю площади, а в центре площади разбить прямоугольную клумбу. При этом дорожка должна 
иметь одинаковую ширину по всем сторонам площади. Определите максимальную ширину дорожки, которую можно выложить из имеющихся плиток.

__Формат ввода__  
Первая и вторая строки входных данных содержат по одному числу _n_ и _m_ (3 ≤ _n_ ≤ 2× $10^9$, 3 ≤ _m_ ≤ 2× $10^9$) — размеры площади.

Третья строка содержит количество имеющихся плиток _t_, 1 ≤ _t_ < _nm_.

Обратите внимание, что значение _t_ может быть больше, чем возможное значение 32-битной 
целочисленной переменной, поэтому необходимо использовать 64-битные числа (тип int64 в языке Pascal, 
тип long long в C и C++, тип long в Java и C#).

__Формат вывода__ 
Программа должна вывести единственное число — максимальную ширину дорожки, которую можно выложить из имеющихся плиток.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

typedef long long ll;

// Функция вычисляет количество плиток, необходимых для дорожки ширины d
ll tilesNeeded(ll n, ll m, ll d) {
    // Если ширина дорожки слишком большая, клумба не поместится
    if (2 * d >= n || 2 * d >= m) {
        return 0LL; // Условное значение — на практике не должно достигаться при корректных границах поиска
    }
    return 2LL * d * (n + m - 2LL * d);
}

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    ll n, m, t;
    cin >> n >> m >> t;

    // Максимальная возможная ширина дорожки
    ll max_width = min((n - 1) / 2, (m - 1) / 2);
    ll left = 0;
    ll right = max_width;
    ll answer = 0;

    while (left <= right) {
        ll mid = left + (right - left) / 2;
        ll needed = tilesNeeded(n, m, mid);

        if (needed <= t) {
            answer = mid;
            left = mid + 1; // Пробуем увеличить ширину дорожки
        } else {
            right = mid - 1; // Уменьшаем ширину дорожки
        }
    }

    cout << answer << endl;

    return 0;
}
```
Время: 2ms. Память: 796Kb. 
