### Провода

Дано _N_ отрезков провода длиной $L_1$, $L_2$, ..., $L_N$ сантиметров. Требуется с помощью разрезания получить из них _K_ равных 
отрезков как можно большей длины, выражающейся целым числом сантиметров. Если нельзя получить _K_ отрезков длиной даже 1 см, вывести 0.

__Формат ввода__ 
В первой строке находятся числа _N_ и _К_. В следующих _N_ строках - $L_1$, $L_2$, ..., $L_N$ , по одному числу в строке.

Ограничения: 1 ≤ _N, K_ ≤ 10000, 100 ≤ $L_i$ ≤10000000, все числа целые.

__Формат вывода__ 
Вывести одно число - полученную длину отрезков.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

typedef long long ll;

// Функция проверяет, можно ли получить K отрезков длины L
bool canGetSegments(const vector<ll>& lengths, ll K, ll L) {
    if (L == 0) return false; // Избегаем деления на ноль

    ll total = 0;
    for (ll len : lengths) {
        total += len / L; // Количество отрезков длины L из провода длины len
    }
    return total >= K;
}

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int N, K;
    cin >> N >> K;

    vector<ll> lengths(N);
    ll max_length = 0;

    // Считываем длины проводов и находим максимальную
    for (int i = 0; i < N; ++i) {
        cin >> lengths[i];
        max_length = max(max_length, lengths[i]);
    }

    // Бинарный поиск по длине отрезка
    ll left = 1;
    ll right = max_length;
    ll answer = 0;

    while (left <= right) {
        ll mid = left + (right - left) / 2;

        if (canGetSegments(lengths, K, mid)) {
            answer = mid;      // Запоминаем текущую длину как потенциальный ответ
            left = mid + 1; // Пробуем увеличить длину отрезка
        } else {
            right = mid - 1; // Уменьшаем длину отрезка
        }
    }

    cout << answer << endl;

    return 0;
}
```
Время: 4ms. Память: 792Kb.
