### Субботник

В классе учатся _N_ человек. Классный руководитель получил указание направить на субботник _R_ бригад по _С_ человек в каждой.

Все бригады на субботнике будут заниматься переноской бревен. Каждое бревно одновременно несут все члены одной бригады. 
При этом бревно нести тем удобнее, чем менее различается рост членов этой бригады.

Числом неудобства бригады будем называть разность между ростом самого высокого и ростом самого низкого членов 
этой бригады (если в бригаде только один человек, то эта разница равна 0). Классный руководитель решил сформировать 
бригады так, чтобы максимальное из чисел неудобства сформированных бригад было минимально. Помогите ему в этом!

Рассмотрим следующий пример. Пусть в классе 8 человек, рост которых в сантиметрах равен 170, 205, 225, 190, 260, 130, 225, 160, 
и необходимо сформировать две бригады по три человека в каждой. Тогда одним из вариантов является такой:  
1 бригада: люди с ростом 225, 205, 225  
2 бригада: люди с ростом 160, 190, 170  

При этом число неудобства первой бригады будет равно 20, а число неудобства второй — 30. 
Максимальное из чисел неудобств будет 30, и это будет наилучший возможный результат.

__Формат ввода__  
Сначала вводятся натуральные числа _N, R_ и _C_ — количество человек в классе, количество бригад и количество человек 
в каждой бригаде (1 ≤ _R∙C_ ≤ _N_ ≤ 100 000). Далее вводятся _N_ целых чисел — рост каждого из _N_ учеников. Рост ученика — 
натуральное число, не превышающее 1 000 000 000.

__Формат вывода__  
Выведите одно число — наименьше возможное значение максимального числа неудобства сформированных бригад.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    int N, R, C;
    cin >> N >> R >> C;

    vector<long long> heights(N);
    for (int i = 0; i < N; ++i) {
        cin >> heights[i];
    }

    // Сортируем рост по возрастанию
    sort(heights.begin(), heights.end());

    // Бинарный поиск по ответу
    long long left = 0, right = heights[N - 1] - heights[0], answer = right;

    while (left <= right) {
        long long mid = left + (right - left) / 2;

        // Проверяем, можно ли сформировать R бригад с неудобством <= mid
        int formed_teams = 0;
        int i = 0;

        while (i <= N - C) {
            // Если разница между последним и первым в группе <= mid,
            // то можно сформировать бригаду
            if (heights[i + C - 1] - heights[i] <= mid) {
                formed_teams++;
                i += C; // переходим к следующей потенциальной бригаде
            } else {
                i++; // сдвигаем начало группы на одного человека
            }
        }

        if (formed_teams >= R) {
            answer = mid;
            right = mid - 1;
        } else {
            left = mid + 1;
        }
    }

    cout << answer << endl;
    return 0;
}
```
Время: 58ms. Память: 924Kb. 
