### Медиана объединения

Дано _N_ упорядоченных по неубыванию последовательностей целых чисел (т.е. каждый следующий элемент больше либо равен предыдущему), 
в каждой из последовательностей ровно _L_ элементов. Для каждых двух последовательностей выполняют следующую операцию: 
объединяют их элементы (в объединенной последовательности каждое число будет идти столько раз, сколько раз оно встречалось суммарно 
в объединяемых последовательностях), упорядочивают их по неубыванию и смотрят, какой элемент в этой последовательности из 
2L элементов окажется на месте номер _L_ (этот элемент называют левой медианой).

Напишите программу, которая для каждой пары последовательностей выведет левую медиану их объединения.

__Формат ввода__  
Сначала вводятся числа _N_ и _L_ (2 ≤ _N_ ≤ 100, 1 ≤ _L_ ≤ 300). В следующих _N_ строках задаются последовательности. 
Каждая последовательность состоит из _L_ чисел, по модулю не превышающих 30000.

__Формат вывода__  
В первой строке выведите медиану объединения 1-й и 2-й последовательностей, во второй строке — объединения 1-й и 3-й, 
и так далее, в (N‑1)-ой строке — объединения 1-й и N-ой последовательностей, далее медиану объединения 2-й и 3-й, 2-й и 4-й, 
и т.д. до 2-й и N-ой, затем 3-й и 4-й и так далее. В последней строке должна быть выведена медиана объединения (N–1)-й и N-ой 
последовательностей.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    int N, L;
    cin >> N >> L;

    // Читаем все последовательности
    vector<vector<int>> sequences(N, vector<int>(L));
    for (int i = 0; i < N; ++i) {
        for (int j = 0; j < L; ++j) {
            cin >> sequences[i][j];
        }
    }

    // Перебираем все пары (i, j), где i < j
    for (int i = 0; i < N; ++i) {
        for (int j = i + 1; j < N; ++j) {
            // Создаём объединённую последовательность
            vector<int> merged;
            merged.reserve(2 * L);

            // Копируем обе последовательности
            for (int x : sequences[i]) merged.push_back(x);
            for (int x : sequences[j]) merged.push_back(x);

            // Сортируем
            sort(merged.begin(), merged.end());

            // Выводим левую медиану (элемент на позиции L-1)
            cout << merged[L - 1] << endl;
        }
    }

    return 0;
}
```
Время: 120ms. Память: 688Kb. 
