### Медиана объединения-2

Дано _N_ упорядоченных по неубыванию последовательностей целых чисел (т.е. каждый следующий элемент больше либо равен предыдущему), 
в каждой из последовательностей ровно _L_ элементов. Для каждых двух последовательностей выполняют следующую операцию: 
объединяют их элементы (в объединенной последовательности каждое число будет идти столько раз, сколько раз оно встречалось 
суммарно в объединяемых последовательностях), упорядочивают их по неубыванию и смотрят, какой элемент в этой последовательности 
из 2 * _L_ элементов окажется на месте номер _L_ (этот элемент называют левой медианой).

Напишите программу, которая для каждой пары последовательностей выведет левую медиану их объединения.

__Формат ввода__  
Сначала вводятся числа _N_ и _L_ (2 ≤ _N_ ≤ 200, 1 ≤ _L_ ≤ 50000). В следующих _N_ строках задаются параметры, определяющие 
последовательности.

Каждая последовательность определяется пятью целочисленными параметрами: $x_1$, $d_1$, _a, c, m_. Элементы последовательности 
вычисляются по следующим формулам: $x_1$ нам задано, а для всех _i_ от 2 до _L_: $x_1$ = $x_{i-1}$ + $d_{i-1}$. 
Последовательность $d_i$ определяется следующим образом: $d_1$ нам задано, а для _i_ ≥ 2 $d_i$ = ((a * $d_{i-1}$ + c) mod m), где 
mod – операция получения остатка от деления (a * $d_{i-1}$ + c) на m.

Для всех последовательностей выполнены следующие ограничения: 1 ≤ _m_ ≤ 40000, 0 ≤ _a_ < _m_, 0 ≤ _c_ < _m_, 0 ≤ $d_1$ < _m_. 
Гарантируется, что все члены всех последовательностей по модулю не превышают $10^9$.

__Формат вывода__  
В первой строке выведите медиану объединения 1-й и 2-й последовательностей, во второй строке — 
объединения 1-й и 3-й, и так далее, в (N‑1)-ой строке — объединения 1-й и _N_-ой последовательностей, далее медиану 
объединения 2-й и 3-й, 2-й и 4-й, и т.д. до 2-й и _N_-ой, затем 3-й и 4-й и так далее. В последней строке должна 
быть выведена медиана объединения (N–1)-й и _N_-ой последовательностей.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

// Генерация последовательности по заданным параметрам
vector<long long> generate_sequence(long long x1, long long d1, long long a, long long c, long long m, int L) {
    vector<long long> seq;
    seq.push_back(x1);
    long long current_d = d1;

    for (int i = 1; i < L; ++i) {
        x1 = x1 + current_d;
        seq.push_back(x1);
        current_d = (a * current_d + c) % m;
    }

    return seq;
}

// Подсчёт количества элементов <= x в отсортированной последовательности
int count_leq(const vector<long long>& seq, long long x) {
    return upper_bound(seq.begin(), seq.end(), x) - seq.begin();
}

// Поиск левой медианы объединения двух отсортированных последовательностей
long long find_left_median(const vector<long long>& seq1, const vector<long long>& seq2, int L) {
    long long low = min(seq1[0], seq2[0]);
    long long high = max(seq1[L - 1], seq2[L - 1]);

    while (low < high) {
        long long mid = low + (high - low) / 2;
        // Количество элементов <= mid в обеих последовательностях
        int count = count_leq(seq1, mid) + count_leq(seq2, mid);

        if (count < L) {
            low = mid + 1;
        } else {
            high = mid;
        }
    }

    return low;
}

int main() {
    int N, L;
    cin >> N >> L;

    vector<vector<long long>> sequences;

    // Генерация всех последовательностей
    for (int i = 0; i < N; ++i) {
        long long x1, d1, a, c, m;
        cin >> x1 >> d1 >> a >> c >> m;
        sequences.push_back(generate_sequence(x1, d1, a, c, m, L));
    }

    // Перебор всех пар (i, j), где i < j
    for (int i = 0; i < N; ++i) {
        for (int j = i + 1; j < N; ++j) {
            cout << find_left_median(sequences[i], sequences[j], L) << endl;
        }
    }

    return 0;
}
```
Время: 373ms. Память: 76.9Mb. 
