### Наблюдение за студентами

На первом курсе одной Школы, учится 1 ≤ _N_ ≤ $10^9$ студентов. При проведении экзаменов студентов рассаживают в ряд, 
каждого за своей партой. Парты пронумерованы числами от 0 до _N_ −1.

Известно, что студент, оставшись без наблюдения, открывает телефон и начинает искать ответы на экзамен в поисковике Яндекса.

Поэтому было решено позвать _M_ преподавателей наблюдать за студентами. Когда за студентом наблюдает хотя бы один преподаватель, 
он стесняется и не идет искать ответы к экзамену. Преподаватель с номером _i_ видит студентов сидящих за партами от $b_i$ до $e_i$ включительно.

Необходимо посчитать количество студентов, которые все таки будут искать ответы к экзамену в Яндексе

__Формат ввода__  
В первой строке находятся два целых числа 1 ≤ _N_ ≤ $10^9$, 1 ≤ _M_ ≤ $10^4$ — число студентов и число преподавателей соответственно. 
В следующих _M_ строках содержится по два целых числа 0 ≤ $b_i$ ≤ $e_i$ ≤ _N_ −1 — парты, за которыми наблюдает _i_-й преподаватель.

__Формат вывода__  
Выведите одно число — количество студентов оставшихся без наблюдения.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    long long N;
    int M;
    cin >> N >> M;

    vector<pair<long long, long long>> ranges(M);

    // Считываем диапазоны наблюдения преподавателей
    for (int i = 0; i < M; ++i) {
        cin >> ranges[i].first >> ranges[i].second;
    }

    // Сортируем диапазоны по начальной точке
    sort(ranges.begin(), ranges.end());

    // Объединяем пересекающиеся диапазоны
    vector<pair<long long, long long>> merged;
    if (!ranges.empty()) {
        merged.push_back(ranges[0]);

        for (int i = 1; i < M; ++i) {
            auto& last = merged.back();
            auto& current = ranges[i];

            // Если текущий диапазон пересекается с последним объединённым
            if (current.first <= last.second + 1) {
                // Объединяем: расширяем конец последнего диапазона при необходимости
                last.second = max(last.second, current.second);
            } else {
                // Диапазоны не пересекаются — добавляем новый
                merged.push_back(current);
            }
        }
    }

    // Считаем общее количество наблюдаемых парт
    long long observed = 0;
    for (const auto& range : merged) {
        observed += range.second - range.first + 1;
    }

    // Количество студентов без наблюдения
    long long unobserved = N - observed;

    cout << unobserved << endl;

    return 0;
}
```
Время: 9ms. Память: 668Kb.
