### Точки и отрезки

Дано _n_ отрезков на числовой прямой и _m_ точек на этой же прямой. Для каждой из данных точек определите, 
скольким отрезкам они принадлежат. Точка _x_ считается принадлежащей отрезку с концами _a_ и _b_, если выполняется двойное 
неравенство _min(a, b)_ ≤ _x_ ≤ _max(a, b)_.

__Формат ввода__  
Первая строка содержит два целых числа _n_ (1 ≤ _n_ ≤ $10^5$ ) – число отрезков и _m_ (1 ≤ m ≤ $10^5$) – число точек. 
В следующих _n_ строках по два целых числа $a_i$ и $b_i$ – координаты концов соответствующего отрезка. 
В последней строке _m_ целых чисел – координаты точек. Все числа по модулю не превосходят $10^9$

__Формат вывода__  
В выходной файл выведите m чисел – для каждой точки количество отрезков, в которых она содержится.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

// Структура для хранения событий
struct Event {
    long long x;      // координата
    int type;         // тип события: +1 — начало отрезка, -1 — конец отрезка, 0 — точка запроса
    int index;        // индекс точки (для запросов)
};

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int n, m;
    cin >> n >> m;

    vector<Event> events;

    // Считываем отрезки и добавляем события начала и конца
    for (int i = 0; i < n; ++i) {
        long long a, b;
        cin >> a >> b;
        // Гарантируем, что a <= b
        if (a > b) swap(a, b);
        events.push_back({a, +1, -1});  // начало отрезка
        events.push_back({b, -1, -1}); // конец отрезка
    }

    // Считываем точки и добавляем события запросов
    vector<int> points(m);
    for (int i = 0; i < m; ++i) {
        cin >> points[i];
        events.push_back({points[i], 0, i}); // точка запроса с индексом i
    }

    // Сортируем события:
    // 1. По координате x
    // 2. При равной координате: +1 (начало) → 0 (точка) → -1 (конец)
    sort(events.begin(), events.end(), [](const Event& e1, const Event& e2) {
        if (e1.x != e2.x) {
            return e1.x < e2.x;
        }
        return e1.type > e2.type; // +1 > 0 > -1
    });

    vector<int> answer(m, 0);
    int active_segments = 0; // счётчик активных отрезков

    // Обрабатываем все события по порядку
    for (const auto& event : events) {
        if (event.type == +1) {
            // Начало отрезка — увеличиваем счётчик
            active_segments++;
        } else if (event.type == -1) {
            // Конец отрезка — уменьшаем счётчик
            active_segments--;
        } else {
            // Точка запроса — запоминаем текущий счётчик
            answer[event.index] = active_segments;
        }
    }

    // Выводим ответы для всех точек
    for (int count : answer) {
        cout << count << " ";
    }
    cout << endl;

    return 0;
}
```
Время: 86ms. Память: 6.86Mb.
