### Рассадка в аудитории

Экзамен по берляндскому языку проходит в узкой и длинной аудитории. На экзамен пришло _N_ студентов. 
Все они посажены в ряд. Таким образом, позиция каждого человека задается координатой на оси _Ox_ 
(эта ось ведет вдоль длинной аудитории). Два человека могут разговаривать, если расстояние между ними меньше или 
равно D. Какое наименьшее количество типов билетов должен подготовить преподаватель, чтобы никакие два студента 
с одинаковыми билетами не могли разговаривать? Выведите способ раздачи преподавателем билетов.

__Формат ввода__  
В первой строке входного файла содержится два целых числа _N, D_ (1 ≤ _N_ ≤ 10000; 0 ≤ _D_ ≤ $10^6$ ). Вторая строка 
содержит последовательность различных целых чисел $X_1$, $X_2$, ..., $X_N$, где $X_i$ (0 ≤ $X_i$ ≤ $10^6$ ) обозначает координату 
вдоль оси _Ox_ _i_-го студента

__Формат вывода__  
В первую строчку выходного файла выведите количество вариантов, а во вторую, разделяя пробелами, номера 
вариантов студентов в том порядке, в каком они перечислены во входном файле.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int N, D;
    cin >> N >> D;

    vector<pair<int, int>> students(N); // (координата, исходный индекс)
    for (int i = 0; i < N; ++i) {
        cin >> students[i].first;
        students[i].second = i;
    }

    // Сортируем по координате
    sort(students.begin(), students.end());

    vector<int> tickets(N);
    vector<bool> used(N + 1, false); // used[ticket] = true, если билет занят в текущем окне
    int max_ticket = 0;

    // Указатели для скользящего окна
    int left = 0; // левая граница окна

    for (int right = 0; right < N; ++right) {
        int current_x = students[right].first;

        // Удаляем студентов, которые вышли за радиус D
        while (left < right && current_x - students[left].first > D) {
            // Освобождаем билет удалённого студента
            used[tickets[left]] = false;
            left++;
        }

        // Отмечаем все билеты в текущем окне как занятые
        fill(used.begin(), used.end(), false);
        for (int j = left; j < right; ++j) {
            used[tickets[j]] = true;
        }

        // Находим минимальный свободный билет
        int ticket = 1;
        while (used[ticket]) {
            ticket++;
        }
        tickets[right] = ticket;
        max_ticket = max(max_ticket, ticket);
    }

    // Восстанавливаем порядок билетов по исходным индексам
    vector<int> result(N);
    for (int i = 0; i < N; ++i) {
        result[students[i].second] = tickets[i];
    }

    // Вывод результата
    cout << max_ticket << endl;
    for (int i = 0; i < N; ++i) {
        cout << result[i] << " ";
    }
    cout << endl;

    return 0;
}
```
Время: 213ms. Память: 944Kb. 
