### Кассы

На одном из московских вокзалов билеты продают _N_ касс. Каждая касса работает без перерыва определенный промежуток времени 
по фиксированному расписанию (одному и тому же каждый день). Требуется определить, на протяжении какого времени 
в течение суток работают все кассы одновременно.

__Формат ввода__  
Сначала вводится одно целое число _N_ (0 < _N_ ≤ 1000).

В каждой из следующих _N_ строк через пробел расположены 4 целых числа, первые два из которых обозначают 
время открытия кассы в часах и минутах (часы — целое число от 0 до 23, минуты — целое число от 0 до 59), 
оставшиеся два — время закрытия в том же формате. Числа разделены пробелами.

Время открытия означает, что в соответствующую ему минуту касса уже работает, а время закрытия — что 
в соответствующую минуту касса уже не работает. Например, касса, открытая с 10 ч. 30 мин. до 18 ч. 30 мин., 
ежесуточно работает 480 минут.

Если время открытия совпадает с временем закрытия, то касса работает круглосуточно. Если первое время больше второго, 
то касса начинает работу до полуночи, а заканчивает — на следующий день.

__Формат вывода__  
Требуется вывести одно число — суммарное время за сутки (в минутах), на протяжении которого работают все _N_ касс.
```cpp
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int N;
    cin >> N;

    // Массив для подсчёта количества работающих касс в каждую минуту (0–1439)
    vector<int> workMinutes(1440, 0);

    for (int i = 0; i < N; ++i) {
        int openH, openM, closeH, closeM;
        cin >> openH >> openM >> closeH >> closeM;

        // Преобразуем часы и минуты в минуты от начала суток
        int openTime = openH * 60 + openM;
        int closeTime = closeH * 60 + closeM;

        // Случай 1: касса работает круглосуточно
        if (openTime == closeTime) {
            // Все минуты суток отмечаем как работающие
            for (int j = 0; j < 1440; ++j) {
                workMinutes[j]++;
            }
            continue;
        }

        // Случай 2: интервал пересекает полночь (openTime > closeTime)
        if (openTime > closeTime) {
            // Отмечаем интервал до полуночи
            for (int j = openTime; j < 1440; ++j) {
                workMinutes[j]++;
            }
            // Отмечаем интервал после полуночи
            for (int j = 0; j < closeTime; ++j) {
                workMinutes[j]++;
            }
        } else {
            // Случай 3: обычный интервал в пределах одних суток
            for (int j = openTime; j < closeTime; ++j) {
                workMinutes[j]++;
            }
        }
    }

    // Подсчёт минут, когда работают все кассы одновременно
    int totalTime = 0;
    for (int i = 0; i < 1440; ++i) {
        if (workMinutes[i] == N) {
            totalTime++;
        }
    }

    cout << totalTime << endl;
    return 0;
}
```
Время: 3ms. Память: 796Kb. 
