### Высота дерева

Реализуйте бинарное дерево поиска для целых чисел. Программа получает на вход последовательность целых чисел и строит 
из них дерево. Элементы в деревья добавляются в соответствии с результатом поиска их места. 
Если элемент уже существует в дереве, добавлять его не надо. Балансировка дерева не производится.

__Формат ввода__  
На вход программа получает последовательность натуральных чисел. Последовательность завершается числом 0, 
которое означает конец ввода, и добавлять его в дерево не надо.

__Формат вывода__  
Выведите единственное число – высоту получившегося дерева.

```cpp
#include <iostream>
#include <sstream>
#include <string>
#include <vector>

using namespace std;

// Узел бинарного дерева
struct TreeNode {
    int value;
    TreeNode* left;
    TreeNode* right;
    
    TreeNode(int val) : value(val), left(nullptr), right(nullptr) {}
};

// Класс бинарного дерева поиска
class BinarySearchTree {
private:
    TreeNode* root;
    
    // Рекурсивная вставка
    void insertRecursive(TreeNode*& node, int value) {
        if (node == nullptr) {
            node = new TreeNode(value);
        } else if (value < node->value) {
            insertRecursive(node->left, value);
        } else if (value > node->value) {
            insertRecursive(node->right, value);
        }
        // Дубликаты игнорируются (value == node->value)
    }
    
    // Рекурсивный расчёт высоты
    int heightRecursive(TreeNode* node) {
        if (node == nullptr) {
            return 0;
        }
        int leftHeight = heightRecursive(node->left);
        int rightHeight = heightRecursive(node->right);
        return max(leftHeight, rightHeight) + 1;
    }
    
    // Освобождение памяти (деструктор)
    void deleteTree(TreeNode* node) {
        if (node != nullptr) {
            deleteTree(node->left);
            deleteTree(node->right);
            delete node;
        }
    }

public:
    BinarySearchTree() : root(nullptr) {}
    
    ~BinarySearchTree() {
        deleteTree(root);
    }
    
    // Вставка элемента в дерево
    void insert(int value) {
        insertRecursive(root, value);
    }
    
    // Получение высоты дерева
    int getHeight() {
        return heightRecursive(root);
    }
};

int main() {
    string inputLine;
    getline(cin, inputLine);  // Считываем всю строку
    
    stringstream ss(inputLine);
    int number;
    BinarySearchTree bst;
    
    // Считываем числа из строки до 0
    while (ss >> number) {
        if (number == 0) {
            break;  // 0 означает конец ввода, не добавляем в дерево
        }
        bst.insert(number);
    }
    
    // Выводим высоту дерева
    cout << bst.getHeight() << endl;
    
    return 0;
}
```
Время: 50ms. Память: 2.99Mb.
