### Сложное уравнение

Решить в целых числах уравнение (a * x + b) / (c * x + d) = 0

__Формат ввода__  
Вводятся 4 числа: _a_, _b_, _c_ и _d_; _c_ и _d_ не равны нулю одновременно.

__Формат вывода__  
Необходимо вывести все целочисленные решения, если их число конечно, __NO__, если целочисленных решений нет, и __INF__, если их бесконечно много.

```cpp
#include <iostream>
using namespace std;

int main() {
	int a, b, c, d, x;
	cin >> a >> b >> c >> d;
	if (a == 0 && b == 0) cout << "INF";
	else if (a == 0 || b * c == a * d) cout << "NO";
	else if (b % a == 0) {
	    x = -b / a;
	    cout << x;
	}
	else cout << "NO";
	return 0;
}
```
Время: 2ms. Память: 796Kb.
