### A. Interactor

Лена руководит разработкой тестирующей системы, в которой реализованы интерактивные задачи.

До заверщения очередной стадии проекта осталось написать модуль, определяющий итоговый вердикт системы для интерактивной задачи. 
Итоговый вердикт определяется из кода завершения задачи, вердикта интерактора и вердикта чекера по следующим правилам:

Вердикт чекера и вердикт интерактора — это целые числа от 0 до 7 включительно.
Код завершения задачи — это целое число от -128 до 127 включительно.
Если интерактор выдал вердикт 0, итоговый вердикт равен 3 в случае, если программа завершилась с ненулевым кодом, и вердикту чекера в противном случае.
Если интерактор выдал вердикт 1, итоговый вердикт равен вердикту чекера.
Если интерактор выдал вердикт 4, итоговый вердикт равен 3 в случае, если программа завершилась с ненулевым кодом, и 4 в противном случае.
Если интерактор выдал вердикт 6, итоговый вердикт равен 0.
Если интерактор выдал вердикт 7, итоговый вердикт равен 1.
В остальных случаях итоговый вердикт равен вердикту интерактора.
Ваша задача — реализовать этот модуль.

__Формат ввода__  
Входной файл состоит из трёх строк. В первой задано целое число r (−128 ≤ r ≤ 127) — код завершения задачи, во второй — целое число i (0 ≤ i ≤ 7)
— вердикт интерактора, в третьей — целое число c (0 ≤ c ≤ 7) — вердикт чекера.

__Формат вывода__ 
Выведите одно целое число от 0 до 7 включительно — итоговый вердикт системы.

```cpp
#include <iostream>
using namespace std;

int main() {
	int endt, inter, ch;
	cin >> endt >> inter >> ch;
	
	if (inter == 0){
	    if (endt != 0) cout << 3;	
	    else cout << ch;
	} else if (inter == 1) cout << ch;
	else if (inter == 4) {
	    if (endt != 0) cout << 3;
	    else cout << 4;
	} else if (inter == 6) cout << 0;
	else if (inter == 7) cout << 1;
	else cout << inter;
	return 0;
}
```
Время: 2ms. Память: 764Mb.
