### C. Даты

Как известно, два наиболее распространённых формата записи даты — это европейский (сначала день, потом месяц, потом год) 
и американски (сначала месяц, потом день, потом год). Системный администратор поменял дату на одном из бэкапов и сейчас хочет вернуть дату обратно. 
Но он не проверил, в каком формате дата используется в системе. Может ли он обойтись без этой информации?

Иначе говоря, вам даётся запись некоторой корректной даты. Требуется выяснить, однозначно ли по этой записи определяется дата даже без дополнительной информации о формате.

__Формат ввода__  
Первая строка входных данных содержит три целых числа — _x_, _y_ и _z_: 1 ≤ _x_ ≤ 31, 1 ≤ _y_ ≤ 31, 1970 ≤ _z_ ≤ 2069. Гарантируется, что хотя бы в одном формате запись _x_ _y_ _z_ задаёт корректную дату.

__Формат вывода__  
Выведите 1, если дата определяется однозначно, и 0 в противном случае.

__Примечания__  
В первом примере при одной системе записи дата равна 1 февраля, при другой — 2 января 2003 года, то есть однозначно назвать дату не получается.

Во втором примере корректный вариант даты может быть только в американском формате, где она задаёт 29 февраля 2008 года.

```cpp
#include <iostream>
using namespace std;

int main() {
	int a, b, c;
	cin >> a >> b >> c;
	if (a == b) cout << 1;
	else if (b <= 12 && a <= 12) cout << 0;
	else cout << 1;
	return 0;
}
```
Время: 2ms. Память: 796Kb.
