### A. Бинарное дерево (вставка, поиск, обход)

Напишите программу, которая будет реализовывать действия в бинарном дереве поиска «вставить» 
и «найти» (по значению). Программа должна обрабатывать запросы трёх видов:
ADD n — если указанного числа еще нет в дереве, вставлять его и выводить слово «DONE», если уже есть — оставлять дерево как было и выводить слово «ALREADY».
SEARCH — следует выводить слово «YES» (если значение найдено в дереве) или слово «NO» (если не найдено). Дерево при этом не меняется.
PRINTTREE — выводить всё дерево, обязательно используя алгоритм, указанный в формате вывода результатов.

__Формат ввода__  
В каждой строке входных данных записан один из запросов ADD n или SEARCH n или PRINTTREE. Гарантируется, что запросы PRINTTREE будут вызываться только в моменты, когда дерево не пустое. Общее количество запросов не превышает 1000, из них не более 20 запросов PRINTTREE.

__Формат вывода__  
Для каждого запроса выводите ответ на него. Для запросов ADD и SEARCH — соответствующее слово в отдельной строке. На запрос PRINTTREE надо выводить дерево, обязательно согласно такому алгоритму:
1) Распечатать левое поддерево.
2) Вывести количество точек, равное глубине узла.
3) Вывести значение ключа.
4) Распечатать правое поддерево.

```cpp
#include <iostream>
#include <string>

using namespace std;

struct Node {
    int value;
    Node* left;
    Node* right;
    
    Node(int val) : value(val), left(nullptr), right(nullptr) {}
};

class BST {
private:
    Node* root;
    
    //функция вставки узла
    bool insert(Node*& node, int value) {
        if (node == nullptr) {
            node = new Node(value);
            return true;
        }
        if (value == node->value) {
            return false;
        }
        if (value < node->value){
            return insert(node->left, value);
        } else {
            return insert(node->right, value);
        }
    }
    
    //функция поиска узлов
    bool search(Node* node, int value) const {
        if (node == nullptr) {
            return false;
        }
        if (value == node->value) {
            return true;
        }
        if (value < node->value) {
            return search(node->left, value);
        } else {
            return search(node->right, value);
        }
    }
    
    //функция вывода дерева
    void printTree(Node* node, int depth) const {
        if (node == nullptr){
            return;
        }
        
        printTree(node->left, depth + 1);
        
        for(int i = 0; i < depth; ++i){
            cout << ".";
        }
        
        cout << node->value << endl;
        
        printTree(node->right, depth + 1);
    }

public:
    BST() : root(nullptr) {}
    
    //метод для вставки
    void add(int value) {
        if (insert(root, value)) {
            cout << "DONE" << endl;
        } else {
            cout << "ALREADY" << endl;
        }
    }
    
    void search(int value) {
        if (search(root, value)){
            cout << "YES" << endl;
        } else {
            cout << "NO" << endl;
        }
    }
    
    void printTree() const {
        printTree(root, 0);
    }
};

int main() {
    BST tree;
    string command;
    
    while (cin >> command) {
        if (command == "ADD"){
            int value;
            cin >> value;
            tree.add(value);
        } else if (command == "SEARCH") {
            int value;
            cin >> value;
            tree.search(value);
        } else if (command == "PRINTTREE"){
            tree.printTree();
        }
    }
    return 0;
}
```

Время: 9ms. Память: 788Kb.
