### B. Родословная: предки и потомки

В генеалогическом древе у каждого человека, кроме родоначальника, есть ровно один родитель.
Каждом элементу дерева сопоставляется целое неотрицательное число, называемое высотой. У родоначальника высота равна 0, у любого другого элемента высота на 1 больше, чем у его родителя.
Даны два элемента в дереве. Определите, является ли один из них потомком другого.

__Формат ввода__  
Программа получает на вход число элементов в генеалогическом древе _N_. Далее следует _N−1_ строка, задающие родителя для каждого элемента древа, кроме родоначальника. Каждая строка имеет вид имя_потомка имя_родителя.
Далее до конца файла идут строки, содержащие имена двух элементов дерева.

__Формат вывода__
Для каждого такого запроса выведите одно из трех чисел: 1, если первый элемент является предком второго, 2, если второй является предком первого или 0, если ни один из них не является предком другого.

```cpp
#include <iostream>
#include <string>
#include <unordered_map>
#include <unordered_set>
#include <vector>

using namespace std;

// Функция для вычисления высоты человека в дереве
int get_height(const string& person,
                  const unordered_map<string, string>& parent_of,
                  const string& ancestor,
                  unordered_map<string, int>& heights) {
    if (person == ancestor) {
        return 0;
    }
    auto it = heights.find(person);
    if (it != heights.end()) {
        return it->second;
    }
    heights[person] = get_height(parent_of.at(person), parent_of, ancestor, heights) + 1;
    return heights[person];
}

// Функция проверки, является ли ancestor_candidate предком descendant
bool is_ancestor(const string& ancestor_candidate,
                 const string& descendant,
                 const unordered_map<string, string>& parent_of) {
    string current = descendant;
    while (parent_of.find(current) != parent_of.end()) {
        current = parent_of.at(current);
        if (current == ancestor_candidate) {
            return true;
        }
    }
    return false;
}

int main() {
    int n;
    cin >> n;

    // Словарь: потомок -> родитель
    unordered_map<string, string> parent_of;
    // Множество всех людей
    unordered_set<string> all_people;
    // Множество потомков (тех, у кого есть родитель)
    unordered_set<string> children;

    // Читаем N-1 строку с отношениями потомок-родитель
    for (int i = 0; i < n - 1; ++i) {
        string child, parent;
        cin >> child >> parent;
        parent_of[child] = parent;
        all_people.insert(child);
        all_people.insert(parent);
        children.insert(child);
    }

    // Находим родоначальника: это тот, кто не является потомком ни у кого
    string ancestor;
    for (const auto& person : all_people) {
        if (children.find(person) == children.end()) {
            ancestor = person;
            break;
        }
    }

    // Вычисляем высоты для всех элементов
    unordered_map<string, int> heights;
    for (const auto& person : all_people) {
        get_height(person, parent_of, ancestor, heights);
    }

    // Обрабатываем запросы
    vector<int> results;
    string person1, person2;

    while (cin >> person1 >> person2) {
        // Проверяем, является ли person1 предком person2
        if (is_ancestor(person1, person2, parent_of)) {
            results.push_back(1);
        }
        // Проверяем, является ли person2 предком person1
        else if (is_ancestor(person2, person1, parent_of)) {
            results.push_back(2);
        } else {
            results.push_back(0);
        }
    }

    // Выводим результаты в одну строку через пробел
    for (size_t i = 0; i < results.size(); ++i) {
        cout << results[i];
        if (i < results.size() - 1) {
            cout << " ";
        }
    }
    cout << endl;

    return 0;
}
```
Время: 318ms. Память: 43,83Mb.
