### Параллелограм

На уроке геометрии семиклассники Вася и Петя узнали, что такое параллелограмм. 
На перемене после урока они стали играть в игру: Петя называл координаты четырех 
точек в произвольном порядке, а Вася должен был ответить, являются ли эти точки вершинами параллелограмма. Вася, если честно, не очень понял тему про параллелограммы, и ему требуется программа, умеющая правильно отвечать на Петины вопросы. 
Напомним, что параллелограммом называется четырехугольник, противоположные стороны которого равны и параллельны.

__Формат ввода__  
В первой строке входного файла записано целое число _N_ (1 ≤ N ≤ 10) - количество заданных Петей вопросов. 
Каждая из N последующих строк содержит описание четырех точек - четыре пары целых чисел _X_ и _Y_ (−100 ≤ X ≤ 100, −100 ≤ Y ≤ 100), 
обозначающих координаты точки. Гарантируется, что четыре точки, о которых идет речь в одном вопросе, не лежат на одной прямой.

__Формат вывода__  
Для каждого из вопросов выведите __YES__, если четыре заданные точки могут образовать параллелограмм, и __NO__ в противном случае. 
Ответ на каждый из запросов должен быть в отдельной строке без кавычек.

```cpp
#include <iostream>
#include <vector>
using namespace std;

struct Point {
    int x, y;
};

// Функция проверки, совпадают ли середины двух отрезков
bool checkMidpoints(const Point& p1, const Point& p2, const Point& p3, const Point& p4) {
    // Умножаем на 2, чтобы избежать работы с дробными числами
    return (p1.x + p2.x == p3.x + p4.x) && (p1.y + p2.y == p3.y + p4.y);
}

// Проверка, образуют ли 4 точки параллелограмм
bool isParallelogram(const vector<Point>& points) {
    // Проверяем три возможных варианта соединения точек в диагонали
    // Вариант 1: диагонали AC и BD
    if (checkMidpoints(points[0], points[2], points[1], points[3])) {
        return true;
    }
    // Вариант 2: диагонали AD и BC
    if (checkMidpoints(points[0], points[3], points[1], points[2])) {
        return true;
    }
    // Вариант 3: диагонали AB и CD
    if (checkMidpoints(points[0], points[1], points[2], points[3])) {
        return true;
    }
    return false;
}

int main() {
    int n;
    cin >> n;

    while (n--) {
        vector<Point> points(4);
        // Считываем координаты 4 точек
        for (int i = 0; i < 4; ++i) {
            cin >> points[i].x >> points[i].y;
        }

        if (isParallelogram(points)) {
            cout << "YES\n";
        } else {
            cout << "NO\n";
        }
    }

    return 0;
}
```
Время: 2ms. Память: 796Kb.
