### Проверьте правильность ситуации

Напишите программу, которая по изображению поля для игры в «Крестики-нолики» определит, 
могла ли такая ситуация возникнуть в результате игры с соблюдением всех правил. Напомним, что игра в «Крестики-нолики» 
ведется на поле 3*3. Два игрока ходят по очереди. Первый ставит крестик, а второй – нолик. 
Ставить крестик и нолик разрешается в любую еще не занятую клетку поля. Когда один из игроков 
поставит три своих знака в одной горизонтали, вертикали или диагонали, или когда все клетки поля окажутся заняты, игра заканчивается.

__Формат ввода__   
Вводится три строки по три числа в каждой, описывающих игровое поле. Число __0__ обозначает пустую клетку, 
__1__ – крестик, __2__ – нолик. Числа в строке разделяются пробелами.

__Формат вывода__  
Требуется вывести слово __YES__, если указанная ситуация могла возникнуть в ходе игры, и __NO__ в противном случае.

```cpp
#include <iostream>
#include <vector>
using namespace std;

// Функция проверяет, выиграл ли игрок с заданным символом (1 — крестики, 2 — нолики)
bool checkWin(const vector<vector<int>>& board, int player) {
    // Проверяем строки
    for (int i = 0; i < 3; ++i) {
        if (board[i][0] == player && board[i][1] == player && board[i][2] == player) {
            return true;
        }
    }
    // Проверяем столбцы
    for (int j = 0; j < 3; ++j) {
        if (board[0][j] == player && board[1][j] == player && board[2][j] == player) {
            return true;
        }
    }
    // Проверяем диагонали
    if (board[0][0] == player && board[1][1] == player && board[2][2] == player) {
        return true;
    }
    if (board[0][2] == player && board[1][1] == player && board[2][0] == player) {
        return true;
    }
    return false;
}

int main() {
    vector<vector<int>> board(3, vector<int>(3));
    
    // Считываем поле
    for (int i = 0; i < 3; ++i) {
        for (int j = 0; j < 3; ++j) {
            cin >> board[i][j];
        }
    }

    // Подсчитываем количество крестиков и ноликов
    int countX = 0, countO = 0;
    for (int i = 0; i < 3; ++i) {
        for (int j = 0; j < 3; ++j) {
            if (board[i][j] == 1) countX++;
            else if (board[i][j] == 2) countO++;
        }
    }

    // Правило 1: крестиков должно быть столько же, сколько ноликов, или на 1 больше
    if (!(countX == countO || countX == countO + 1)) {
        cout << "NO\n";
        return 0;
    }

    bool xWins = checkWin(board, 1);
    bool oWins = checkWin(board, 2);

    // Правило 2: не могут выиграть оба
    if (xWins && oWins) {
        cout << "NO\n";
        return 0;
    }

    // Правило 3: если выиграл X, то крестиков на 1 больше, чем ноликов
    if (xWins && countX != countO + 1) {
        cout << "NO\n";
        return 0;
    }

    // Правило 4: если выиграл O, то количество крестиков равно количеству ноликов
    if (oWins && countX != countO) {
        cout << "NO\n";
        return 0;
    }

    cout << "YES\n";
    return 0;
}
```
Время: 2ms. Память: 668Kb.
