### Another Pair of Triangles
Среди треугольников периметра _P_ с __целыми__ длинами сторон найдите треугольник наибольшей и наименьшей ненулевой площади.

__Формат ввода__  
Входные данные содержат одно целое число _P_ — периметр треугольника (3 ≤ P ≤ 10).

__Формат вывода__  
В первой строке выведите три целых числа — длины сторон треугольника с 
заданным периметром и наибольшей площадью. Во второй сторке выведите 
три целых числа — длины сторон треугольника с заданным периметром и наименьшей ненулевой площадью. 
Если решений несколько, выведите любое. Если целочисленных треугольников заданного периметра не существует, выведите __-1__.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

bool is_triangle(long long a, long long b, long long c) {
    return (a + b > c) && (a + c > b) && (b + c > a) &&
           (a > 0) && (b > 0) && (c > 0);
}

int main() {
    long long P;
    cin >> P;

    // Проверка минимального периметра
    if (P < 3) {
        cout << -1 << endl;
        return 0;
    }

    // Поиск треугольника максимальной площади (максимально близкий к равностороннему)
    long long base = P / 3;
    long long rem = P % 3;
    long long a_max, b_max, c_max;

    if (rem == 0) {
        a_max = b_max = c_max = base;
    } else if (rem == 1) {
        a_max = base;
        b_max = base;
        c_max = base + 1;
    } else { // rem == 2
        a_max = base;
        b_max = base + 1;
        c_max = base + 1;
    }

    // Поиск треугольника минимальной площади (максимально вытянутый)
    long long a_min = -1, b_min = -1, c_min = -1;

    // Начинаем с минимально возможной первой стороны
    for (long long a = 1; a <= P / 3; ++a) {
        // Максимально возможная третья сторона при данном a
        long long c = (P - a) / 2;
        long long b = P - a - c;

        // Сортируем стороны для проверки неравенства треугольника
        long long sides[3] = {a, b, c};
        sort(sides, sides + 3);

        if (is_triangle(sides[0], sides[1], sides[2])) {
            a_min = sides[0];
            b_min = sides[1];
            c_min = sides[2];
            break;
        }
    }

    // Финальная проверка: существуют ли такие треугольники
    if (!is_triangle(a_max, b_max, c_max) || a_min == -1) {
        cout << -1 << endl;
    } else {
        // Сортируем стороны максимальной площади
        long long max_sides[3] = {a_max, b_max, c_max};
        sort(max_sides, max_sides + 3);

        cout << max_sides[0] << " " << max_sides[1] << " " << max_sides[2] << endl;
        cout << a_min << " " << b_min << " " << c_min << endl;
    }

    return 0;
}
```
Время: 2ms. Память: 796Kb.
