### Кольцевая линия метро

Витя работает недалеко от одной из станций кольцевой линии Московского метро, 
а живет рядом с другой станцией той же линии. Требуется выяснить, мимо какого наименьшего 
количества промежуточных станций необходимо проехать Вите по кольцу, чтобы добраться с работы домой.

__Формат ввода__  
Станции пронумерованы подряд натуральными числами 1, 2, 3, …, _N_ (1-я станция – соседняя с _N-й_), _N_ не превосходит 100.

Вводятся три числа: сначала _N_ – общее количество станций кольцевой линии, а затем _i_ и _j_ – номера станции, на которой 
Витя садится, и станции, на которой он должен выйти. Числа _i_ и _j_ не совпадают. Все числа разделены пробелом.

__Формат вывода__  
Требуется выдать минимальное количество промежуточных станций (не считая станции посадки и высадки), 
которые необходимо проехать Вите.

```cpp
#include <iostream>
#include <algorithm>
using namespace std;

int main() {
    int N, i, j;
    cin >> N >> i >> j;

    // Убедимся, что i <= j для упрощения расчётов (порядок станций на кольце симметричен)
    if (i > j) {
        swap(i, j);
    }

    // Расстояние по часовой стрелке (от i к j без перехода через начало кольца)
    int clockwise = j - i - 1;

    // Расстояние против часовой стрелки (с переходом через начало кольца: от i к концу, затем от 1 к j)
    int counterclockwise = (N - j) + (i - 1);

    // Минимальное количество промежуточных станций — наименьшее из двух направлений
    int min_stations = min(clockwise, counterclockwise);

    cout << min_stations << endl;

    return 0;
}
```
Время: 2ms. Память: 668Kb.
