### Строительство школы

В деревне Интернетовка все дома расположены вдоль одной улицы по одну сторону от нее. 
По другую сторону от этой улицы пока ничего нет, но скоро все будет – школы, магазины, кинотеатры и т.д. 
Для начала в этой деревне решили построить школу. Место для строительства школы решили выбрать так, 
чтобы суммарное расстояние, которое проезжают ученики от своих домов до школы, было минимально.
План деревни можно представить в виде прямой, в некоторых целочисленных точках которой находятся дома учеников. 
Школу также разрешается строить только в целочисленной точке этой прямой (в том числе разрешается строить школу 
в точке, где расположен один из домов – ведь школа будет расположена с другой стороны улицы).
Напишите программу, которая по известным координатам домов учеников поможет определить координаты места строительства школы.

__Формат ввода__  
Сначала вводится число _N_ — количество учеников (0 < _N_ < 100001). Далее идут в строго возрастающем порядке 
координаты домов учеников — целые числа, не превосходящие 2×$10^9$ по модулю.

__Формат вывода__  
Выведите одно целое число — координату точки, в которой лучше всего построить школу. 
Если ответов несколько, выведите любой из них.

```cpp
#include <iostream>
#include <vector>

using namespace std;

int main() {
    int N;
    cin >> N;

    vector<long long> coordinates(N);
    for (int i = 0; i < N; ++i) {
        cin >> coordinates[i];
    }

    // Для минимизации суммарного расстояния до школы оптимальная позиция — медиана массива координат
    int median_index = N / 2;
    
    // При чётном N оба центральных элемента (median_index-1 и median_index) дают одинаковый или близкий результат,
    // Выбираем элемент с индексом N/2 — это гарантирует корректный ответ в обоих случаях (чётное/нечётное N)
    long long school_position = coordinates[median_index];

    cout << school_position << endl;

    return 0;
}
```
Время: 56ms. Память: 924Kb.
