### Точка и треугольник

На координатной плоскости расположены равнобедренный прямоугольный треугольник _ABC_ с длиной катета _d_ и точка _X_. 
Катеты треугольника лежат на осях координат, а вершины расположены в точках: _A_ (0,0), _B_ (d,0), _C_ (0,d).
Напишите программу, которая определяет взаимное расположение точки _X_ и треугольника. 
Если точка _X_ расположена внутри или на сторонах треугольника, выведите __0__. 
Если же точка находится вне треугольника, выведите номер ближайшей к ней вершины.

__Формат ввода__  
Сначала вводится натуральное число _d_ (не превосходящее 1000), а затем координаты точки _X_ – два целых числа из диапазона 
от ­–1000 до 1000.

__Формат вывода__  
Если точка лежит внутри, на стороне треугольника или совпадает с одной из вершин, то выведите число __0__. 
Если точка лежит вне треугольника, то выведите номер вершины треугольника, к которой она расположена ближе всего 
(__1__ – к вершине _A_, __2__ – к _B_, __3__ – к _C_). 
Если точка расположена на одинаковом расстоянии от двух вершин, выведите ту вершину, номер которой меньше.

```cpp
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    int d, x, y;
    cin >> d >> x >> y;

    // Проверка, лежит ли точка внутри треугольника или на его границе
    // Условия:
    // 1. x >= 0 (точка не левее оси Y)
    // 2. y >= 0 (точка не ниже оси X)
    // 3. x + y <= d (точка под гипотенузой треугольника)
    if (x >= 0 && y >= 0 && x + y <= d) {
        cout << 0 << endl;
        return 0;
    }

    // Вычисляем квадраты расстояний до вершин (чтобы избежать операций с плавающей точкой)
    long long distA = 1LL * x * x + 1LL * y * y;        // до A(0,0)
    long long distB = 1LL * (x - d) * (x - d) + 1LL * y * y;     // до B(d,0)
    long long distC = 1LL * x * x + 1LL * (y - d) * (y - d);     // до C(0,d)

    // Находим минимальное расстояние и соответствующую вершину
    // Приоритет: если расстояния равны, выбираем вершину с меньшим номером
    long long minDist = distA;
    int closestVertex = 1; // A

    if (distB < minDist) {
        minDist = distB;
        closestVertex = 2; // B
    }
    if (distC < minDist) {
        minDist = distC;
        closestVertex = 3; // C
    }

    cout << closestVertex << endl;

    return 0;
}
```
Время: 2ms. Память: 796Kb.
