### Гистограмма

Вовочка ломает систему безопасности Пентагона. Для этого ему понадобилось узнать, какие символы 
в секретных зашифрованных посланиях употребляются чаще других. Для удобства изучения Вовочка хочет получить 
графическое представление встречаемости символов. Поэтому он хочет построить гистограмму количества символов в сообщении. 
Гистограмма — это график, в котором каждому символу, встречающемуся в сообщении хотя бы один раз, соответствует столбик, 
высота которого пропорциональна количеству этих символов в сообщении.

__Формат ввода__  
Входной файл содержит зашифрованный текст сообщения. Он содержит строчные и прописные латинские буквы, цифры, 
знаки препинания («.», «!», «?», «:», «-», «,», «;», «(», «)»), пробелы и переводы строк. Размер входного файла 
не превышает 10000 байт. Текст содержит хотя бы один непробельный символ. Все строки входного файла не длиннее 
200 символов. Для каждого символа c кроме пробелов и переводов строк выведите столбик из символов «#», количество которых 
должно быть равно количеству символов _c_ в данном тексте. Под каждым столбиком напишите символ, соответствующий ему. 
Отформатируйте гистограмму так, чтобы нижние концы столбиков были на одной строке, первая строка и первый столбец были непустыми. 
Не отделяйте столбики друг от друга. Отсортируйте столбики в порядке увеличения кодов символов.

__Формат вывода__  
Для каждого символа c кроме пробелов и переводов строк выведите столбик из символов «#», 
количество которых должно быть равно количеству символов _c_ в данном тексте. Под каждым столбиком напишите символ, 
соответствующий ему. Отформатируйте гистограмму так, чтобы нижние концы столбиков были на одной строке, первая строка 
и первый столбец были непустыми. Не отделяйте столбики друг от друга. Отсортируйте столбики в порядке увеличения кодов символов.

```py
import sys
from collections import Counter

text = sys.stdin.read()

char_counts = Counter(c for c in text if c not in ' \n')

sorted_chars = sorted(char_counts.keys())

max_height = max(char_counts.values())

histogram_lines = []
for level in range(max_height, 0, -1):
    line = ''.join('#' if char_counts[char] >= level else ' ' for char in sorted_chars)
    histogram_lines.append(line)

histogram_lines.append(''.join(sorted_chars))

print('\n'.join(histogram_lines))
```
