### Стек с защитой от ошибок

Научитесь пользоваться стандартной структурой данных stack для целых чисел. 
Напишите программу, содержащую описание стека и моделирующую работу стека, реализовав все указанные здесь методы. 
Программа считывает последовательность команд и в зависимости от команды выполняет ту или иную операцию. 
После выполнения каждой команды программа должна вывести одну строчку. Возможные команды для программы:

_push n_
Добавить в стек число _n_ (значение n задается после команды). Программа должна вывести _ok_.

_pop_
Удалить из стека последний элемент. Программа должна вывести его значение.

_back_
Программа должна вывести значение последнего элемента, не удаляя его из стека.

_size_
Программа должна вывести количество элементов в стеке.

_clear_
Программа должна очистить стек и вывести ok.

_exit_
Программа должна вывести bye и завершить работу.

Перед исполнением операций _back_ и _pop_ программа должна проверять, содержится ли в стеке хотя бы один элемент. 
Если во входных данных встречается операция _back_ или _pop_, и при этом стек пуст, то программа должна вместо 
числового значения вывести строку _error_.

__Формат ввода__  
Вводятся команды управления стеком, по одной на строке

__Формат вывода__  
Программа должна вывести протокол работы стека, по одному сообщению на строке

```py
stack = []
while True:
    s = input().split()
    if "push" in s:
        stack.append(s[-1])
        print("ok")
    if "size" in s:
        print(len(stack))
    if "clear" in s:
        stack = []
        print("ok")
    if "exit" in s:
        print("bye")
        break
    if "pop" in s:
        if not stack:
            print("error")
        else:
            print(stack[-1])
            stack.pop()
    if "back" in s:
        if not stack:
            print("error")
        else:
            print(stack[-1])
```
