### Правильная скобочная последовательность

Рассмотрим последовательность, состоящую из круглых, квадратных и фигурных скобок. Программа должна определить, 
является ли данная скобочная последовательность правильной. Пустая последовательность является правильной. 
Если A — правильная, то последовательности (A), [A], {A} — правильные. Если A и B — правильные последовательности, 
то последовательность AB — правильная.

__Формат ввода__  
В единственной строке записана скобочная последовательность, содержащая не более 100000 скобок.

__Формат вывода__  
Если данная последовательность правильная, то программа должна вывести строку _yes_, иначе строку _no_.

__Прямое сравнение__
```py
s = input()
stack = []
is_good = True
for i in s:
    if i in "({[":
        stack.append(i)
    elif i in ")}]":
        if not stack:
            is_good = False
            break
        open_bracket = stack.pop()
        if open_bracket == "(" and i == ")":
            continue
        if open_bracket == "{" and i == "}":
            continue
        if open_bracket == "[" and i == "]":
            continue
        is_good = False
        break
if is_good and len(stack) == 0:
    print("yes")
else:
    print("no")
```
