### Три единицы подряд

По данному числу _N_ определите количество последовательностей из нулей и единиц длины _N_, в которых никакие три единицы не стоят рядом.

__Формат ввода__  
Во входном файле написано натуральное число _N_, не превосходящее 35.

__Формат вывода__  
Выведите количество искомых последовательностей. Гарантируется, что ответ не превосходит $2^31 $ - 1.

```cpp
#include <iostream>
#include <vector>
using namespace std;

int main() {
    int N;
    cin >> N;

    // Обрабатываем базовые случаи
    if (N == 0) {
        cout << 1 << endl;
        return 0;
    }
    if (N == 1) {
        cout << 2 << endl;
        return 0;
    }
    if (N == 2) {
        cout << 4 << endl;
        return 0;
    }

    // Инициализируем массив для динамического программирования
    vector<long long> dp(N + 1, 0);

    // Базовые случаи
    dp[0] = 1;  // пустая последовательность
    dp[1] = 2;  // "0", "1"
    dp[2] = 4;  // "00", "01", "10", "11"
    dp[3] = 7;  // все кроме "111"

    // Заполняем массив для i от 4 до N
    for (int i = 4; i <= N; ++i) {
        dp[i] = dp[i - 1] + dp[i - 2] + dp[i - 3];
    }

    cout << dp[N] << endl;
    return 0;
}
```
Время: 2ms. Память: 796Kb.
