### Три единицы подряд

По данному числу _N_ определите количество последовательностей из нулей и единиц длины _N_, в которых никакие три единицы не стоят рядом.

__Формат ввода__  
Во входном файле написано натуральное число _N_, не превосходящее 35.

__Формат вывода__  
Выведите количество искомых последовательностей. Гарантируется, что ответ не превосходит $2^{31}$ - 1.

```py
def count_seq(n):
    dp = [0, 2, 4, 7]

    for i in range(4, n + 1):
        dp.append(dp[i-1] + dp[i-2] + dp[i-3])
        
    return dp[n]


def main():
    n = int(input())
    print(count_seq(n))
```
