### Покупка билетов

За билетами на премьеру нового мюзикла выстроилась очередь из N человек, каждый из которых хочет купить 1 билет. 
На всю очередь работала только одна касса, поэтому продажа билетов шла очень медленно, 
приводя «постояльцев» очереди в отчаяние. Самые сообразительные быстро заметили, что, как правило, 
несколько билетов в одни руки кассир продаёт быстрее, чем когда эти же билеты продаются по одному. 
Поэтому они предложили нескольким подряд стоящим людям отдавать деньги первому из них, чтобы он купил билеты на всех.
Однако для борьбы со спекулянтами кассир продавала не более 3-х билетов в одни руки, 
поэтому договориться таким образом между собой могли лишь 2 или 3 подряд стоящих человека.
Известно, что на продажу i-му человеку из очереди одного билета кассир тратит $A_i$ секунд, на продажу двух билетов — $B_i$ секунд, 
трех билетов — $C_i$ секунд. Напишите программу, которая подсчитает минимальное время, за которое могли быть обслужены все покупатели.
Обратите внимание, что билеты на группу объединившихся людей всегда покупает первый из них. 
Также никто в целях ускорения не покупает лишних билетов (то есть билетов, которые никому не нужны).

__Формат ввода__  
На вход программы поступает сначала число _N_ — количество покупателей в очереди (1 ≤ _N_ ≤ 5000). 
Далее идет N троек натуральных чисел $A_i$, $B_i$, $C_i$. Каждое из этих чисел не превышает 3600. 
Люди в очереди нумеруются, начиная от кассы.

__Формат вывода__  
Требуется вывести одно число — минимальное время в секундах, за которое могли быть обслужены все покупатели.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

int main() {
    int N;
    cin >> N;

    vector<int> A(N), B(N), C(N);
    for (int i = 0; i < N; ++i) {
        cin >> A[i] >> B[i] >> C[i];
    }

    // dp[i] — минимальное время для обслуживания первых i покупателей
    vector<long long> dp(N + 3, 1e9); // +3 для безопасности при переходах
    dp[0] = 0; // базовый случай: 0 покупателей — 0 секунд

    for (int i = 0; i < N; ++i) {
        // Вариант 1: i-й покупатель покупает один билет
        dp[i + 1] = min(dp[i + 1], dp[i] + A[i]);

        // Вариант 2: i-й и (i+1)-й объединяются, i-й покупает два билета
        if (i + 1 < N) {
            dp[i + 2] = min(dp[i + 2], dp[i] + B[i]);
        }

        // Вариант 3: i-й, (i+1)-й и (i+2)-й объединяются, i-й покупает три билета
        if (i + 2 < N) {
            dp[i + 3] = min(dp[i + 3], dp[i] + C[i]);
        }
    }

    cout << dp[N] << endl;
    return 0;
}
```
Время: 6ms. Память: 796Kb.
