### Гвоздики

В дощечке в один ряд вбиты гвоздики. Любые два гвоздика можно соединить ниточкой. 
Требуется соединить некоторые пары гвоздиков ниточками так, чтобы к каждому гвоздику была привязана хотя бы одна ниточка, 
а суммарная длина всех ниточек была минимальна.

__Формат ввода__   
В первой строке входных данных записано число _N_ — количество гвоздиков (2 ≤ N ≤ 100). В следующей строке заданы _N_ чисел — 
координаты всех гвоздиков (неотрицательные целые числа, не превосходящие 10000).

__Формат вывода__  
Выведите единственное число — минимальную суммарную длину всех ниточек.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

const int INF = 1e9;

int main() {
    int N;
    cin >> N;

vector<int> x(N);
    for (int i = 0; i < N; ++i) {
        cin >> x[i];
    }

    // Сортируем координаты гвоздиков
    sort(x.begin(), x.end());

    // dp[i] — минимальная длина нитей для первых i гвоздиков (1-индексация)
    vector<int> dp(N + 1, INF);

    // Базовые случаи
    dp[0] = 0;
    if (N >= 1) dp[1] = INF; // один гвоздик нельзя соединить
    if (N >= 2) dp[2] = x[1] - x[0]; // соединяем два гвоздика
    if (N >= 3) dp[3] = x[2] - x[0]; // первый с третьим через второй

    // Заполняем dp для i от 4 до N
    for (int i = 4; i <= N; ++i) {
        // Вариант 1: соединяем (i-1)-й и i-й гвоздики
        dp[i] = min(dp[i], dp[i - 2] + (x[i - 1] - x[i - 2]));

        // Вариант 2: соединяем (i-2)-й, (i-1)-й и i-й попарно
        dp[i] = min(dp[i], dp[i - 3] + (x[i - 1] - x[i - 3]));
    }

    cout << dp[N] << endl;
    return 0;
}
```
Время: 2ms. Память: 292Kb.
