### Вывести маршрут максимальной стоимости

В левом верхнем углу прямоугольной таблицы размером _N×M_ находится черепашка. 
В каждой клетке таблицы записано некоторое число. Черепашка может перемещаться вправо или вниз, 
при этом маршрут черепашки заканчивается в правом нижнем углу таблицы.

Подсчитаем сумму чисел, записанных в клетках, через которые 
проползла черепашка (включая начальную и конечную клетку). 
Найдите наибольшее возможное значение этой суммы и маршрут, на котором достигается эта сумма.

__Формат ввода__  
В первой строке входных данных записаны два натуральных числа _N_ и _M_, не превосходящих 100, — 
размеры таблицы. Далее идет _N_ строк, каждая из которых содержит _M_ чисел, разделенных пробелами, — 
описание таблицы. Все числа в клетках таблицы целые и могут принимать значения от 0 до 100.

__Формат вывода__  
Первая строка выходных данных содержит максимальную возможную сумму, вторая — маршрут, 
на котором достигается эта сумма. Маршрут выводится в виде последовательности, 
которая должна содержать _N-1_ букву _D_, означающую передвижение вниз и _M-1_ букву _R_, означающую передвижение направо. 
Если таких последовательностей несколько, необходимо вывести ровно одну (любую) из них.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    int N, M;
    cin >> N >> M;

    // Чтение таблицы
    vector<vector<int>> table(N, vector<int>(M));
    for (int i = 0; i < N; ++i) {
        for (int j = 0; j < M; ++j) {
            cin >> table[i][j];
        }
    }

    // DP-таблица для хранения максимальных сумм
    vector<vector<long long>> dp(N, vector<long long>(M, 0));
    // Таблица для хранения информации о маршруте (откуда пришли в клетку)
    vector<vector<char>> prev(N, vector<char>(M, ' '));

    // Инициализация начальной клетки
    dp[0][0] = table[0][0];

    // Заполнение первой строки (можно двигаться только вправо)
    for (int j = 1; j < M; ++j) {
        dp[0][j] = dp[0][j - 1] + table[0][j];
        prev[0][j] = 'R';
    }

    // Заполнение первого столбца (можно двигаться только вниз)
    for (int i = 1; i < N; ++i) {
        dp[i][0] = dp[i - 1][0] + table[i][0];
        prev[i][0] = 'D';
    }

    // Заполнение остальной части таблицы
    for (int i = 1; i < N; ++i) {
        for (int j = 1; j < M; ++j) {
            if (dp[i - 1][j] > dp[i][j - 1]) {
                dp[i][j] = dp[i - 1][j] + table[i][j];
                prev[i][j] = 'D'; // Пришли сверху
            } else {
                dp[i][j] = dp[i][j - 1] + table[i][j];
                prev[i][j] = 'R'; // Пришли слева
            }
        }
    }

    // Вывод максимальной суммы
    cout << dp[N - 1][M - 1] << endl;

    // Восстановление маршрута
    string path;
    int i = N - 1, j = M - 1;

    while (i != 0 || j != 0) {
        if (prev[i][j] == 'D') {
            path += 'D';
            --i;
        } else { // prev[i][j] == 'R'
            path += 'R';
            --j;
        }
    }

    // Разворот строки, так как маршрут восстанавливался с конца
    reverse(path.begin(), path.end());
    cout << path << endl;

    return 0;
}
```

Время: 2ms. Память: 668Kb.
