### Кафе

Около Петиного университета недавно открылось новое кафе, 
в котором действует следующая система скидок: при каждой покупке 
более чем на 100 рублей покупатель получает купон, дающий право на один бесплатный обед 
(при покупке на сумму 100 рублей и меньше такой купон покупатель не получает). Однажды Пете на глаза попался прейскурант 
на ближайшие _N_ дней. 
Внимательно его изучив, он решил, что будет обедать в этом кафе все _N_ дней, причем каждый день 
он будет покупать в кафе ровно один обед. Однако стипендия у Пети небольшая, 
и поэтому он хочет по максимуму использовать предоставляемую систему скидок так, 
чтобы его суммарные затраты были минимальны. Требуется найти минимально возможную суммарную стоимость 
обедов и номера дней, в которые Пете следует воспользоваться купонами.

__Формат ввода__  
В первой строке входного файла записано целое число _N_ (0 ≤ _N_ ≤ 100). В каждой из последующих _N_ строк 
записано одно целое число, обозначающее стоимость обеда в рублях на соответствующий день. 
Стоимость — неотрицательное целое число, не превосходящее 300.

__Формат вывода__  
В первой строке выдайте минимальную возможную суммарную стоимость обедов. Во второй строке выдайте два числа _K1_ и _K2_ — количество 
купонов, которые останутся неиспользованными у Пети после этих N дней, и количество использованных им купонов соответственно. В 
последующих _K2_ строках выдайте в возрастающем порядке номера дней, когда Пете следует воспользоваться купонами. 
Если существует несколько решений с минимальной суммарной стоимостью, то выдайте то из них, в котором значение _K1_ максимально 
(на случай, если Петя когда-нибудь ещё решит заглянуть в это кафе). Если таких решений несколько, выведите любое из них.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <climits>

using namespace std;

const int MAX_N = 105;
const int INF = 1e9;

int main() {
    int N;
    cin >> N;

    vector<int> cost(N + 1); // стоимость обедов (1-индексация)
    for (int i = 1; i <= N; ++i) {
        cin >> cost[i];
    }

    // dp[i][j] — минимальная стоимость за первые i дней с j купонами на начало дня i
    vector<vector<int>> dp(N + 1, vector<int>(N + 2, INF));
    // prev[i][j] хранит информацию о предыдущем состоянии
    vector<vector<pair<int, int>>> prev(N + 1, vector<pair<int, int>>(N + 2, {-1, -1}));
    // use_coupon[i][j] = true, если в день i использовали купон при j купонах
    vector<vector<bool>> use_coupon(N + 1, vector<bool>(N + 2, false));

    // Инициализация: в начале 0 дней, 0 купонов, 0 затрат
    dp[0][0] = 0;

    // Заполняем dp
    for (int day = 0; day < N; ++day) {
        for (int coupons = 0; coupons <= N; ++coupons) {
            if (dp[day][coupons] == INF) continue;

            int next_day = day + 1;
            int price = cost[next_day];

            // Вариант 1: покупаем обед без использования купона
            int new_coupons = coupons;
            if (price > 100) {
                new_coupons++; // получаем купон
            }
            if (dp[next_day][new_coupons] > dp[day][coupons] + price) {
                dp[next_day][new_coupons] = dp[day][coupons] + price;
                prev[next_day][new_coupons] = {day, coupons};
                use_coupon[next_day][new_coupons] = false;
            }

            // Вариант 2: используем купон (если есть)
            if (coupons > 0) {
                int new_coupons_used = coupons - 1;
                if (dp[next_day][new_coupons_used] > dp[day][coupons]) {
                    dp[next_day][new_coupons_used] = dp[day][coupons];
                    prev[next_day][new_coupons_used] = {day, coupons};
                    use_coupon[next_day][new_coupons_used] = true;
                }
            }
        }
    }

    // Находим минимальную стоимость и максимальное количество оставшихся купонов
    int min_cost = INF;
    int final_coupons = -1;

    for (int j = 0; j <= N; ++j) {
        if (dp[N][j] < min_cost) {
            min_cost = dp[N][j];
            final_coupons = j;
        } else if (dp[N][j] == min_cost && j > final_coupons) {
            final_coupons = j; // выбираем вариант с большим числом купонов
        }
    }

    // Восстанавливаем дни использования купонов
    vector<int> coupon_days;
    int current_day = N;
    int current_coupons = final_coupons;

    while (current_day > 0) {
        if (use_coupon[current_day][current_coupons]) {
            coupon_days.push_back(current_day);
        }
        auto [prev_day, prev_coupons] = prev[current_day][current_coupons];
        current_day = prev_day;
        current_coupons = prev_coupons;
    }

    reverse(coupon_days.begin(), coupon_days.end());

    // Выводим результат
    cout << min_cost << endl;
    cout << final_coupons << " " << coupon_days.size() << endl;
    for (int day : coupon_days) {
        cout << day << endl;
    }

    return 0;
}
```

Время: 2ms. Память: 924Kb.
