### Хипуй

В этой задаче вам необходимо самостоятельно (не используя соответствующие классы и функции 
стандартной библиотеки) организовать структуру данных Heap для хранения целых чисел, 
над которой определены следующие операции:  
a) _Insert(k)_ — добавить в _Heap_ число _k_;  
b) _Extract_ — достать из _Heap_ наибольшее число (удалив его при этом).

__Формат ввода__  
В первой строке содержится количество команд _N_ (1 ≤ _N_ ≤ 100000), далее следуют _N_ команд, 
каждая в своей строке. Команда может иметь формат: “0 <число>” или “1”, обозначающий, 
соответственно, операции _Insert(<число>)_ и _Extract_. Гарантируется, что при выполнении команды _Extract_ в 
структуре находится по крайней мере один элемент.

__Формат вывода__   
Для каждой команды извлечения необходимо отдельной строкой вывести число, полученное при выполнении команды _Extract_.

```cpp
#include <iostream>
#include <vector>

using namespace std;

class Heap {
private:
    vector<int> data;

    // Просеивание элемента вверх
    void siftUp(int index) {
        while (index > 0) {
            int parent = (index - 1) / 2;
            if (data[index] <= data[parent]) {
                break; // Условие кучи выполнено
            }
            swap(data[index], data[parent]);
            index = parent;
        }
    }

    // Просеивание элемента вниз
    void siftDown(int index) {
        int size = data.size();
        while (true) {
            int left = 2 * index + 1;
            int right = 2 * index + 2;
            int largest = index;

            if (left < size && data[left] > data[largest]) {
                largest = left;
            }
            if (right < size && data[right] > data[largest]) {
                largest = right;
            }

            if (largest == index) {
                break; // Условие кучи выполнено
            }

            swap(data[index], data[largest]);
            index = largest;
        }
    }

public:
    // Добавление элемента в кучу
    void insert(int k) {
        data.push_back(k);
        siftUp(data.size() - 1);
    }

    // Извлечение максимального элемента
    int extract() {
        int maxElement = data[0];
        data[0] = data.back();
        data.pop_back();

        if (!data.empty()) {
            siftDown(0);
        }

        return maxElement;
    }
};

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int N;
    cin >> N;

    Heap heap;

    for (int i = 0; i < N; ++i) {
        int command;
        cin >> command;

        if (command == 0) {
            int number;
            cin >> number;
            heap.insert(number);
        } else if (command == 1) {
            cout << heap.extract() << '\n';
        }
    }

    return 0;
}
```
Время: 22ms. Память: 796Kb.
