### Родословная: подсчёт уровней

В генеалогическом древе у каждого человека, кроме родоначальника, 
есть ровно один родитель. Каждому элементу дерева сопоставляется 
целое неотрицательное число, называемое высотой. У родоначальника высота равна 0, 
у любого другого элемента высота на 1 больше, чем у его родителя. 
Вам дано генеалогическое древо, определите высоту всех его элементов.

__Формат ввода__   
Программа получает на вход число элементов в генеалогическом древе _N_. Далее следует _N−1_ строка, 
задающие родителя для каждого элемента древа, кроме родоначальника. Каждая строка имеет вид _имя_потомка_ _имя_родителя_.

__Формат вывода__  
Программа должна вывести список всех элементов древа в лексикографическом порядке. 
После вывода имени каждого элемента необходимо вывести его высоту.

```cpp
#include <iostream>
#include <map>
#include <string>
#include <set>

using namespace std;

// Храним связь "потомок -> родитель"
map<string, string> parentOf;
// Кэш для уже вычисленных высот
map<string, int> heightCache;

// Рекурсивная функция для вычисления высоты человека
int calculateHeight(const string& person) {
    // Если высота уже вычислена, возвращаем её
    if (heightCache.find(person) != heightCache.end()) {
        return heightCache[person];
    }
    
    // Если у человека нет родителя, он — родоначальник (высота = 0)
    if (parentOf.find(person) == parentOf.end()) {
        heightCache[person] = 0;
        return 0;
    }
    
    // Высота = высота родителя + 1
    string parent = parentOf[person];
    int parentHeight = calculateHeight(parent);
    heightCache[person] = parentHeight + 1;
    return parentHeight + 1;
}

int main() {
    int N;
    cin >> N;
    
    // Множество всех людей в древе
    set<string> allPeople;
    
    // Читаем N-1 связей "потомок родитель"
    for (int i = 0; i < N - 1; ++i) {
        string child, parent;
        cin >> child >> parent;
        parentOf[child] = parent;
        allPeople.insert(child);
        allPeople.insert(parent);
    }
    
    // Вычисляем высоты для всех людей
    for (const string& person : allPeople) {
        calculateHeight(person);
    }
    
    // Выводим результат в лексикографическом порядке
    for (const string& person : allPeople) {
        cout << person << " " << heightCache[person] << endl;
    }
    
    return 0;
}
```
Время: 2ms. Память: 792Kb.
