### Размер поддеревьев

Дано неориентированное дерево, подвешенное за вершину 1. 
Для каждой вершины подсчитайте, сколько вершин содержится в поддереве, подвешенном за данную вершину.

__Формат ввода__  
В первой строке вводится число _V_ — количество вершин (3 ≤ _V_ ≤ 100000). В следующих _V−1_ строках 
записано по два числа: номера соединенных ребром вершин.

__Формат вывода__  
Выведите _V_ чисел — размеры поддеревьев для каждой из вершин.

```cpp
#include <iostream>
#include <vector>

using namespace std;

// Функция DFS для вычисления размеров поддеревьев
void dfs(int v, int parent, const vector<vector<int>>& graph, vector<int>& subtreeSize) {
    // Изначально размер поддерева — 1 (сама вершина)
    subtreeSize[v] = 1;
    
    // Обходим всех соседей вершины v
    for (int u : graph[v]) {
        // Пропускаем родителя, чтобы не идти назад
        if (u != parent) {
            // Рекурсивно вычисляем размер поддерева для ребёнка u
            dfs(u, v, graph, subtreeSize);
            // Добавляем размер поддерева ребёнка к размеру текущего поддерева
            subtreeSize[v] += subtreeSize[u];
        }
    }
}

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);
    
    int V;
    cin >> V;
    
    // Граф в виде списка смежности (вершины нумеруются с 1)
    vector<vector<int>> graph(V + 1);
    // Массив для хранения размеров поддеревьев
    vector<int> subtreeSize(V + 1, 0);
    
    // Считываем V-1 рёбер
    for (int i = 0; i < V - 1; ++i) {
        int a, b;
        cin >> a >> b;
        graph[a].push_back(b);
        graph[b].push_back(a);
    }
    
    // Запускаем DFS из корня (вершина 1), родитель -1 (у корня нет родителя)
    dfs(1, -1, graph, subtreeSize);
    
    // Выводим размеры поддеревьев для вершин от 1 до V
    for (int i = 1; i <= V; ++i) {
        cout << subtreeSize[i] << " ";
    }
    cout << endl;
    
    return 0;
}
```
Время: 39ms. Память: 6.31Mb.
