### Делёж грибов

Вася и Маша ходили в лес и собрали n грибов, для каждого гриба известен его вес ai. Они выложили их в один ряд и решили делить следующим образом: 
первый гриб берёт Вася, второй — Маша, третий — Вася, четвёртый — Маша и т. д.

Вася очень любит грибы и не очень любит Машу. Количество радости Васи равно разности суммарного веса грибов, 
доставшихся Васе, и суммарного веса грибов, доставшихся Маше. Т.е. радость вычисляется по формуле: сумма от 1 до n
(-1) в степени (i - 1) * ai = a1 - a2 + a3 - ...

Маша отвлеклась на минутку, и за это время Вася может выбрать любые два гриба и поменять их местами 
(а может и не менять). Определите максимальную радость Васи, которую можно достичь не более чем одним обменом.  

__Формат ввода__  
В первой строке содержится одно натуральное число n — количество грибов (2 ≤ n ≤ 10^5).

Во второй строке содержится n чисел ai — вес грибов (1 ≤ ai ≤1000).

__Формат вывода__  
Выведите максимальную радость Васи.

```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <climits>

using namespace std;

int main() {
    int n;
    cin >> n;
    vector<int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }

    // Начальная радость
    long long initial_joy = 0;
    for (int i = 0; i < n; i++) {
        if (i % 2 == 0) {
            initial_joy += a[i];  // Вася (нечётные индексы в 0-индексации — это 1, 3, ...)
        } else {
            initial_joy -= a[i];  // Маша (чётные индексы в 0-индексации — это 2, 4, ...)
        }
    }

    // Инициализация значений для поиска экстремумов
    int max_vasya = INT_MIN, min_vasya = INT_MAX;
    int max_masha = INT_MIN, min_masha = INT_MAX;

    for (int i = 0; i < n; i++) {
        if (i % 2 == 0) {  // Гриб Васи
            max_vasya = max(max_vasya, a[i]);
            min_vasya = min(min_vasya, a[i]);
        } else {  // Гриб Маши
            max_masha = max(max_masha, a[i]);
            min_masha = min(min_masha, a[i]);
        }
    }

    // Возможные улучшения
    long long improvement1 = 2LL * (min_masha - max_vasya);  // Меняем max Васи на min Маши
    long long improvement2 = 2LL * (max_masha - min_vasya);  // Меняем min Васи на max Маши

    // Максимальная радость
    long long max_joy = initial_joy + max(0LL, max(improvement1, improvement2));

    cout << max_joy << endl;

    return 0;
}
```
Время: 23ms. Память: 792Kb.
