### B. Мамины поручения

Мама отправила Васю купить продукты в супермаркете и забрать посылку из пункта выдачи. Дорога от дома до супермаркета имеет длину _a_ метров, от дома до пункта выдачи — 
_b_ метров, а дорога от супермаркета до пункта выдачи — _c_ метров. Вася может ходить по этим дорогам в любом направлении.
Скорость Васи зависит от того, несет ли он что-нибудь или идёт без груза. Если он не несет ни продукты, ни посылку, то его скорость равна _v0_ метров в минуту. 
Если он несет что-то одно, то его скорость равна _v1_ метров в минуту (v1 ≤ v0). Если он несет и продукты, и посылку, его скорость равна _v2_ метров в минуту (v2​ ≤ v1).
Вася может мгновенно купить продукты, получить посылку или занести имеющийся у него груз домой.
Определите минимальное время, за которое Вася может сходить за продуктами и посылкой и вернуться домой.

__Формат ввода__
В единственной строке ввода записаны шесть целых чисел _a_, _b_, _c_, _v0_, _v1_, _v2_ — длина дороги от дома до супермаркета, длина дороги от дома до пункта выдачи, 
длина дороги от супермаркета до пункта выдачи, скорость Васи без груза, скорость Васи с продуктами либо посылкой, скорость Васи с продуктами и посылкой (1 ≤ a,b,c ≤ 100; 
1 ≤ v2 ≤ v1 ≤ v0 ≤ 100).

__Формат вывода__
В единственной строке выведите одно вещественное число — минимальное количество минут, которое потребуется Васе, чтобы сходить за продуктами и посылкой и вернуться домой. 
Абсолютная или относительная погрешность ответа не должна превышает $10^{-4}$.

```cpp
#include <iostream>
#include <iomanip>
#include <algorithm>

using namespace std;

int main() {
    int a, b, c, v0, v1, v2;
    cin >> a >> b >> c >> v0 >> v1 >> v2;
    
    double t1 = static_cast<double>(a) / v0 + static_cast<double>(c) / v1 + static_cast<double>(b) / v2;
    double t2 = static_cast<double>(b) / v0 + static_cast<double>(c) / v1 + static_cast<double>(a) / v2;
    double t3 = static_cast<double>(a) / v0 + static_cast<double>(b) / v0 + static_cast<double>(a) / v1 + static_cast<double>(b) / v1;
    double t4 = static_cast<double>(b) / v0 + static_cast<double>(c) / v1 + static_cast<double>(c) / v2 + static_cast<double>(b) / v2;
    double t5 = static_cast<double>(a) / v0 + static_cast<double>(c) / v0 + static_cast<double>(c) / v1 + static_cast<double>(a) / v2;
    double t6 = static_cast<double>(b) / v0 + static_cast<double>(c) / v0 + static_cast<double>(c) / v1 + static_cast<double>(b) / v2;
    double t7 = static_cast<double>(b) / v0 + static_cast<double>(b) / v1 + static_cast<double>(b + c) / v0 + static_cast<double>(b + c) / v1;
    double t8 = static_cast<double>(a) / v0 + static_cast<double>(a) / v1 + static_cast<double>(a + c) / v0 + static_cast<double>(a + c) / v1;
    
    
    double min_time = min({t1, t2, t3, t4, t5, t6, t7, t8});
    
    cout << fixed << setprecision(6) << min_time << endl;
    return 0;
}
```
Время: 2ms. Память: 796Kb.
