### Кибербезопасность

На работе у Васи требуют менять пароль каждую неделю, причём новый пароль не должен совпадать 
ни с одним из предыдущих. Любимый Васин пароль — это строка _s_, состоящая из строчных английских букв. 
Этот пароль он использует первую неделю. Придумывать и запоминать новые пароли Васе лень. 
Поэтому он решил менять местами пару букв в исходном пароле _s_ и получать новый пароль. 
Определите, сколько недель Вася сможет генерировать новые пароли с учетом пароля _s_ на первой неделе.

__Формат ввода__  
Вводится строка _s_ (1 ≤ ∣s∣ ≤ $10^5$), состоящая из строчных английских букв — начальный пароль Васи.

__Формат вывода__  
Выведите одно число — количество недель, в течение которых Вася сможет использовать исходный и измененные пароли.

```cpp
#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main() {
    string s;
    cin >> s;

    int n = s.length();
    vector<int> freq(26, 0); // частота каждой буквы (a-z)

    // подсчёт частот
    for (char c : s) {
        freq[c - 'a']++;
    }

    long long total_swaps = (long long)n * (n - 1) / 2;
    long long duplicate_swaps = 0;

    // подсчёт «пустых» перестановок (когда меняем одинаковые буквы)
    for (int count : freq) {
        if (count >= 2) {
            duplicate_swaps += (long long)count * (count - 1) / 2;
        }
    }

    // итоговый ответ: все перестановки минус дубликаты плюс исходный пароль
    long long result = total_swaps - duplicate_swaps + 1;

    cout << result << endl;

    return 0;
}
```
Время: 4ms. Память: 836Kb. 
