### Отборочный контест

Вася составляет отборочный контест на стажировку. Сотрудники компании подготовили _n_ задач, для каждой 
из задач определена тема, к которой она относится. Отборочный контест состоит ровно из _k_ задач. Помогите Васе выбрать _k_ задач из _n_
так, чтобы они покрывали как можно больше различных тем.

__Формат ввода__  
В первой строке вводится два целых числа _n_, _k_ (1 ≤ _k_ ≤ _n_ ≤ 100000) — количество задач, придуманных сотрудниками, 
и количество задач в контесте. В следующей строке записано _n_ чисел $a_i$ (1 ≤ $a_i$​	≤ $10^9$) — тема, 
к которой относится задача с номером _i_.

__Формат вывода__  
Выведите ровно _k_ целых чисел через пробел — темы задач, которые нужно взять в контест. 
Если правильных ответов несколько — выведите любой из них.

```cpp
#include <iostream>
#include <vector>
#include <map>
#include <algorithm>

using namespace std;

int main() {
    int n, k;
    cin >> n >> k;

    vector<int> topics(n);
    for (int i = 0; i < n; ++i) {
        cin >> topics[i];
    }

    // Считаем количество задач по каждой теме
    map<int, int> topic_count;
    for (int topic : topics) {
        topic_count[topic]++;
    }

    // Копируем в вектор для сортировки: пары (тема, количество)
    vector<pair<int, int>> sorted_topics(topic_count.begin(), topic_count.end());
    // Сортируем по убыванию количества задач в теме
    sort(sorted_topics.begin(), sorted_topics.end(),
          [](const pair<int, int>& a, const pair<int, int>& b) {
              return a.second > b.second;
          });

    vector<int> result;
    int unique_themes_used = 0;

    // Шаг 1: берём по одной задаче из каждой темы (максимизируем разнообразие)
    for (auto& [theme, count] : sorted_topics) {
        if (result.size() < k) {
            result.push_back(theme);
            unique_themes_used++;
        } else {
            break;
        }
    }

    // Шаг 2: если ещё не набрали k задач, берём дополнительные из самых частых тем
    if (result.size() < k) {
        for (auto& [theme, count] : sorted_topics) {
            // Берём дополнительные задачи из темы, пока есть место и задачи
            while (count > 1 && result.size() < k) {
                result.push_back(theme);
                count--; // уменьшаем счётчик, чтобы не брать слишком много
            }
            if (result.size() >= k) break;
        }
    }

    // Выводим результат
    for (int i = 0; i < result.size(); ++i) {
        cout << result[i];
        if (i < result.size() - 1) cout << " ";
    }
    cout << endl;

    return 0;
}
```
Время: 102ms. Память: 6.43Mb. 
