### Табло с инкрементом

На табло было написано число _n_. Каждую секунду к числу прибавляется последняя цифра этого числа. 
Определите, какое число будет отображаться на табло через _k_ секунд.

__Формат ввода__  
В единственной строке записаны два числа _n_ и _k_ (0 ≤ _n_, _k_ ≤ $10^9$) — начальное число и количество секунд соответственно.

__Формат вывода__  
Выведите одно число _x_, которое будет отображаться на табло через _k_ секунд.

```cpp
#include <iostream>
using namespace std;

int main() {
    long long n, k;
    cin >> n >> k;

    if (k == 0) {
        cout << n << endl;
        return 0;
    }
    if (n == 0) {
        cout << 0 << endl;
        return 0;
    }

    for (long long i = 0; i < k; ++i) {
        int last_digit = n % 10;

        // Если последняя цифра 0 — дальше число не меняется
        if (last_digit == 0) break;

        // Если последняя цифра 5 — следующая итерация даст 0
        if (last_digit == 5) {
            n += 5; // выполняем последний шаг
            break;
        }

        // Проверка на начало цикла с периодом 4
        // После цифр 2, 4, 6, 8 идёт цикл: +2, +4, +8, +6
        if (last_digit == 2 || last_digit == 4 || last_digit == 6 || last_digit == 8) {
            long long remaining = k - i; // сколько шагов осталось
            long long full_cycles = remaining / 4; // полные циклы
            long long extra_steps = remaining % 4; // оставшиеся шаги

            // Прирост за один полный цикл (2+4+8+6 = 20)
            n += full_cycles * 20;
            i += full_cycles * 4 - 1; // корректируем счётчик цикла

            // Выполняем оставшиеся шаги по одному
            for (int j = 0; j < extra_steps; ++j) {
                n += n % 10;
            }
            break;
        }

        n += last_digit;
    }

    cout << n << endl;
    return 0;
}
```
Время: 2ms. Память: 796Kb.
