### Разрезанная строка

Строка _s_ была разрезана на _k_ частей одинаковой длины. По строке _s_ и перемешанным частям определите, 
в каком порядке их нужно склеить, чтобы получить строку _s_.

__Формат ввода__  
В первой строке записано два числа _n_ и _m_ (1 ≤ _n_, _m_ ≤ $10^6$) — длина строки и количество кусков соответственно.
Во второй строке записана строка _s_ (1 ≤ ∣s∣ ≤ $10^6$) — строка, которую необходимо получить.
В _i_-й из следующих _m_ строк дана строка $t_i$ — описание _i_-го куска исходной строки.
Гарантируется, что _n_ делится на _m_ и из данных кусков можно составить исходную строку.

__Формат вывода__  
Выведите _m_ различных целых чисел $a_i$ (1 ≤ $a_i$ ≤ m), таких, что если заменить число на _i_-й позиции куском с номером $a_i$ 
и склеить получившиеся куски, получится исходная строка.
Если ответов несколько, выведите любой.

```cpp
#include <iostream>
#include <string>
#include <vector>
#include <unordered_map>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int n, m;
    cin >> n >> m;
    string s;
    cin >> s;

    // Длина каждого куска
    int len = n / m;

    // Разбиваем строку s на m частей — это эталонный порядок
    vector<string> expectedParts;
    for (int i = 0; i < m; ++i) {
        expectedParts.push_back(s.substr(i * len, len));
    }

    // Читаем m кусков и сохраняем их с номерами
    vector<string> inputPieces(m);
    for (int i = 0; i < m; ++i) {
        cin >> inputPieces[i];
    }

    // Для каждой эталонной части ищем номер входного куска
    vector<int> result;
    vector<bool> used(m, false); // чтобы не использовать один кусок дважды

    for (const string& expected : expectedParts) {
        for (int j = 0; j < m; ++j) {
            if (!used[j] && inputPieces[j] == expected) {
                result.push_back(j + 1); // номер куска (начиная с 1)
                used[j] = true;
                break;
            }
        }
    }

    // Выводим результат
    for (int idx : result) {
        cout << idx << " ";
    }
    cout << "\n";

    return 0;
}
```
Время: 0.538s. Память: 3.8Mb.
