### Мячик на лесенке

На вершине лесенки, содержащей _N_ ступенек, находится мячик, который начинает прыгать по ним вниз, 
к основанию. Мячик может прыгнуть на следующую ступеньку, на ступеньку через одну или через 2. 
То есть, если мячик лежит на 8-ой ступеньке, то он может переместиться на 5-ую, 6-ую или 7-ую.
Определите число всевозможных «маршрутов» мячика с вершины на землю.

__Формат ввода__  
Вводится одно число 1 ≤ _N_ ≤ 30.

__Формат вывода__  
Выведите одно число — количество маршрутов.

```cpp
#include <iostream>
#include <vector>

int main() {
    int N;
    std::cin >> N;

    // Массив для хранения количества маршрутов до каждой ступеньки
    std::vector<int> dp(N + 1);

    // Базовые случаи
    dp[0] = 1;
    if (N >= 1) dp[1] = 1;
    if (N >= 2) dp[2] = 2;

    // Заполняем массив для остальных ступенек
    for (int i = 3; i <= N; ++i) {
        dp[i] = dp[i - 1] + dp[i - 2] + dp[i - 3];
    }

    // Выводим результат — количество маршрутов с N-й ступеньки на землю
    std::cout << dp[N] << std::endl;

    return 0;
}
```
Время: . Память: . 
