### А. Полка раздора

Вася решил сделать из квадратного куска фанеры прямоугольную полочку для дома.
Для этого он взял на работе кусок фанеры и отпилил и выбросил от него полосу шириной _a_, сделав вертикальный разрез.
После этого он отрезал полосу высотой _b_ сделав горизонтальный разрез, и также выбросил её.
Площадь оставшейся полочки была равна _S_.
После этого у Васи начались неприятности. Во-первых, начальник заметил исчезновение листа фанеры и обязал Васю купить за свой счет точно такой же лист. 
Во-вторых, жена выбросила полочку, так что измерить её Вася не может и всё что он помнит — это числа _a_, _b_ и _S_.
В магазине продаются только квадратные листы фанеры с целочисленными сторонами. 
Помогите Васе определите размеры листа, который он использовал, либо определите, что такого не существует.

__Формат ввода__  
Вводятся три целых числа _a_, _b_ и _S_ (0 ≤ a, b ≤ $10^{4}$, 1 ≤ S ≤ $10^{8}$).

__Формат вывода__  
Если необходимый лист фанеры есть в продаже, то выведите длину его стороны _L_.
Если же такого листа с целочисленными сторонами не может существовать, то выведите _-1_.

__Решение через квадратное уравнение:__

```cpp
#include <iostream>
#include <cmath>

using namespace std;

int main() {
    long long a, b, S;
    cin >> a >> b >> S;

    // Вычисляем дискриминант
    long long D = (a - b) * (a - b) + 4 * S;

    // Если дискриминант отрицательный, решений нет
    if (D < 0) {
        cout << -1 << endl;
        return 0;
    }

    // Извлекаем квадратный корень из дискриминанта
    long long sqrtD = static_cast<long long>(sqrt(D));

    // Проверяем, что корень целый (D — полный квадрат)
    if (sqrtD * sqrtD != D) {
        cout << -1 << endl;
        return 0;
    }

    // Находим два возможных корня
    long long x1 = (a + b + sqrtD) / 2;
    long long x2 = (a + b - sqrtD) / 2;

    // Проверяем условия для корней:
    // 1. Корень должен быть целым (проверяем чётность числителя)
    // 2. Корень должен быть положительным
    // 3. Корень должен быть больше a и b (чтобы после разрезов что‑то осталось)

    bool found = false;
    long long result = -1;

    // Проверка первого корня
    if ((a + b + sqrtD) % 2 == 0 && x1 > 0 && x1 > a && x1 > b) {
        found = true;
        result = x1;
    }

    // Проверка второго корня (если первый не подошёл)
    if (!found && (a + b - sqrtD) % 2 == 0 && x2 > 0 && x2 > a && x2 > b) {
        found = true;
        result = x2;
    }

    if (found) {
        cout << result << endl;
    } else {
        cout << -1 << endl;
    }

    return 0;
}
```
Скорость: 2ms. Память: 668Kb.

__Решение с помощью бинарного поиска:__

```cpp
#include <iostream>
#include <algorithm>

using namespace std;

int main() {
    long long a, b, S;
    cin >> a >> b >> S;

    // Определяем границы поиска
    long long left = max(a, b) + 1;  // x должно быть больше a и b
    long long right = max(a, b) + S + 1; // Верхняя граница

    long long result = -1;

    while (left <= right) {
        long long mid = left + (right - left) / 2; // Избегаем переполнения

        // Вычисляем площадь оставшейся части
        long long current_area = (mid - a) * (mid - b);

        if (current_area == S) {
            result = mid;
            break;
        } else if (current_area < S) {
            left = mid + 1;
        } else {
            right = mid - 1;
        }
    }

    if (result != -1) {
        cout << result << endl;
    } else {
        cout << -1 << endl;
    }

    return 0;
}
```
Скорость: 2ms. Память: 668Kb.
