### B. Из тупика в тупик

Каждый вечер после работы Вася приходит домой и думает о жизни. Вася описал свои перспективы в виде _n_ жизненных ситуаций и соединил их _n−1_ двунаправленными переходами 
так, что между двумя любыми жизненными ситуациями существовал ровно один простой путь, возможно через промежуточные ситуации. 
Жизненным тупиком называется жизненная ситуация, из которой существует ровно один переход.
Помогите Васе найти самый короткий путь из одного жизненного тупика в другой.

__Формат ввода__
В первой строке вводится целое число _n_ — число жизненных ситуаций (2 ≤ n ≤ 10).
В следующих _n−1_ строках заданы по два числа _ai_, _bi_ — номера жизненных ситуаций, между которыми возможен переход (1 ≤ ai ,bi ≤ n).
Гарантируется, что между любыми двумя жизненными ситуациями существует ровно один простой путь.

__Формат вывода__
Выведите одно число — минимальное количество переходов, которое нужно совершить Васе чтобы попасть из одного жизненного тупика в другой.

```cpp
#include <iostream>
#include <vector>
#include <queue>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(nullptr);

    int n;
    cin >> n;

    vector<vector<int>> graph(n + 1);
    vector<int> degree(n + 1, 0);

    // Чтение рёбер
    for (int i = 0; i < n - 1; ++i) {
        int a, b;
        cin >> a >> b;
        graph[a].push_back(b);
        graph[b].push_back(a);
        degree[a]++;
        degree[b]++;
    }

    // Находим все листья (тупики)
    vector<int> leaves;
    for (int i = 1; i <= n; ++i) {
        if (degree[i] == 1) {
            leaves.push_back(i);
        }
    }

    // Если всего два листа — путь между ними единственный
    if (leaves.size() == 2) {
        cout << n - 1 << endl; // В дереве с двумя листьями путь проходит через все вершины
        return 0;
    }

    // Запускаем BFS из первого листа
    int start = leaves[0];
    vector<bool> visited(n + 1, false);
    queue<pair<int, int>> q; // (вершина, расстояние)

    q.push({start, 0});
    visited[start] = true;

    while (!q.empty()) {
        auto [current, dist] = q.front();
        q.pop();

        // Если нашли другой лист — это ближайший, возвращаем расстояние
        if (degree[current] == 1 && current != start) {
            cout << dist << endl;
            return 0;
        }

        for (int neighbor : graph[current]) {
            if (!visited[neighbor]) {
                visited[neighbor] = true;
                q.push({neighbor, dist + 1});
            }
        }
    }

    // Гарантированно найдётся, так как граф связен и листьев > 2
    return 0;
```
Время: 36ms. Память: 6,70Mb.
