### B. Из тупика в тупик

Каждый вечер после работы Вася приходит домой и думает о жизни. Вася описал свои перспективы в виде _n_ жизненных ситуаций и соединил их _n−1_ двунаправленными переходами 
так, что между двумя любыми жизненными ситуациями существовал ровно один простой путь, возможно через промежуточные ситуации. 
Жизненным тупиком называется жизненная ситуация, из которой существует ровно один переход.
Помогите Васе найти самый короткий путь из одного жизненного тупика в другой.

__Формат ввода__
В первой строке вводится целое число _n_ — число жизненных ситуаций (2 ≤ n ≤ 10).
В следующих _n−1_ строках заданы по два числа _ai_, _bi_ — номера жизненных ситуаций, между которыми возможен переход (1 ≤ ai ,bi ≤ n).
Гарантируется, что между любыми двумя жизненными ситуациями существует ровно один простой путь.

__Формат вывода__
Выведите одно число — минимальное количество переходов, которое нужно совершить Васе чтобы попасть из одного жизненного тупика в другой.

```cpp
#include <iostream>
#include <vector>
#include <queue>

using namespace std;

int main() {
    ios_base::sync_with_stdio(false); //отключаем синхронизацию cin, cout со scanf, printf для ускорения
    cin.tie(nullptr); //отвязываем поток ввода cin от потока вывода cout для ускорения

    int n; 
    cin >> n;

    vector<vector<int>> graph(n + 1); //двухмерный вектор, чтобы создать список смежности графа
    vector<int> degree(n + 1, 0); //одномерный вектор для степеней вершин графа

    // Чтение рёбер
    for (int i = 0; i < n - 1; ++i) {
        int a, b;
        cin >> a >> b;
        graph[a].push_back(b); 
        graph[b].push_back(a); //так как граф неориентированный, создаём в обе стороны
        degree[a]++;
        degree[b]++;
    }

    // Если всего два листа — путь между ними единственный
    if (n == 2) {
        cout << 1 << endl;
        return 0;
    }

    // Multi-source BFS: начинаем из всех листьев
    vector<bool> visited(n + 1, false);
    vector<int> source(n + 1, -1); // откуда пришёл путь (номер листа)
    vector<int> dist(n + 1, 0); // расстояние от ближайшего листа
    queue<int> q;

    // Добавляем все листья в очередь
    for (int i = 1; i <= n; ++i) {
        if (degree[i] == 1) { // лист
            q.push(i);
            visited[i] = true;
            source[i] = i;
            dist[i] = 0;
        }
    }

    while (!q.empty()) {
        int current = q.front();
        q.pop();

        for (int neighbor : graph[current]) {
            if (!visited[neighbor]) {
                visited[neighbor] = true;
                source[neighbor] = source[current];
                dist[neighbor] = dist[current] + 1;
                q.push(neighbor);
            } else if (source[neighbor] != source[current]) {
                // Нашли встречу двух путей от разных листьев!
                // Общее расстояние = dist[current] + dist[neighbor] + 1
                int total_distance = dist[current] + dist[neighbor] + 1;
                cout << total_distance << endl;
                return 0;
            }
        }
    }

    // В дереве с ≥3 вершинами всегда найдётся путь между листьями
    // Этот код никогда не выполнится, но на всякий случай
    cout << 2 << endl;
    return 0;
}
```
Время: 36ms. Память: 6,70Mb.
